----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5\table5_ym.log
  log type:  text
 opened on:   3 Mar 2020, 16:22:25

. 
. *** Descriptive statistics for NLSY-YM samples
. 
. cd ..\Data_Tables_5_6_7\.
H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Data_Tables_5_6_7

. 
. use US_URate_Data\usurate16up.dta

. drop if year > 1999
(16 observations deleted)

. replace year = year - 1900
(40 real changes made)

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         40        79.5    11.69045         60         99

. sort year

. tempfile tempuryear

. save `tempuryear', replace
(note: file C:\Users\IRZJS01\AppData\Local\Temp\ST_1585c_000001.tmp not found)
file C:\Users\IRZJS01\AppData\Local\Temp\ST_1585c_000001.tmp saved

. clear

. 
. use NLSY_Datasets\nlsym_tenure.dta

. 
. cd ..\Table_5\.
H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5

. 
. keep rpce_hrp* jobten* indten* occten* wkswk_pcy* hgc* black female age* edgrp4* ic* oc* jc* caseid custwt

. reshape long rpce_hrp jobten indten occten wkswk_pcy hgc age edgrp4_ ic oc jc, i(caseid) j(year)
(note: j = 66 67 68 69 70 71 73 75 76 78 80 81)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     5225   ->   62700
Number of variables                 160   ->      40
j variable (12 values)                    ->   year
xij variables:
   rpce_hrp66 rpce_hrp67 ... rpce_hrp81   ->   rpce_hrp
         jobten66 jobten67 ... jobten81   ->   jobten
         indten66 indten67 ... indten81   ->   indten
         occten66 occten67 ... occten81   ->   occten
wkswk_pcy66 wkswk_pcy67 ... wkswk_pcy81   ->   wkswk_pcy
                  hgc66 hgc67 ... hgc81   ->   hgc
                  age66 age67 ... age81   ->   age
      edgrp4_66 edgrp4_67 ... edgrp4_81   ->   edgrp4_
                     ic66 ic67 ... ic81   ->   ic
                     oc66 oc67 ... oc81   ->   oc
                     jc66 jc67 ... jc81   ->   jc
-----------------------------------------------------------------------------

. *summ
. 
. gen lnrhw=ln(rpce_hrp)
(25,046 missing values generated)

. 
. *** Create samples 
. 
. gen cond=(rpce_hrp~=. & edgrp4_~=. & age~=. & black~=. & jobten~=. & indten~=. & occten~=. & wkswk_pcy > 0)

. 
. gen sample1=0

. replace sample1=1 if (age>=22 & age<=33) & cond==1
(11,892 real changes made)

. gen sample2=0

. replace sample2=1 if (age>=22 & age<=33) & cond==1 & wkswk_pcy >= 26
(11,466 real changes made)

. gen sample3=0

. replace sample3=1 if (age>=22 & age<=37) & cond==1 & wkswk_pcy >= 26
(12,721 real changes made)

. summ sample*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     sample1 |     62,700    .1896651    .3920391          0          1
     sample2 |     62,700    .1828708    .3865637          0          1
     sample3 |     62,700    .2028868    .4021521          0          1

. 
. drop if sample2==0 
(51,234 observations deleted)

. summ sample2 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     sample2 |     11,466           1           0          1          1

. 
. xi, prefix(_E) i.edgrp4_
i.edgrp4_         _Eedgrp4__1-4       (naturally coded; _Eedgrp4__1 omitted)

. 
. ** Unweighted means
. 
. summ year lnrhw black age _E* jobten indten occten ic oc jc 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |     11,466    72.67818    4.213766         66         81
       lnrhw |     11,466    2.706287    .3954055   1.141781   3.741501
       black |     11,466    .2193441    .4138203          0          1
         age |     11,466    26.68315    3.204035         22         33
 _Eedgrp4__2 |     11,466    .3779871    .4849055          0          1
-------------+---------------------------------------------------------
 _Eedgrp4__3 |     11,466    .2213501    .4151738          0          1
 _Eedgrp4__4 |     11,466    .1523635    .3593886          0          1
      jobten |     11,466    3.204249    3.055917          0       17.5
      indten |     11,466    3.580819    3.201935          0   20.83333
      occten |     11,466    3.625262    3.194097          0   20.83333
-------------+---------------------------------------------------------
          ic |     10,512    .2513318    .4337995          0          1
          oc |     10,512    .2410578    .4277457          0          1
          jc |     11,466    .3601954    .4800779          0          1

. tabstat lnrhw black age _E* jobten indten occten ic oc jc year, statistics(mean sd n) format(%8.3f) columns(statistics)

    variable |      mean        sd         N
-------------+------------------------------
       lnrhw |     2.706     0.395   1.1e+04
       black |     0.219     0.414   1.1e+04
         age |    26.683     3.204   1.1e+04
 _Eedgrp4__2 |     0.378     0.485   1.1e+04
 _Eedgrp4__3 |     0.221     0.415   1.1e+04
 _Eedgrp4__4 |     0.152     0.359   1.1e+04
      jobten |     3.204     3.056   1.1e+04
      indten |     3.581     3.202   1.1e+04
      occten |     3.625     3.194   1.1e+04
          ic |     0.251     0.434   1.1e+04
          oc |     0.241     0.428   1.1e+04
          jc |     0.360     0.480   1.1e+04
        year |    72.678     4.214   1.1e+04
--------------------------------------------

. 
. * unadjusted wages for those on job less than one year, etc.
. 
. summ rpce_hrp if jobten < 1 & jobten ~=.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    rpce_hrp |      3,165    14.04765    5.913555   3.132342   40.13943

. summ rpce_hrp if jobten < 0.5 & jobten ~=.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    rpce_hrp |      1,989    13.74249    5.864012   3.132342   40.13943

. 
. * use constants from regression on age dummies etc as start wages - gives cohort level average start wage, controlling for year effects
. xi, prefix(_A) i.age
i.age             _Aage_22-33         (naturally coded; _Aage_22 omitted)

. xi, prefix(_Y) i.year
i.year            _Yyear_66-81        (naturally coded; _Yyear_66 omitted)

. reg rpce_hrp black _E* _A* _Y* [w=custwt] if jobten < 1 & jobten~=.
(analytic weights assumed)
(sum of wgt is 1,196,812,288)

      Source |       SS           df       MS      Number of obs   =     3,165
-------------+----------------------------------   F(26, 3138)     =     27.83
       Model |   21069.696        26  810.372924   Prob > F        =    0.0000
    Residual |  91372.2452     3,138  29.1179876   R-squared       =    0.1874
-------------+----------------------------------   Adj R-squared   =    0.1806
       Total |  112441.941     3,164  35.5379081   Root MSE        =    5.3961

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -2.994572   .3271906    -9.15   0.000    -3.636101   -2.353042
 _Eedgrp4__2 |   1.905028   .2543466     7.49   0.000     1.406326    2.403731
 _Eedgrp4__3 |    1.86618    .278382     6.70   0.000     1.320351    2.412009
 _Eedgrp4__4 |     3.1726   .3114619    10.19   0.000      2.56191     3.78329
    _Aage_23 |   .7558972   .3380616     2.24   0.025      .093053    1.418741
    _Aage_24 |   .9340058   .3436015     2.72   0.007     .2602993    1.607712
    _Aage_25 |   1.592545   .3670117     4.34   0.000     .8729375    2.312152
    _Aage_26 |   2.660604   .3919461     6.79   0.000     1.892108    3.429101
    _Aage_27 |   2.302359   .4397173     5.24   0.000     1.440196    3.164521
    _Aage_28 |   3.404257   .4796521     7.10   0.000     2.463793     4.34472
    _Aage_29 |   2.890902   .5359926     5.39   0.000     1.839971    3.941834
    _Aage_30 |   4.584479   .6132141     7.48   0.000     3.382138    5.786821
    _Aage_31 |   5.335107   .6716554     7.94   0.000     4.018179    6.652036
    _Aage_32 |   5.769395   .7023288     8.21   0.000     4.392325    7.146466
    _Aage_33 |   6.691293    .787743     8.49   0.000     5.146749    8.235836
   _Yyear_67 |   .5114908   .3992953     1.28   0.200    -.2714156    1.294397
   _Yyear_68 |   1.221433   .4022545     3.04   0.002     .4327244    2.010142
   _Yyear_69 |   2.365367   .4039479     5.86   0.000     1.573338    3.157396
   _Yyear_70 |   1.395895   .4021583     3.47   0.001     .6073747    2.184415
   _Yyear_71 |   1.469325   .4304071     3.41   0.001     .6254171    2.313233
   _Yyear_73 |   2.335863     .40788     5.73   0.000     1.536124    3.135601
   _Yyear_75 |   2.201468   .4970549     4.43   0.000     1.226882    3.176053
   _Yyear_76 |   2.237401   .5968185     3.75   0.000     1.067207    3.407595
   _Yyear_78 |   1.790978   .6292959     2.85   0.004     .5571045    3.024851
   _Yyear_80 |   .7852775   .7340102     1.07   0.285    -.6539112    2.224466
   _Yyear_81 |   1.275085   1.055749     1.21   0.227    -.7949425    3.345113
       _cons |   10.06702   .3671657    27.42   0.000     9.347115    10.78693
------------------------------------------------------------------------------

. reg rpce_hrp black _E* _A* _Y* [w=custwt] if jobten < 0.5 & jobten~=.
(analytic weights assumed)
(sum of wgt is 747,953,740)

      Source |       SS           df       MS      Number of obs   =     1,989
-------------+----------------------------------   F(26, 1962)     =     16.36
       Model |  12379.6563        26  476.140626   Prob > F        =    0.0000
    Residual |  57094.8866     1,962  29.1003499   R-squared       =    0.1782
-------------+----------------------------------   Adj R-squared   =    0.1673
       Total |  69474.5428     1,988  34.9469531   Root MSE        =    5.3945

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -2.890819   .4093051    -7.06   0.000    -3.693537     -2.0881
 _Eedgrp4__2 |   1.923043   .3277556     5.87   0.000     1.280257    2.565829
 _Eedgrp4__3 |   2.069161   .3518201     5.88   0.000      1.37918    2.759141
 _Eedgrp4__4 |   2.875498   .3861055     7.45   0.000     2.118278    3.632718
    _Aage_23 |   .8242319   .4220407     1.95   0.051    -.0034633    1.651927
    _Aage_24 |   .8798769   .4296337     2.05   0.041     .0372905    1.722463
    _Aage_25 |   1.409319   .4664598     3.02   0.003     .4945103    2.324128
    _Aage_26 |   2.566587   .4928605     5.21   0.000     1.600002    3.533172
    _Aage_27 |   2.231129   .5588427     3.99   0.000     1.135141    3.327117
    _Aage_28 |   2.777205   .5989649     4.64   0.000     1.602531    3.951879
    _Aage_29 |   1.587826   .6929218     2.29   0.022     .2288863    2.946767
    _Aage_30 |   3.976939   .7782638     5.11   0.000     2.450629     5.50325
    _Aage_31 |   4.034309   .8654828     4.66   0.000     2.336946    5.731671
    _Aage_32 |   6.305914   .8816126     7.15   0.000     4.576918    8.034909
    _Aage_33 |   6.984537   .9459634     7.38   0.000     5.129338    8.839735
   _Yyear_67 |   .3518844   .5031555     0.70   0.484     -.634891     1.33866
   _Yyear_68 |   .9191743   .5014837     1.83   0.067    -.0643223    1.902671
   _Yyear_69 |     1.9399   .5212406     3.72   0.000     .9176568    2.962144
   _Yyear_70 |   1.073594   .5134194     2.09   0.037     .0666891    2.080498
   _Yyear_71 |   1.122153    .531146     2.11   0.035     .0804837    2.163823
   _Yyear_73 |    1.94226   .5082487     3.82   0.000     .9454959    2.939024
   _Yyear_75 |   1.876286    .659474     2.85   0.004     .5829423    3.169629
   _Yyear_76 |   2.168293   .7510805     2.89   0.004     .6952941    3.641293
   _Yyear_78 |   1.977585   .8019496     2.47   0.014      .404822    3.550347
   _Yyear_80 |   1.226445   .9455545     1.30   0.195    -.6279512    3.080842
   _Yyear_81 |   1.069737   1.374671     0.78   0.437    -1.626232    3.765707
       _cons |   10.17973   .4721936    21.56   0.000     9.253672    11.10578
------------------------------------------------------------------------------

. 
. reg rpce_hrp black _A* _Y* [w=custwt] if jobten < 1 & jobten~=. & (edgrp4_==1 | edgrp4_==2)
(analytic weights assumed)
(sum of wgt is 706,980,665)

      Source |       SS           df       MS      Number of obs   =     2,020
-------------+----------------------------------   F(23, 1996)     =     14.75
       Model |  9707.97065        23  422.085681   Prob > F        =    0.0000
    Residual |  57136.5778     1,996    28.62554   R-squared       =    0.1452
-------------+----------------------------------   Adj R-squared   =    0.1354
       Total |  66844.5485     2,019  33.1077506   Root MSE        =    5.3503

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -3.612753   .3456682   -10.45   0.000    -4.290661   -2.934845
    _Aage_23 |   .8680334   .4321401     2.01   0.045     .0205406    1.715526
    _Aage_24 |   .8573936   .4287069     2.00   0.046     .0166337    1.698153
    _Aage_25 |   1.431531   .4546956     3.15   0.002     .5398032    2.323259
    _Aage_26 |   2.593975   .4851148     5.35   0.000     1.642591     3.54536
    _Aage_27 |   1.708573   .5429274     3.15   0.002     .6438096    2.773337
    _Aage_28 |   2.524421   .5915021     4.27   0.000     1.364395    3.684447
    _Aage_29 |   1.638012   .6758296     2.42   0.015     .3126068    2.963418
    _Aage_30 |   2.568978   .8097397     3.17   0.002     .9809542    4.157001
    _Aage_31 |   4.109982   .8134272     5.05   0.000     2.514726    5.705237
    _Aage_32 |   4.523963    .843815     5.36   0.000     2.869113    6.178813
    _Aage_33 |   1.810219   1.002488     1.81   0.071    -.1558133    3.776251
   _Yyear_67 |     .35826   .4699763     0.76   0.446    -.5634356    1.279956
   _Yyear_68 |   1.086108   .4787253     2.27   0.023      .147254    2.024961
   _Yyear_69 |   1.989891   .4778348     4.16   0.000     1.052784    2.926998
   _Yyear_70 |   1.122792   .4985893     2.25   0.024     .1449817    2.100602
   _Yyear_71 |   1.739291   .5389007     3.23   0.001     .6824245    2.796158
   _Yyear_73 |   2.534983    .508209     4.99   0.000     1.538307    3.531658
   _Yyear_75 |   2.725212   .6197105     4.40   0.000     1.509865     3.94056
   _Yyear_76 |   2.210176   .7448535     2.97   0.003     .7494044    3.670948
   _Yyear_78 |   2.438568   .7840654     3.11   0.002     .9008959    3.976241
   _Yyear_80 |   3.587102   .9657206     3.71   0.000     1.693176    5.481028
   _Yyear_81 |   3.869907   1.347667     2.87   0.004     1.226925    6.512888
       _cons |   11.55107   .4042809    28.57   0.000     10.75821    12.34392
------------------------------------------------------------------------------

. reg rpce_hrp black _A* _Y* [w=custwt] if jobten < 1 & jobten~=. & (edgrp4_==3 | edgrp4_==4)
(analytic weights assumed)
(sum of wgt is 489,831,623)

      Source |       SS           df       MS      Number of obs   =     1,145
-------------+----------------------------------   F(23, 1121)     =     14.00
       Model |  9559.22132        23  415.618318   Prob > F        =    0.0000
    Residual |  33289.7101     1,121  29.6964408   R-squared       =    0.2231
-------------+----------------------------------   Adj R-squared   =    0.2072
       Total |  42848.9315     1,144  37.4553597   Root MSE        =    5.4494

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.106008   .8110529    -1.36   0.173    -2.697361    .4853442
    _Aage_23 |   .8282105   .5452706     1.52   0.129    -.2416553    1.898076
    _Aage_24 |   1.273591   .5718409     2.23   0.026     .1515918     2.39559
    _Aage_25 |   1.999362   .6186846     3.23   0.001     .7854518    3.213272
    _Aage_26 |   2.982279    .659524     4.52   0.000     1.688238    4.276319
    _Aage_27 |   3.396851   .7484023     4.54   0.000     1.928424    4.865278
    _Aage_28 |   4.931133   .8194242     6.02   0.000     3.323355    6.538911
    _Aage_29 |    4.57003   .8775487     5.21   0.000     2.848207    6.291853
    _Aage_30 |   7.494979   .9558579     7.84   0.000     5.619507    9.370451
    _Aage_31 |   7.671094   1.160637     6.61   0.000     5.393828     9.94836
    _Aage_32 |   8.757485   1.246094     7.03   0.000     6.312546    11.20242
    _Aage_33 |    13.6644    1.27404    10.73   0.000     11.16463    16.16417
   _Yyear_67 |   1.106618   .7338196     1.51   0.132    -.3331969    2.546432
   _Yyear_68 |   1.448915   .7234997     2.00   0.045     .0293485    2.868481
   _Yyear_69 |   3.096414   .7363611     4.21   0.000     1.651613    4.541215
   _Yyear_70 |   2.561309   .6879795     3.72   0.000     1.211436    3.911181
   _Yyear_71 |   1.750602   .7277904     2.41   0.016     .3226173    3.178587
   _Yyear_73 |   2.755614   .6897641     4.00   0.000     1.402239    4.108988
   _Yyear_75 |   1.965092   .8284444     2.37   0.018     .3396159    3.590568
   _Yyear_76 |   2.562709   .9955927     2.57   0.010     .6092744    4.516144
   _Yyear_78 |   1.458493   1.049171     1.39   0.165    -.6000678    3.517054
   _Yyear_80 |  -2.375494   1.152585    -2.06   0.040     -4.63696   -.1140276
   _Yyear_81 |  -2.773328   1.717619    -1.61   0.107    -6.143438    .5967824
       _cons |    11.3343   .5882266    19.27   0.000     10.18015    12.48845
------------------------------------------------------------------------------

. 
. * Redo controlling for UR and dropping year effects
. sort year

. merge m:1 year using `tempuryear', keepusing(year usurate16up)
(note: variable year was byte, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                            28
        from master                         0  (_merge==1)
        from using                         28  (_merge==2)

    matched                            11,466  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(28 observations deleted)

. drop _merge

. reg rpce_hrp black _E* _A* usurate16up [w=custwt] if jobten < 1 & jobten~=.
(analytic weights assumed)
(sum of wgt is 1,196,812,288)

      Source |       SS           df       MS      Number of obs   =     3,165
-------------+----------------------------------   F(16, 3148)     =     41.08
       Model |  19423.7505        16  1213.98441   Prob > F        =    0.0000
    Residual |  93018.1907     3,148  29.5483452   R-squared       =    0.1727
-------------+----------------------------------   Adj R-squared   =    0.1685
       Total |  112441.941     3,164  35.5379081   Root MSE        =    5.4358

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -3.023681   .3290305    -9.19   0.000    -3.668817   -2.378545
 _Eedgrp4__2 |   1.951628   .2550092     7.65   0.000     1.451627    2.451629
 _Eedgrp4__3 |   2.022686   .2765386     7.31   0.000     1.480472      2.5649
 _Eedgrp4__4 |   3.189811   .3117245    10.23   0.000     2.578607    3.801015
    _Aage_23 |   .7536722   .3404202     2.21   0.027     .0862043     1.42114
    _Aage_24 |   .9899053   .3457278     2.86   0.004     .3120306     1.66778
    _Aage_25 |   1.789154   .3678541     4.86   0.000     1.067896    2.510412
    _Aage_26 |    3.13612   .3861137     8.12   0.000      2.37906     3.89318
    _Aage_27 |   2.851856   .4306736     6.62   0.000     2.007426    3.696285
    _Aage_28 |   3.904035   .4697931     8.31   0.000     2.982903    4.825167
    _Aage_29 |   3.269736   .5217739     6.27   0.000     2.246685    4.292788
    _Aage_30 |   4.813013   .5863207     8.21   0.000     3.663403    5.962622
    _Aage_31 |   5.744301   .6381515     9.00   0.000     4.493066    6.995536
    _Aage_32 |   6.129434    .678776     9.03   0.000     4.798546    7.460322
    _Aage_33 |   6.894697   .7491432     9.20   0.000     5.425838    8.363555
 usurate16up |   .1497545   .0768293     1.95   0.051    -.0008861    .3003951
       _cons |   10.50527   .4175517    25.16   0.000     9.686566    11.32397
------------------------------------------------------------------------------

. reg rpce_hrp black _E* _A* usurate16up [w=custwt] if jobten < 0.5 & jobten~=.
(analytic weights assumed)
(sum of wgt is 747,953,740)

      Source |       SS           df       MS      Number of obs   =     1,989
-------------+----------------------------------   F(16, 1972)     =     24.92
       Model |  11682.9062        16  730.181635   Prob > F        =    0.0000
    Residual |  57791.6367     1,972  29.3061038   R-squared       =    0.1682
-------------+----------------------------------   Adj R-squared   =    0.1614
       Total |  69474.5428     1,988  34.9469531   Root MSE        =    5.4135

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -2.899947   .4098014    -7.08   0.000    -3.703637   -2.096258
 _Eedgrp4__2 |   2.026154   .3263373     6.21   0.000     1.386152    2.666156
 _Eedgrp4__3 |   2.234349   .3465327     6.45   0.000      1.55474    2.913958
 _Eedgrp4__4 |   2.874204   .3852753     7.46   0.000     2.118615    3.629794
    _Aage_23 |   .7665629   .4231458     1.81   0.070    -.0632969    1.596423
    _Aage_24 |   .9245593   .4304605     2.15   0.032     .0803541    1.768765
    _Aage_25 |   1.557381    .465177     3.35   0.001      .645091    2.469671
    _Aage_26 |   2.971192   .4839113     6.14   0.000     2.022161    3.920223
    _Aage_27 |   2.665994   .5466114     4.88   0.000     1.593997    3.737991
    _Aage_28 |   3.245681   .5840948     5.56   0.000     2.100173    4.391189
    _Aage_29 |   2.028128   .6721749     3.02   0.003     .7098805    3.346376
    _Aage_30 |   4.321266    .737437     5.86   0.000     2.875029    5.767504
    _Aage_31 |   4.470847   .8144713     5.49   0.000     2.873532    6.068162
    _Aage_32 |     6.8018   .8534919     7.97   0.000     5.127959    8.475641
    _Aage_33 |   7.406741   .8874758     8.35   0.000     5.666252     9.14723
 usurate16up |   .1614163   .0990971     1.63   0.104    -.0329296    .3557623
       _cons |   10.32729   .5388541    19.17   0.000     9.270508    11.38407
------------------------------------------------------------------------------

. reg rpce_hrp black _A* usurate16up [w=custwt] if jobten < 1 & jobten~=. & (edgrp4_==1 | edgrp4_==2)
(analytic weights assumed)
(sum of wgt is 706,980,665)

      Source |       SS           df       MS      Number of obs   =     2,020
-------------+----------------------------------   F(13, 2006)     =     23.12
       Model |  8708.94292        13  669.918686   Prob > F        =    0.0000
    Residual |  58135.6056     2,006  28.9808602   R-squared       =    0.1303
-------------+----------------------------------   Adj R-squared   =    0.1247
       Total |  66844.5485     2,019  33.1077506   Root MSE        =    5.3834

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -3.655378   .3469428   -10.54   0.000    -4.335784   -2.974972
    _Aage_23 |   .8283494   .4344477     1.91   0.057    -.0236664    1.680365
    _Aage_24 |   .8814665   .4304382     2.05   0.041     .0373138    1.725619
    _Aage_25 |   1.505994   .4557862     3.30   0.001     .6121305    2.399858
    _Aage_26 |   2.981308   .4764658     6.26   0.000     2.046888    3.915727
    _Aage_27 |   2.203477   .5266814     4.18   0.000     1.170577    3.236377
    _Aage_28 |   3.096553   .5793761     5.34   0.000     1.960311    4.232795
    _Aage_29 |     2.2987   .6557831     3.51   0.000     1.012613    3.584787
    _Aage_30 |   3.382385   .7845075     4.31   0.000      1.84385     4.92092
    _Aage_31 |   5.090446   .7703011     6.61   0.000     3.579772     6.60112
    _Aage_32 |   5.449558   .8193296     6.65   0.000     3.842732    7.056384
    _Aage_33 |   2.473679   .9590802     2.58   0.010      .592781    4.354576
 usurate16up |   .3191389   .0961441     3.32   0.001     .1305861    .5076916
       _cons |   11.23653   .5021867    22.38   0.000     10.25167    12.22139
------------------------------------------------------------------------------

. reg rpce_hrp black _A* usurate16up [w=custwt] if jobten < 1 & jobten~=. & (edgrp4_==3 | edgrp4_==4)
(analytic weights assumed)
(sum of wgt is 489,831,623)

      Source |       SS           df       MS      Number of obs   =     1,145
-------------+----------------------------------   F(13, 1131)     =     19.58
       Model |  7872.95766        13  605.612128   Prob > F        =    0.0000
    Residual |  34975.9738     1,131  30.9248221   R-squared       =    0.1837
-------------+----------------------------------   Adj R-squared   =    0.1744
       Total |  42848.9315     1,144  37.4553597   Root MSE        =     5.561

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.223954   .8256833    -1.48   0.139    -2.843997    .3960892
    _Aage_23 |   .8783562   .5558451     1.58   0.114    -.2122473     1.96896
    _Aage_24 |    1.32855   .5831502     2.28   0.023     .1843726    2.472728
    _Aage_25 |   2.340716   .6255694     3.74   0.000     1.113309    3.568123
    _Aage_26 |    3.53935   .6595857     5.37   0.000     2.245201    4.833499
    _Aage_27 |   3.931454   .7504344     5.24   0.000     2.459054    5.403854
    _Aage_28 |   5.097649   .8062275     6.32   0.000     3.515779    6.679519
    _Aage_29 |   4.575411   .8664559     5.28   0.000     2.875369    6.275453
    _Aage_30 |   6.483111   .9104087     7.12   0.000     4.696831    8.269391
    _Aage_31 |    7.10499   1.130507     6.28   0.000     4.886863    9.323117
    _Aage_32 |   7.499051   1.204498     6.23   0.000     5.135748    9.862353
    _Aage_33 |   12.35494   1.215182    10.17   0.000     9.970681    14.73921
 usurate16up |   .0124781   .1280339     0.10   0.922    -.2387325    .2636887
       _cons |   12.95836   .6674597    19.41   0.000     11.64876    14.26796
------------------------------------------------------------------------------

. 
. 
. * use average residual by survey year, after controlling for national UR - doesn't work well here bc sample is aging, wages get noisier as earnings rise even if control f
> or age
. 
. reg rpce_hrp black _E* _A* usurate16up [w=custwt] if jobten < 1 & jobten~=.
(analytic weights assumed)
(sum of wgt is 1,196,812,288)

      Source |       SS           df       MS      Number of obs   =     3,165
-------------+----------------------------------   F(16, 3148)     =     41.08
       Model |  19423.7505        16  1213.98441   Prob > F        =    0.0000
    Residual |  93018.1907     3,148  29.5483452   R-squared       =    0.1727
-------------+----------------------------------   Adj R-squared   =    0.1685
       Total |  112441.941     3,164  35.5379081   Root MSE        =    5.4358

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -3.023681   .3290305    -9.19   0.000    -3.668817   -2.378545
 _Eedgrp4__2 |   1.951628   .2550092     7.65   0.000     1.451627    2.451629
 _Eedgrp4__3 |   2.022686   .2765386     7.31   0.000     1.480472      2.5649
 _Eedgrp4__4 |   3.189811   .3117245    10.23   0.000     2.578607    3.801015
    _Aage_23 |   .7536722   .3404202     2.21   0.027     .0862043     1.42114
    _Aage_24 |   .9899053   .3457278     2.86   0.004     .3120306     1.66778
    _Aage_25 |   1.789154   .3678541     4.86   0.000     1.067896    2.510412
    _Aage_26 |    3.13612   .3861137     8.12   0.000      2.37906     3.89318
    _Aage_27 |   2.851856   .4306736     6.62   0.000     2.007426    3.696285
    _Aage_28 |   3.904035   .4697931     8.31   0.000     2.982903    4.825167
    _Aage_29 |   3.269736   .5217739     6.27   0.000     2.246685    4.292788
    _Aage_30 |   4.813013   .5863207     8.21   0.000     3.663403    5.962622
    _Aage_31 |   5.744301   .6381515     9.00   0.000     4.493066    6.995536
    _Aage_32 |   6.129434    .678776     9.03   0.000     4.798546    7.460322
    _Aage_33 |   6.894697   .7491432     9.20   0.000     5.425838    8.363555
 usurate16up |   .1497545   .0768293     1.95   0.051    -.0008861    .3003951
       _cons |   10.50527   .4175517    25.16   0.000     9.686566    11.32397
------------------------------------------------------------------------------

. predict resid12, residuals

. reg rpce_hrp black _E* _A* usurate16up [w=custwt] if jobten < 0.5 & jobten~=.
(analytic weights assumed)
(sum of wgt is 747,953,740)

      Source |       SS           df       MS      Number of obs   =     1,989
-------------+----------------------------------   F(16, 1972)     =     24.92
       Model |  11682.9062        16  730.181635   Prob > F        =    0.0000
    Residual |  57791.6367     1,972  29.3061038   R-squared       =    0.1682
-------------+----------------------------------   Adj R-squared   =    0.1614
       Total |  69474.5428     1,988  34.9469531   Root MSE        =    5.4135

------------------------------------------------------------------------------
    rpce_hrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -2.899947   .4098014    -7.08   0.000    -3.703637   -2.096258
 _Eedgrp4__2 |   2.026154   .3263373     6.21   0.000     1.386152    2.666156
 _Eedgrp4__3 |   2.234349   .3465327     6.45   0.000      1.55474    2.913958
 _Eedgrp4__4 |   2.874204   .3852753     7.46   0.000     2.118615    3.629794
    _Aage_23 |   .7665629   .4231458     1.81   0.070    -.0632969    1.596423
    _Aage_24 |   .9245593   .4304605     2.15   0.032     .0803541    1.768765
    _Aage_25 |   1.557381    .465177     3.35   0.001      .645091    2.469671
    _Aage_26 |   2.971192   .4839113     6.14   0.000     2.022161    3.920223
    _Aage_27 |   2.665994   .5466114     4.88   0.000     1.593997    3.737991
    _Aage_28 |   3.245681   .5840948     5.56   0.000     2.100173    4.391189
    _Aage_29 |   2.028128   .6721749     3.02   0.003     .7098805    3.346376
    _Aage_30 |   4.321266    .737437     5.86   0.000     2.875029    5.767504
    _Aage_31 |   4.470847   .8144713     5.49   0.000     2.873532    6.068162
    _Aage_32 |     6.8018   .8534919     7.97   0.000     5.127959    8.475641
    _Aage_33 |   7.406741   .8874758     8.35   0.000     5.666252     9.14723
 usurate16up |   .1614163   .0990971     1.63   0.104    -.0329296    .3557623
       _cons |   10.32729   .5388541    19.17   0.000     9.270508    11.38407
------------------------------------------------------------------------------

. predict resid6, residuals

. 
. preserve

. collapse resid12 resid6, by(year)

. list

     +------------------------------+
     | year     resid12      resid6 |
     |------------------------------|
  1. |   66   -.8641359   -.7263458 |
  2. |   67   -.1910985   -.0178751 |
  3. |   68    .5677807    .7604237 |
  4. |   69    1.055923    1.304928 |
  5. |   70    1.185887    1.561051 |
     |------------------------------|
  6. |   71    .9458201    1.345557 |
  7. |   73    1.768967      2.1581 |
  8. |   75    .7541827     1.04107 |
  9. |   76    1.331209    1.672232 |
 10. |   78     1.64355    2.088671 |
     |------------------------------|
 11. |   80    .5660782     1.02947 |
 12. |   81    .5789065    .8853929 |
     +------------------------------+

. 
. restore

. 
. 
. ** Calculate medians for tenure variables
. centile jobten indten occten 

                                                       -- Binom. Interp. --
    Variable |       Obs  Percentile    Centile        [95% Conf. Interval]
-------------+-------------------------------------------------------------
      jobten |    11,466         50        2.25        2.166667        2.25
      indten |    11,466         50    2.666667        2.583333        2.75
      occten |    11,466         50        2.75        2.583333    2.833333

. 
. ** Get number of respondents in analysis from cluster numbers in regs - N in tenure_returns is xxx
. 
. ** Mean and median number of job changes per person observed in data, mean and median years in data
. 
. drop if jc==.
(0 observations deleted)

. collapse (count) nyears=jc (sum) num_jc=jc, by(caseid)

. summ nyears num_jc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      nyears |      2,657    4.315393    2.461427          1          9
      num_jc |      2,657    1.554385    1.316655          0          8

. centile nyears num_jc

                                                       -- Binom. Interp. --
    Variable |       Obs  Percentile    Centile        [95% Conf. Interval]
-------------+-------------------------------------------------------------
      nyears |     2,657         50           4               4           4
      num_jc |     2,657         50           1               1           1

. tab1 nyear num_jc

-> tabulation of nyears  

 (count) jc |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        460       17.31       17.31
          2 |        367       13.81       31.13
          3 |        292       10.99       42.12
          4 |        278       10.46       52.58
          5 |        329       12.38       64.96
          6 |        337       12.68       77.64
          7 |        245        9.22       86.86
          8 |        239        9.00       95.86
          9 |        110        4.14      100.00
------------+-----------------------------------
      Total |      2,657      100.00

-> tabulation of num_jc  

   (sum) jc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        536       20.17       20.17
          1 |      1,001       37.67       57.85
          2 |        596       22.43       80.28
          3 |        293       11.03       91.31
          4 |        137        5.16       96.46
          5 |         62        2.33       98.80
          6 |         26        0.98       99.77
          7 |          4        0.15       99.92
          8 |          2        0.08      100.00
------------+-----------------------------------
      Total |      2,657      100.00

. 
. clear

. log close
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5\table5_ym.log
  log type:  text
 closed on:   3 Mar 2020, 16:22:27
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
