----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5\table5_79.log
  log type:  text
 opened on:   3 Mar 2020, 16:21:38

. 
. *** Descriptive statistics for NLSY79 samples
. /*** UPDATED version of file with same name that produced T5 for NBER paper - removes geo coded variables ***/
. /*** Big change is that omitting Rs who have a main jobs that is not CPS job reduces number of unique obs from about 4700 to about 2900 - NLSY sample size now similar to 
> NLSYM and NLSY97 ***/
. 
. cd ..\Data_Tables_5_6_7\.
H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Data_Tables_5_6_7

. 
. use US_URate_Data\usurate16up.dta

. 
. drop if year > 1999
(16 observations deleted)

. replace year = year - 1900
(40 real changes made)

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         40        79.5    11.69045         60         99

. sort year

. tempfile tempuryear

. save `tempuryear', replace
(note: file C:\Users\IRZJS01\AppData\Local\Temp\ST_e018_000001.tmp not found)
file C:\Users\IRZJS01\AppData\Local\Temp\ST_e018_000001.tmp saved

. clear

. 
. use NLSY_Datasets\nlsy79tenure.dta

. 
. cd ..\Table_5\.
H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5

. 
. keep rcpshrp* rpce_cpshrp* tenureyr1* jobten* indten* occten* hgcrev* esr_key* black hisp female age* edgrp4* wkswk_pcy* ic* oc* jc* job1iscps* caseid custwt

. reshape long rcpshrp rpce_cpshrp tenureyr1_ jobten indten occten hgcrev esr_key age edgrp4_ wkswk_pcy ic oc jc job1iscps, i(caseid) j(year)
(note: j = 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94)
(note: job1iscps79 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    12686   ->  202976
Number of variables                 245   ->      22
j variable (16 values)                    ->   year
xij variables:
      rcpshrp79 rcpshrp80 ... rcpshrp94   ->   rcpshrp
rpce_cpshrp79 rpce_cpshrp80 ... rpce_cpshrp94->rpce_cpshrp
tenureyr1_79 tenureyr1_80 ... tenureyr1_94->   tenureyr1_
         jobten79 jobten80 ... jobten94   ->   jobten
         indten79 indten80 ... indten94   ->   indten
         occten79 occten80 ... occten94   ->   occten
         hgcrev79 hgcrev80 ... hgcrev94   ->   hgcrev
      esr_key79 esr_key80 ... esr_key94   ->   esr_key
                  age79 age80 ... age94   ->   age
      edgrp4_79 edgrp4_80 ... edgrp4_94   ->   edgrp4_
wkswk_pcy79 wkswk_pcy80 ... wkswk_pcy94   ->   wkswk_pcy
                     ic79 ic80 ... ic94   ->   ic
                     oc79 oc80 ... oc94   ->   oc
                     jc79 jc80 ... jc94   ->   jc
job1iscps79 job1iscps80 ... job1iscps94   ->   job1iscps
-----------------------------------------------------------------------------

. *summ
. 
. *gen lnrhw=ln(rcpshrp)
. gen lnrhw=ln(rpce_cpshrp)
(84,671 missing values generated)

. 
. *** Create samples 
. 
. gen cond=(rpce_cpshrp~=. & tenureyr1_~=. & edgrp4_~=. & age~=. & black~=. & hisp~=. & female~=. & jobten~=. & indten~=. & occten~=.)

. 
. gen sample1=0

. replace sample1=1 if (age>=22 & age<=33) & cond==1
(41,670 real changes made)

. gen sample2=0

. replace sample2=1 if (age>=22 & age<=33) & cond==1 & wkswk_pcy >= 26
(37,573 real changes made)

. gen sample3=0

. replace sample3=1 if (age>=22 & age<=37) & cond==1 & wkswk_pcy >= 26
(40,378 real changes made)

. summ sample*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     sample1 |    202,976    .2052952    .4039182          0          1
     sample2 |    202,976    .1851106    .3883882          0          1
     sample3 |    202,976    .1989299    .3991962          0          1

. 
. drop if sample2==0 | female==1
(183,579 observations deleted)

. summ sample2 female

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     sample2 |     19,397           1           0          1          1
      female |     19,397           0           0          0          0

. 
. xi, prefix(_E) i.edgrp4_
i.edgrp4_         _Eedgrp4__1-4       (naturally coded; _Eedgrp4__1 omitted)

. 
. ** Unweighted means
. 
. summ year lnrhw black hisp female age _E* tenureyr1_ jobten indten occten ic oc jc 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |     19,397    87.24839    3.659551         79         94
       lnrhw |     19,397    2.557823    .4291917   .8497279   3.826623
       black |     19,397    .2171985    .4123495          0          1
        hisp |     19,397     .165438    .3715849          0          1
      female |     19,397           0           0          0          0
-------------+---------------------------------------------------------
         age |     19,397     26.7594    3.282955         22         33
 _Eedgrp4__2 |     19,397     .494561    .4999833          0          1
 _Eedgrp4__3 |     19,397    .2081765    .4060142          0          1
 _Eedgrp4__4 |     19,397    .1369284    .3437806          0          1
  tenureyr1_ |     19,397    3.320347    3.187619   .0192322   19.67459
-------------+---------------------------------------------------------
      jobten |     19,397    3.236401    3.070657   .0192322   19.25071
      indten |     19,397    3.571483    3.195152   .0192322   19.25071
      occten |     19,397    3.555158    3.175211   .0192322   21.46204
          ic |     19,151    .2645293    .4410937          0          1
          oc |     19,151    .2676623    .4427521          0          1
-------------+---------------------------------------------------------
          jc |     19,397    .3289168    .4698318          0          1

. tabstat lnrhw black hisp age _E* jobten indten occten ic oc jc tenureyr1_ female year, statistics(mean sd n) format(%8.3f) columns(statistics)

    variable |      mean        sd         N
-------------+------------------------------
       lnrhw |     2.558     0.429   1.9e+04
       black |     0.217     0.412   1.9e+04
        hisp |     0.165     0.372   1.9e+04
         age |    26.759     3.283   1.9e+04
 _Eedgrp4__2 |     0.495     0.500   1.9e+04
 _Eedgrp4__3 |     0.208     0.406   1.9e+04
 _Eedgrp4__4 |     0.137     0.344   1.9e+04
      jobten |     3.236     3.071   1.9e+04
      indten |     3.571     3.195   1.9e+04
      occten |     3.555     3.175   1.9e+04
          ic |     0.265     0.441   1.9e+04
          oc |     0.268     0.443   1.9e+04
          jc |     0.329     0.470   1.9e+04
  tenureyr1_ |     3.320     3.188   1.9e+04
      female |     0.000     0.000   1.9e+04
        year |    87.248     3.660   1.9e+04
--------------------------------------------

. 
. * unadjusted wages for those on job less than one year, etc.
. 
. summ rpce_cpshrp if tenureyr1_ < 1 & tenureyr1_ ~=.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 rpce_cpshrp |      5,450    12.14942    5.382393   2.373746   36.41565

. summ rpce_cpshrp if tenureyr1_ < 0.5 & tenureyr1_ ~=.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 rpce_cpshrp |      3,055    11.82702    5.311884   2.373746   35.89272

. 
. * use constants from regression on age dummies - gives cohort level average start wage, controlling for year effects
. xi, prefix(_A) i.age
i.age             _Aage_22-33         (naturally coded; _Aage_22 omitted)

. xi, prefix(_Y) i.year
i.year            _Yyear_79-94        (naturally coded; _Yyear_79 omitted)

. reg rpce_cpshrp black hisp _E* _A* _Y* [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=.
(analytic weights assumed)
(sum of wgt is 1,571,749,124)

      Source |       SS           df       MS      Number of obs   =     5,450
-------------+----------------------------------   F(31, 5418)     =     29.03
       Model |   24204.219        31  780.781259   Prob > F        =    0.0000
    Residual |   145732.79     5,418  26.8978941   R-squared       =    0.1424
-------------+----------------------------------   Adj R-squared   =    0.1375
       Total |  169937.009     5,449   31.186825   Root MSE        =    5.1863

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.883796    .213927    -8.81   0.000    -2.303179   -1.464413
        hisp |  -.1422755   .3126336    -0.46   0.649    -.7551631    .4706121
 _Eedgrp4__2 |   1.230878   .2116343     5.82   0.000       .81599    1.645766
 _Eedgrp4__3 |   2.100056   .2346976     8.95   0.000     1.639955    2.560158
 _Eedgrp4__4 |   4.431998   .2530111    17.52   0.000     3.935994    4.928001
    _Aage_23 |  -.3034198   .2803739    -1.08   0.279    -.8530652    .2462257
    _Aage_24 |   .6268723   .2990436     2.10   0.036     .0406268    1.213118
    _Aage_25 |   1.135162   .3182167     3.57   0.000     .5113293    1.758995
    _Aage_26 |   .6339874   .3362117     1.89   0.059    -.0251227    1.293097
    _Aage_27 |   2.089826   .3543687     5.90   0.000     1.395121    2.784531
    _Aage_28 |   1.772988     .37332     4.75   0.000     1.041131    2.504846
    _Aage_29 |   2.489835   .3966125     6.28   0.000     1.712315    3.267354
    _Aage_30 |   1.856199   .4125233     4.50   0.000     1.047487     2.66491
    _Aage_31 |   2.844696   .4560381     6.24   0.000     1.950678    3.738714
    _Aage_32 |   3.406458   .5081993     6.70   0.000     2.410183    4.402733
    _Aage_33 |   2.314025   .5448171     4.25   0.000     1.245964    3.382085
   _Yyear_80 |  -2.188211   .9387956    -2.33   0.020    -4.028628   -.3477945
   _Yyear_81 |  -1.847559   .9303234    -1.99   0.047    -3.671367   -.0237512
   _Yyear_82 |  -1.383548   .9181873    -1.51   0.132    -3.183564    .4164678
   _Yyear_83 |  -2.753002   .9243538    -2.98   0.003    -4.565107   -.9408968
   _Yyear_84 |  -2.407082   .9183337    -2.62   0.009    -4.207385   -.6067789
   _Yyear_85 |  -1.820133   .9133807    -1.99   0.046    -3.610726   -.0295395
   _Yyear_86 |  -1.717425   .9092135    -1.89   0.059    -3.499849    .0649991
   _Yyear_87 |  -.8250681   .9163187    -0.90   0.368    -2.621421    .9712849
   _Yyear_88 |  -.9655591    .928227    -1.04   0.298    -2.785257     .854139
   _Yyear_89 |  -1.610806   .9348145    -1.72   0.085    -3.443418    .2218063
   _Yyear_90 |  -.8629832    .946302    -0.91   0.362    -2.718116    .9921491
   _Yyear_91 |   -.781706   .9606474    -0.81   0.416    -2.664961    1.101549
   _Yyear_92 |  -1.659669   .9829462    -1.69   0.091    -3.586638    .2673011
   _Yyear_93 |  -1.973191   1.003793    -1.97   0.049    -3.941029    -.005354
   _Yyear_94 |  -.8149052   1.014858    -0.80   0.422    -2.804436    1.174625
       _cons |   11.56332   .8752454    13.21   0.000      9.84749    13.27916
------------------------------------------------------------------------------

. reg rpce_cpshrp black hisp _E* _A* _Y* [w=custwt] if tenureyr1_ < 0.5 & tenureyr1_~=.
(analytic weights assumed)
(sum of wgt is 865,961,659)

      Source |       SS           df       MS      Number of obs   =     3,055
-------------+----------------------------------   F(31, 3023)     =     14.78
       Model |  12139.1434        31  391.585271   Prob > F        =    0.0000
    Residual |  80072.0264     3,023  26.4876038   R-squared       =    0.1316
-------------+----------------------------------   Adj R-squared   =    0.1227
       Total |  92211.1698     3,054  30.1935723   Root MSE        =    5.1466

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.890026   .2777053    -6.81   0.000    -2.434537   -1.345516
        hisp |  -.1521528   .4010972    -0.38   0.704    -.9386037    .6342981
 _Eedgrp4__2 |   1.211672   .2755137     4.40   0.000     .6714586    1.751885
 _Eedgrp4__3 |   1.914964   .3070872     6.24   0.000     1.312843    2.517085
 _Eedgrp4__4 |    4.06512   .3464987    11.73   0.000     3.385723    4.744517
    _Aage_23 |   -.071657   .3777698    -0.19   0.850    -.8123687    .6690547
    _Aage_24 |   .8384521    .393311     2.13   0.033     .0672681    1.609636
    _Aage_25 |   1.475154   .4289459     3.44   0.001     .6340992     2.31621
    _Aage_26 |   1.346796   .4513953     2.98   0.003     .4617227    2.231869
    _Aage_27 |   2.342676    .481969     4.86   0.000     1.397656    3.287696
    _Aage_28 |   1.989131   .4956621     4.01   0.000     1.017262       2.961
    _Aage_29 |   3.362681    .530369     6.34   0.000     2.322761    4.402602
    _Aage_30 |   2.454134   .5698369     4.31   0.000     1.336827    3.571441
    _Aage_31 |    3.25471   .6180622     5.27   0.000     2.042846    4.466575
    _Aage_32 |   4.326892   .6441297     6.72   0.000     3.063915    5.589868
    _Aage_33 |   3.167292   .7333729     4.32   0.000     1.729332    4.605252
   _Yyear_80 |  -2.578826    1.40168    -1.84   0.066    -5.327169    .1695166
   _Yyear_81 |  -2.087642   1.384576    -1.51   0.132    -4.802448    .6271647
   _Yyear_82 |  -2.005932   1.373684    -1.46   0.144    -4.699381    .6875165
   _Yyear_83 |  -2.747385   1.382919    -1.99   0.047    -5.458941   -.0358285
   _Yyear_84 |  -2.780618   1.371429    -2.03   0.043    -5.469646   -.0915899
   _Yyear_85 |  -2.267647   1.372884    -1.65   0.099    -4.959529    .4242351
   _Yyear_86 |  -2.010005   1.365923    -1.47   0.141    -4.688237    .6682261
   _Yyear_87 |  -1.008642   1.375056    -0.73   0.463    -3.704781    1.687497
   _Yyear_88 |   -1.21191   1.386586    -0.87   0.382    -3.930658    1.506838
   _Yyear_89 |  -2.283066   1.394657    -1.64   0.102    -5.017639    .4515074
   _Yyear_90 |  -1.257527   1.413053    -0.89   0.374     -4.02817    1.513117
   _Yyear_91 |  -2.091815   1.428372    -1.46   0.143    -4.892494     .708864
   _Yyear_92 |  -2.676909   1.446199    -1.85   0.064    -5.512542    .1587228
   _Yyear_93 |  -2.982169   1.480797    -2.01   0.044     -5.88564   -.0786971
   _Yyear_94 |  -2.955466   1.497144    -1.97   0.048     -5.89099   -.0199418
       _cons |   11.58649   1.322392     8.76   0.000     8.993606    14.17936
------------------------------------------------------------------------------

. 
. reg rpce_cpshrp black hisp _A* _Y* [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=. & (edgrp4_==1 | edgrp4_==2)
(analytic weights assumed)
(sum of wgt is 934,915,337)

      Source |       SS           df       MS      Number of obs   =     3,563
-------------+----------------------------------   F(28, 3534)     =      8.19
       Model |  5366.23928        28  191.651403   Prob > F        =    0.0000
    Residual |  82742.7465     3,534  23.4133408   R-squared       =    0.0609
-------------+----------------------------------   Adj R-squared   =    0.0535
       Total |  88108.9858     3,562  24.7358186   Root MSE        =    4.8387

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -2.069291   .2263567    -9.14   0.000    -2.513094   -1.625488
        hisp |  -.5571737   .3356849    -1.66   0.097     -1.21533    .1009821
    _Aage_23 |  -.4450308   .3245257    -1.37   0.170    -1.081307    .1912459
    _Aage_24 |   .2606038   .3391001     0.77   0.442    -.4042478    .9254554
    _Aage_25 |   .8678225   .3611291     2.40   0.016     .1597799    1.575865
    _Aage_26 |   .5881561   .3825494     1.54   0.124     -.161884    1.338196
    _Aage_27 |    1.34036   .4126431     3.25   0.001      .531317    2.149402
    _Aage_28 |   1.052091   .4477065     2.35   0.019     .1743017     1.92988
    _Aage_29 |   2.078269   .4538184     4.58   0.000     1.188497    2.968041
    _Aage_30 |   1.511623   .4813566     3.14   0.002     .5678579    2.455387
    _Aage_31 |   2.080705   .5354493     3.89   0.000     1.030884    3.130526
    _Aage_32 |   3.132546   .5798318     5.40   0.000     1.995707    4.269385
    _Aage_33 |   1.608676   .6364802     2.53   0.012     .3607706    2.856582
   _Yyear_80 |  -1.883006   .9692627    -1.94   0.052    -3.783377    .0173649
   _Yyear_81 |  -1.480915   .9670849    -1.53   0.126    -3.377016    .4151862
   _Yyear_82 |   -1.02722   .9304644    -1.10   0.270    -2.851521    .7970818
   _Yyear_83 |   -2.38809   .9357239    -2.55   0.011    -4.222704   -.5534768
   _Yyear_84 |  -2.309686   .9321301    -2.48   0.013    -4.137254    -.482119
   _Yyear_85 |  -1.630341   .9224811    -1.77   0.077     -3.43899    .1783082
   _Yyear_86 |  -1.768827   .9225447    -1.92   0.055    -3.577601    .0399467
   _Yyear_87 |  -.8659956   .9314524    -0.93   0.353    -2.692234    .9602429
   _Yyear_88 |  -1.218696   .9472486    -1.29   0.198    -3.075905    .6385136
   _Yyear_89 |  -2.076082   .9579147    -2.17   0.030    -3.954204   -.1979608
   _Yyear_90 |  -1.656508   .9720726    -1.70   0.088    -3.562388    .2493722
   _Yyear_91 |  -1.474069   .9927437    -1.48   0.138    -3.420477    .4723399
   _Yyear_92 |  -1.738196   1.030469    -1.69   0.092     -3.75857    .2821791
   _Yyear_93 |   -2.16311   1.045228    -2.07   0.039    -4.212421   -.1137989
   _Yyear_94 |  -2.288988   1.063551    -2.15   0.031    -4.374224   -.2037522
       _cons |   12.99458   .8573129    15.16   0.000      11.3137    14.67545
------------------------------------------------------------------------------

. reg rpce_cpshrp black hisp _A* _Y* [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=. & (edgrp4_==3 | edgrp4_==4)
(analytic weights assumed)
(sum of wgt is 636,833,787)

      Source |       SS           df       MS      Number of obs   =     1,887
-------------+----------------------------------   F(28, 1858)     =     11.08
       Model |  10134.8556        28  361.959128   Prob > F        =    0.0000
    Residual |  60686.5458     1,858  32.6622959   R-squared       =    0.1431
-------------+----------------------------------   Adj R-squared   =    0.1302
       Total |  70821.4014     1,886  37.5511142   Root MSE        =    5.7151

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.865031   .4696061    -3.97   0.000    -2.786042   -.9440198
        hisp |   .1252539   .6601018     0.19   0.850    -1.169365    1.419873
    _Aage_23 |   .6738235   .5233662     1.29   0.198    -.3526241    1.700271
    _Aage_24 |   1.834308   .5796742     3.16   0.002     .6974265    2.971189
    _Aage_25 |   2.241801   .6142533     3.65   0.000     1.037102      3.4465
    _Aage_26 |   1.621022   .6531795     2.48   0.013     .3399789    2.902065
    _Aage_27 |   3.711641   .6597907     5.63   0.000     2.417632     5.00565
    _Aage_28 |   3.360358   .6722785     5.00   0.000     2.041858    4.678859
    _Aage_29 |   4.084981   .7566639     5.40   0.000      2.60098    5.568982
    _Aage_30 |   3.043386   .7655665     3.98   0.000     1.541925    4.544847
    _Aage_31 |   4.420766   .8411172     5.26   0.000     2.771132      6.0704
    _Aage_32 |   4.142829   .9820126     4.22   0.000     2.216865    6.068793
    _Aage_33 |   4.003745   1.012462     3.95   0.000     2.018063    5.989428
   _Yyear_80 |   -.383116   2.369353    -0.16   0.872    -5.029989    4.263757
   _Yyear_81 |  -.3045861   2.351862    -0.13   0.897    -4.917156    4.307984
   _Yyear_82 |  -.1373542   2.359518    -0.06   0.954     -4.76494    4.490232
   _Yyear_83 |  -2.038642     2.3752    -0.86   0.391    -6.696984    2.619699
   _Yyear_84 |   -1.00596   2.357906    -0.43   0.670    -5.630383    3.618463
   _Yyear_85 |   -.717527   2.358332    -0.30   0.761    -5.342785    3.907731
   _Yyear_86 |  -.1836067   2.341055    -0.08   0.937    -4.774982    4.407768
   _Yyear_87 |   .8189032   2.352239     0.35   0.728    -3.794405    5.432212
   _Yyear_88 |    1.04517   2.368541     0.44   0.659     -3.60011    5.690451
   _Yyear_89 |   .6513693   2.375166     0.27   0.784    -4.006906    5.309644
   _Yyear_90 |   2.076103   2.391743     0.87   0.385    -2.614682    6.766889
   _Yyear_91 |   1.956222   2.409164     0.81   0.417    -2.768731    6.681175
   _Yyear_92 |   .0371782   2.428841     0.02   0.988    -4.726365    4.800722
   _Yyear_93 |    .020317   2.475152     0.01   0.993    -4.834054    4.874688
   _Yyear_94 |    3.11625   2.483651     1.25   0.210    -1.754789    7.987289
       _cons |   11.72327   2.275543     5.15   0.000     7.260386    16.18616
------------------------------------------------------------------------------

. 
. * Redo controlling for UR and dropping year effects
. sort year

. merge m:1 year using `tempuryear', keepusing(year usurate16up)
(note: variable year was byte, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                            24
        from master                         0  (_merge==1)
        from using                         24  (_merge==2)

    matched                            19,397  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(24 observations deleted)

. drop _merge

. reg rpce_cpshrp black hisp _E* _A* usurate16up [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=.
(analytic weights assumed)
(sum of wgt is 1,571,749,124)

      Source |       SS           df       MS      Number of obs   =     5,450
-------------+----------------------------------   F(17, 5432)     =     49.96
       Model |  22976.6506        17  1351.56768   Prob > F        =    0.0000
    Residual |  146960.359     5,432  27.0545579   R-squared       =    0.1352
-------------+----------------------------------   Adj R-squared   =    0.1325
       Total |  169937.009     5,449   31.186825   Root MSE        =    5.2014

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.861594   .2140534    -8.70   0.000    -2.281224   -1.441964
        hisp |   -.124642   .3133353    -0.40   0.691    -.7389047    .4896207
 _Eedgrp4__2 |   1.250176   .2120879     5.89   0.000     .8343985    1.665953
 _Eedgrp4__3 |   2.095022   .2349596     8.92   0.000     1.634407    2.555637
 _Eedgrp4__4 |   4.451851   .2531882    17.58   0.000     3.955501    4.948202
    _Aage_23 |  -.2556199   .2706604    -0.94   0.345    -.7862228    .2749831
    _Aage_24 |   .6662158   .2766618     2.41   0.016     .1238477    1.208584
    _Aage_25 |   1.047808   .2880793     3.64   0.000     .4830576    1.612559
    _Aage_26 |   .6326639   .3050498     2.07   0.038      .034644    1.230684
    _Aage_27 |   2.291674   .3139669     7.30   0.000     1.676173    2.907175
    _Aage_28 |   1.981557   .3231402     6.13   0.000     1.348073    2.615041
    _Aage_29 |   2.681909    .340262     7.88   0.000     2.014859    3.348959
    _Aage_30 |   2.098821      .3441     6.10   0.000     1.424247    2.773395
    _Aage_31 |   3.079977   .3838902     8.02   0.000     2.327398    3.832556
    _Aage_32 |   3.684271   .4254767     8.66   0.000     2.850167    4.518376
    _Aage_33 |   2.653445   .4584699     5.79   0.000      1.75466     3.55223
 usurate16up |  -.2470822   .0644047    -3.84   0.000    -.3733412   -.1208232
       _cons |   11.63776   .5594208    20.80   0.000     10.54107    12.73445
------------------------------------------------------------------------------

. reg rpce_cpshrp black hisp _E* _A* usurate16up [w=custwt] if tenureyr1_ < 0.5 & tenureyr1_~=.
(analytic weights assumed)
(sum of wgt is 865,961,659)

      Source |       SS           df       MS      Number of obs   =     3,055
-------------+----------------------------------   F(17, 3037)     =     24.89
       Model |  11277.0405        17  663.355323   Prob > F        =    0.0000
    Residual |  80934.1293     3,037  26.6493676   R-squared       =    0.1223
-------------+----------------------------------   Adj R-squared   =    0.1174
       Total |  92211.1698     3,054  30.1935723   Root MSE        =    5.1623

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.911279   .2776442    -6.88   0.000    -2.455668   -1.366889
        hisp |  -.1753917   .4018625    -0.44   0.663    -.9633418    .6125584
 _Eedgrp4__2 |   1.152004   .2752035     4.19   0.000     .6123999    1.691608
 _Eedgrp4__3 |   1.892581   .3069352     6.17   0.000      1.29076    2.494403
 _Eedgrp4__4 |   4.018848   .3452364    11.64   0.000     3.341927    4.695768
    _Aage_23 |    .029879   .3650878     0.08   0.935    -.6859653    .7457232
    _Aage_24 |   .9032524   .3624752     2.49   0.013     .1925308    1.613974
    _Aage_25 |    1.40776   .3869087     3.64   0.000     .6491303    2.166389
    _Aage_26 |    1.27197   .4093502     3.11   0.002     .4693388    2.074602
    _Aage_27 |   2.390323   .4249402     5.63   0.000     1.557124    3.223523
    _Aage_28 |   1.925568   .4213594     4.57   0.000     1.099389    2.751746
    _Aage_29 |   3.182943   .4531446     7.02   0.000     2.294442    4.071444
    _Aage_30 |    2.15165   .4806642     4.48   0.000      1.20919     3.09411
    _Aage_31 |   2.972702   .5229169     5.68   0.000     1.947395    3.998009
    _Aage_32 |   3.812073   .5227555     7.29   0.000     2.787082    4.837063
    _Aage_33 |   2.591671   .6079396     4.26   0.000     1.399657    3.783686
 usurate16up |  -.2766747    .085099    -3.25   0.001    -.4435322   -.1098171
       _cons |   11.58478   .7438017    15.58   0.000     10.12637    13.04318
------------------------------------------------------------------------------

. reg rpce_cpshrp black hisp _A* usurate16up [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=. & (edgrp4_==1 | edgrp4_==2)
(analytic weights assumed)
(sum of wgt is 934,915,337)

      Source |       SS           df       MS      Number of obs   =     3,563
-------------+----------------------------------   F(14, 3548)     =     13.91
       Model |  4583.82299        14  327.415928   Prob > F        =    0.0000
    Residual |  83525.1628     3,548  23.5414777   R-squared       =    0.0520
-------------+----------------------------------   Adj R-squared   =    0.0483
       Total |  88108.9858     3,562  24.7358186   Root MSE        =     4.852

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -2.073736   .2264375    -9.16   0.000    -2.517697   -1.629775
        hisp |  -.5561811   .3363334    -1.65   0.098    -1.215607    .1032454
    _Aage_23 |  -.5219861   .3136528    -1.66   0.096    -1.136944    .0929718
    _Aage_24 |   .1717507   .3154346     0.54   0.586    -.4467007    .7902021
    _Aage_25 |   .6370484   .3279399     1.94   0.052    -.0059213    1.280018
    _Aage_26 |    .386623   .3465945     1.12   0.265    -.2929216    1.066168
    _Aage_27 |   1.280499    .366657     3.49   0.000     .5616188    1.999378
    _Aage_28 |   .9073192   .3838247     2.36   0.018       .15478    1.659858
    _Aage_29 |   1.872925   .3872756     4.84   0.000      1.11362    2.632231
    _Aage_30 |   1.211936   .4008909     3.02   0.003     .4259357    1.997935
    _Aage_31 |   1.710188   .4465466     3.83   0.000     .8346736    2.585702
    _Aage_32 |   2.724282   .4766049     5.72   0.000     1.789835     3.65873
    _Aage_33 |     1.2209   .5271668     2.32   0.021     .1873193     2.25448
 usurate16up |  -.0979926   .0753144    -1.30   0.193    -.2456564    .0496713
       _cons |   12.17849   .6221357    19.58   0.000     10.95871    13.39827
------------------------------------------------------------------------------

. reg rpce_cpshrp black hisp _A* usurate16up [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=. & (edgrp4_==3 | edgrp4_==4)
(analytic weights assumed)
(sum of wgt is 636,833,787)

      Source |       SS           df       MS      Number of obs   =     1,887
-------------+----------------------------------   F(14, 1872)     =     19.61
       Model |  9059.25432        14  647.089594   Prob > F        =    0.0000
    Residual |  61762.1471     1,872  32.9925999   R-squared       =    0.1279
-------------+----------------------------------   Adj R-squared   =    0.1214
       Total |  70821.4014     1,886  37.5511142   Root MSE        =    5.7439

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.784304   .4704507    -3.79   0.000    -2.706967   -.8616414
        hisp |   .1215493   .6623284     0.18   0.854     -1.17743    1.420529
    _Aage_23 |   .8370861   .5036574     1.66   0.097     -.150703    1.824875
    _Aage_24 |   1.912719    .528084     3.62   0.000     .8770239    2.948414
    _Aage_25 |   2.221027   .5504512     4.03   0.000     1.141465     3.30059
    _Aage_26 |   1.678205   .5868487     2.86   0.004     .5272582    2.829151
    _Aage_27 |   4.128221   .5799887     7.12   0.000     2.990728    5.265713
    _Aage_28 |   3.834551   .5850041     6.55   0.000     2.687222     4.98188
    _Aage_29 |   4.766052   .6503627     7.33   0.000      3.49054    6.041564
    _Aage_30 |   3.918067   .6366465     6.15   0.000     2.669456    5.166679
    _Aage_31 |   5.414235   .7122659     7.60   0.000     4.017317    6.811154
    _Aage_32 |   5.503561   .8389704     6.56   0.000     3.858145    7.148977
    _Aage_33 |   5.316659   .8639888     6.15   0.000     3.622177    7.011142
 usurate16up |  -.5115358   .1193214    -4.29   0.000    -.7455528   -.2775187
       _cons |   15.19675   .9741837    15.60   0.000     13.28615    17.10735
------------------------------------------------------------------------------

. 
. * use average residual by survey year, after controlling for national UR
. 
. reg rpce_cpshrp black _E* _A* usurate16up [w=custwt] if jobten < 1 & jobten~=.
(analytic weights assumed)
(sum of wgt is 1,571,749,124)

      Source |       SS           df       MS      Number of obs   =     5,450
-------------+----------------------------------   F(16, 5433)     =     53.08
       Model |  22972.3696        16   1435.7731   Prob > F        =    0.0000
    Residual |   146964.64     5,433  27.0503662   R-squared       =    0.1352
-------------+----------------------------------   Adj R-squared   =    0.1326
       Total |  169937.009     5,449   31.186825   Root MSE        =     5.201

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.852868   .2129098    -8.70   0.000    -2.270256   -1.435479
 _Eedgrp4__2 |   1.256849    .211407     5.95   0.000     .8424064    1.671291
 _Eedgrp4__3 |   2.101532   .2343709     8.97   0.000     1.642071    2.560993
 _Eedgrp4__4 |   4.462456   .2517613    17.72   0.000     3.968903    4.956009
    _Aage_23 |  -.2553988   .2706389    -0.94   0.345    -.7859595    .2751619
    _Aage_24 |   .6656195   .2766363     2.41   0.016     .1233014    1.207938
    _Aage_25 |   1.048318   .2880541     3.64   0.000     .4836166     1.61302
    _Aage_26 |    .632906   .3050256     2.07   0.038     .0349336    1.230878
    _Aage_27 |   2.292867   .3139282     7.30   0.000     1.677442    2.908292
    _Aage_28 |   1.981762   .3231147     6.13   0.000     1.348328    2.615196
    _Aage_29 |   2.682762   .3402289     7.89   0.000     2.015777    3.349747
    _Aage_30 |    2.10045    .344049     6.11   0.000     1.425976    2.774924
    _Aage_31 |    3.08135   .3838449     8.03   0.000      2.32886     3.83384
    _Aage_32 |   3.684802   .4254416     8.66   0.000     2.850766    4.518838
    _Aage_33 |   2.652331   .4584259     5.79   0.000     1.753632    3.551029
 usurate16up |  -.2469531   .0643989    -3.83   0.000    -.3732007   -.1207055
       _cons |   11.62227   .5580198    20.83   0.000     10.52833    12.71621
------------------------------------------------------------------------------

. predict resid12, residuals

. reg rpce_cpshrp black _E* _A* usurate16up [w=custwt] if jobten < 0.5 & jobten~=.
(analytic weights assumed)
(sum of wgt is 865,961,659)

      Source |       SS           df       MS      Number of obs   =     3,055
-------------+----------------------------------   F(16, 3038)     =     26.44
       Model |  11271.9642        16   704.49776   Prob > F        =    0.0000
    Residual |  80939.2057     3,038  26.6422665   R-squared       =    0.1222
-------------+----------------------------------   Adj R-squared   =    0.1176
       Total |  92211.1698     3,054  30.1935723   Root MSE        =    5.1616

------------------------------------------------------------------------------
 rpce_cpshrp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |   -1.89788   .2759049    -6.88   0.000    -2.438859     -1.3569
 _Eedgrp4__2 |   1.163269    .273954     4.25   0.000     .6261145    1.700423
 _Eedgrp4__3 |   1.904903   .3055934     6.23   0.000     1.305712    2.504094
 _Eedgrp4__4 |   4.036705   .3427576    11.78   0.000     3.364645    4.708766
    _Aage_23 |   .0297446   .3650391     0.08   0.935    -.6860039    .7454932
    _Aage_24 |   .9025396   .3624232     2.49   0.013       .19192    1.613159
    _Aage_25 |   1.407932    .386857     3.64   0.000     .6494043     2.16646
    _Aage_26 |   1.272177   .4092954     3.11   0.002     .4696533    2.074701
    _Aage_27 |   2.393133   .4248348     5.63   0.000      1.56014    3.226126
    _Aage_28 |   1.925974   .4213022     4.57   0.000     1.099907     2.75204
    _Aage_29 |   3.185011   .4530595     7.03   0.000     2.296677    4.073345
    _Aage_30 |   2.153508   .4805813     4.48   0.000      1.21121    3.095805
    _Aage_31 |   2.973221   .5228459     5.69   0.000     1.948054    3.998389
    _Aage_32 |    3.81317   .5226798     7.30   0.000     2.788328    4.838011
    _Aage_33 |   2.591332   .6078581     4.26   0.000     1.399477    3.783187
 usurate16up |   -.276199   .0850807    -3.25   0.001    -.4430206   -.1093774
       _cons |   11.55814   .7411947    15.59   0.000     10.10484    13.01143
------------------------------------------------------------------------------

. predict resid6, residuals

. 
. preserve

. collapse resid12 resid6, by(year)

. list

     +----------------------------+
     | year    resid12     resid6 |
     |----------------------------|
  1. |   79    .733808   1.081177 |
  2. |   80   .4619529   .8180291 |
  3. |   81    .967724   1.249957 |
  4. |   82   1.748734   2.048383 |
  5. |   83   1.409488   1.638099 |
     |----------------------------|
  6. |   84   .8723936   .9831956 |
  7. |   85   .9108742   1.059374 |
  8. |   86   1.060592   1.234442 |
  9. |   87   1.616726   1.758952 |
 10. |   88   1.684992   1.845386 |
     |----------------------------|
 11. |   89   1.294974   1.464372 |
 12. |   90   1.647275   1.875182 |
 13. |   91   2.005607    2.33942 |
 14. |   92   1.814149   2.184531 |
 15. |   93   1.916385    2.25338 |
     |----------------------------|
 16. |   94   2.095288   2.477143 |
     +----------------------------+

. 
. restore

. 
. ** Calculate medians for tenure variables
. centile tenureyr1_ jobten indten occten 

                                                       -- Binom. Interp. --
    Variable |       Obs  Percentile    Centile        [95% Conf. Interval]
-------------+-------------------------------------------------------------
  tenureyr1_ |    19,397         50    2.250173        2.211709     2.30787
      jobten |    19,397         50    2.230864          2.1924    2.288484
      indten |    19,397         50    2.615432        2.557735    2.673129
      occten |    19,397         50    2.615432        2.557735    2.673129

. 
. ** Get number of respondents in analysis from cluster numbers in regs - N in tenure_returns is 2965
. 
. ** Mean and median number of job changes per person observed in data, mean and median years in data
. 
. drop if jc==.
(0 observations deleted)

. collapse (count) nyears=jc (sum) num_jc=jc, by(caseid)

. summ nyears num_jc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      nyears |      2,967     6.53758     3.59082          1         12
      num_jc |      2,967     2.15032    1.926232          0         12

. centile nyears num_jc

                                                       -- Binom. Interp. --
    Variable |       Obs  Percentile    Centile        [95% Conf. Interval]
-------------+-------------------------------------------------------------
      nyears |     2,967         50           7               7           7
      num_jc |     2,967         50           2               2           2

. tab1 nyear num_jc

-> tabulation of nyears  

 (count) jc |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        320       10.79       10.79
          2 |        272        9.17       19.95
          3 |        255        8.59       28.55
          4 |        187        6.30       34.85
          5 |        164        5.53       40.38
          6 |        169        5.70       46.07
          7 |        225        7.58       53.66
          8 |        259        8.73       62.39
          9 |        325       10.95       73.34
         10 |        269        9.07       82.41
         11 |        340       11.46       93.87
         12 |        182        6.13      100.00
------------+-----------------------------------
      Total |      2,967      100.00

-> tabulation of num_jc  

   (sum) jc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        572       19.28       19.28
          1 |        813       27.40       46.68
          2 |        557       18.77       65.45
          3 |        395       13.31       78.77
          4 |        251        8.46       87.23
          5 |        185        6.24       93.46
          6 |         93        3.13       96.60
          7 |         54        1.82       98.42
          8 |         29        0.98       99.39
          9 |         12        0.40       99.80
         10 |          4        0.13       99.93
         11 |          1        0.03       99.97
         12 |          1        0.03      100.00
------------+-----------------------------------
      Total |      2,967      100.00

. 
. 
. log close
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5\table5_79.log
  log type:  text
 closed on:   3 Mar 2020, 16:21:39
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
