----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5\table5_97.log
  log type:  text
 opened on:   3 Mar 2020, 16:20:24

. 
. /*** Descriptive statistics for the NLSY 1997 ***/
. /*** UPDATED version of file with same name that produced T5 for NBER paper ***/
. /*** Big change from NBER is that corrected default coding of missing wages as negative - but does not affect sample size much ***/
. 
. cd ..\Data_Tables_5_6_7\.
H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Data_Tables_5_6_7

. 
. use US_URate_Data\usurate16up.dta

. drop if year < 1988
(28 observations deleted)

. summ year

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         28      2001.5    8.225975       1988       2015

. sort year

. tempfile tempuryear

. save `tempuryear', replace
(note: file C:\Users\IRZJS01\AppData\Local\Temp\ST_15c20_000001.tmp not found)
file C:\Users\IRZJS01\AppData\Local\Temp\ST_15c20_000001.tmp saved

. clear

. 
. use NLSY_Datasets\nlsy97tenure2013.dta

. 
. cd ..\Table_5\.
H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5

. 
. keep rhrp1* rpce_hrp1* tenureyr1* jobten* indten* occten* edgrp4* black hisp female age* edgrp4* wkswkann* ic* oc* jc* pubid custwt

. reshape long rhrp1_ rpce_hrp1_ tenureyr1_ jobten indten occten age edgrp4_ wkswkann ic oc jc, i(pubid) j(year)
(note: j = 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013)
(note: rhrp1_1996 not found)
(note: rpce_hrp1_1996 not found)
(note: tenureyr1_1996 not found)
(note: jobten1996 not found)
(note: indten1996 not found)
(note: occten1996 not found)
(note: age1996 not found)
(note: edgrp4_1996 not found)
(note: ic1996 not found)
(note: oc1996 not found)
(note: jc1996 not found)
(note: rhrp1_2012 not found)
(note: rpce_hrp1_2012 not found)
(note: tenureyr1_2012 not found)
(note: jobten2012 not found)
(note: indten2012 not found)
(note: occten2012 not found)
(note: age2012 not found)
(note: edgrp4_2012 not found)
(note: ic2012 not found)
(note: oc2012 not found)
(note: jc2012 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     8984   ->  161712
Number of variables                 215   ->      34
j variable (18 values)                    ->   year
xij variables:
   rhrp1_1996 rhrp1_1997 ... rhrp1_2013   ->   rhrp1_
rpce_hrp1_1996 rpce_hrp1_1997 ... rpce_hrp1_2013->rpce_hrp1_
tenureyr1_1996 tenureyr1_1997 ... tenureyr1_2013->tenureyr1_
   jobten1996 jobten1997 ... jobten2013   ->   jobten
   indten1996 indten1997 ... indten2013   ->   indten
   occten1996 occten1997 ... occten2013   ->   occten
            age1996 age1997 ... age2013   ->   age
edgrp4_1996 edgrp4_1997 ... edgrp4_2013   ->   edgrp4_
wkswkann1996 wkswkann1997 ... wkswkann2013->   wkswkann
               ic1996 ic1997 ... ic2013   ->   ic
               oc1996 oc1997 ... oc2013   ->   oc
               jc1996 jc1997 ... jc2013   ->   jc
-----------------------------------------------------------------------------

. *summ
. 
. *gen lnrhw=ln(rhrp1_)
. gen lnrhw=ln(rpce_hrp1_)
(72,217 missing values generated)

. 
. *** Create samples 
. 
. gen cond=(rpce_hrp1_~=. & tenureyr1_~=. & edgrp4_~=. & age~=. & black~=. & hisp~=. & female~=. & jobten~=. & indten~=. & occten~=.)

. summ age wkswkann if cond==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     69,907    22.17838     4.56959         13         34
    wkswkann |     69,907    39.43126    16.45755         -3         53

. 
. gen sample1=0

. replace sample1=1 if (age>=22 & age<=33) & cond==1
(36,178 real changes made)

. gen sample2=0

. replace sample2=1 if (age>=22 & age<=33) & cond==1 & wkswkann >= 26
(32,307 real changes made)

. 
. summ sample*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     sample1 |    161,712    .2237187     .416737          0          1
     sample2 |    161,712    .1997811     .399837          0          1

. drop if sample2==0 | female==1
(145,870 observations deleted)

. summ sample2 female

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     sample2 |     15,842           1           0          1          1
      female |     15,842           0           0          0          0

. 
. xi, prefix(_E) i.edgrp4_
i.edgrp4_         _Eedgrp4__1-4       (naturally coded; _Eedgrp4__1 omitted)

. 
. ** Unweighted means
. 
. summ year lnrhw black hisp female age _E* tenureyr1_ jobten indten occten ic oc jc 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |     15,842    2008.014     2.82056       2002       2013
       lnrhw |     15,842    2.609251    .4657098   .7397271     3.9307
       black |     15,842    .2091908    .4067437          0          1
        hisp |     15,842    .2155031    .4111839          0          1
      female |     15,842           0           0          0          0
-------------+---------------------------------------------------------
         age |     15,842    25.96282    2.857594         22         33
 _Eedgrp4__2 |     15,842    .3018558    .4590775          0          1
 _Eedgrp4__3 |     15,842    .2736397    .4458403          0          1
 _Eedgrp4__4 |     15,842    .2714935     .444744          0          1
  tenureyr1_ |     15,842    2.775616    2.642123   .0192322    23.6749
-------------+---------------------------------------------------------
      jobten |     15,842    2.838668    2.694909   .0192322   23.98154
      indten |     15,842    3.259577    2.903674   .0192322    23.0967
      occten |     15,842      3.1406    2.828241   .0192322    23.0967
          ic |     15,787    .3030341    .4595844          0          1
          oc |     15,787    .3159562    .4649103          0          1
-------------+---------------------------------------------------------
          jc |     15,842    .3758995    .4843696          0          1

. tabstat lnrhw black hisp age _E* jobten indten occten ic oc jc tenureyr1_ female year, statistics(mean sd n) format(%8.3f) columns(statistics)

    variable |      mean        sd         N
-------------+------------------------------
       lnrhw |     2.609     0.466   1.6e+04
       black |     0.209     0.407   1.6e+04
        hisp |     0.216     0.411   1.6e+04
         age |    25.963     2.858   1.6e+04
 _Eedgrp4__2 |     0.302     0.459   1.6e+04
 _Eedgrp4__3 |     0.274     0.446   1.6e+04
 _Eedgrp4__4 |     0.271     0.445   1.6e+04
      jobten |     2.839     2.695   1.6e+04
      indten |     3.260     2.904   1.6e+04
      occten |     3.141     2.828   1.6e+04
          ic |     0.303     0.460   1.6e+04
          oc |     0.316     0.465   1.6e+04
          jc |     0.376     0.484   1.6e+04
  tenureyr1_ |     2.776     2.642   1.6e+04
      female |     0.000     0.000   1.6e+04
        year |  2008.014     2.821   1.6e+04
--------------------------------------------

. tabstat lnrhw black hisp age _E* jobten indten occten ic oc jc tenureyr1_ female year if year < 2008, statistics(mean sd n) format(%8.3f) columns(statistics)

    variable |      mean        sd         N
-------------+------------------------------
       lnrhw |     2.510     0.426  7095.000
       black |     0.209     0.407  7095.000
        hisp |     0.220     0.414  7095.000
         age |    23.635     1.424  7095.000
 _Eedgrp4__2 |     0.329     0.470  7095.000
 _Eedgrp4__3 |     0.285     0.452  7095.000
 _Eedgrp4__4 |     0.218     0.413  7095.000
      jobten |     2.089     2.031  7095.000
      indten |     2.417     2.190  7095.000
      occten |     2.290     2.094  7095.000
          ic |     0.367     0.482  7060.000
          oc |     0.384     0.486  7060.000
          jc |     0.450     0.498  7095.000
  tenureyr1_ |     2.024     1.973  7095.000
      female |     0.000     0.000  7095.000
        year |  2005.419     1.397  7095.000
--------------------------------------------

. 
. * unadjusted wages for those on job less than one year, etc.
. 
. summ rpce_hrp1_ if tenureyr1_ < 1 & tenureyr1_ ~=.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  rpce_hrp1_ |      4,756    13.13602    6.446339   2.095364   49.18694

. summ rpce_hrp1_ if tenureyr1_ < 0.5 & tenureyr1_ ~=.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  rpce_hrp1_ |      2,464    12.94205    6.317019   2.105201   49.18694

. 
. * use constants from regression on age dummies - gives cohort level average start wage, controlling for year effects
. xi, prefix(_A) i.age
i.age             _Aage_22-33         (naturally coded; _Aage_22 omitted)

. xi, prefix(_Y) i.year
i.year            _Yyear_2002-2013    (naturally coded; _Yyear_2002 omitted)

. reg rpce_hrp1_ black hisp _E* _A* _Y* [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=.
(analytic weights assumed)
(sum of wgt is 1,052,102,277)

      Source |       SS           df       MS      Number of obs   =     4,756
-------------+----------------------------------   F(26, 4729)     =     27.67
       Model |  27794.0956        26  1069.00368   Prob > F        =    0.0000
    Residual |  182732.629     4,729  38.6408603   R-squared       =    0.1320
-------------+----------------------------------   Adj R-squared   =    0.1272
       Total |  210526.724     4,755  44.2748105   Root MSE        =    6.2162

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |   -1.22808   .2676693    -4.59   0.000    -1.752836   -.7033234
        hisp |  -.2050775   .2765251    -0.74   0.458    -.7471955    .3370405
 _Eedgrp4__2 |   .9663744   .2756327     3.51   0.000      .426006    1.506743
 _Eedgrp4__3 |   1.746046   .2862641     6.10   0.000     1.184835    2.307257
 _Eedgrp4__4 |   4.932043   .2822021    17.48   0.000     4.378796    5.485291
    _Aage_23 |   .4562553   .3302614     1.38   0.167    -.1912109    1.103721
    _Aage_24 |   .6999136   .3588022     1.95   0.051    -.0035059    1.403333
    _Aage_25 |   1.491659   .4019932     3.71   0.000     .7035647    2.279753
    _Aage_26 |   1.405612   .4542099     3.09   0.002     .5151487    2.296074
    _Aage_27 |   2.045781   .4948464     4.13   0.000     1.075652    3.015911
    _Aage_28 |   2.085162   .5861438     3.56   0.000     .9360467    3.234276
    _Aage_29 |   3.196401   .6421147     4.98   0.000     1.937557    4.455244
    _Aage_30 |   5.091744   .7322824     6.95   0.000     3.656129    6.527358
    _Aage_31 |   3.905267   .8631056     4.52   0.000     2.213178    5.597356
    _Aage_32 |   4.937739   1.129053     4.37   0.000      2.72427    7.151208
    _Aage_33 |   3.872571   1.222437     3.17   0.002     1.476026    6.269117
 _Yyear_2003 |   .9022345   .7459009     1.21   0.226    -.5600786    2.364548
 _Yyear_2004 |   1.213196    .712586     1.70   0.089    -.1838043    2.610197
 _Yyear_2005 |   1.572717    .701941     2.24   0.025     .1965861    2.948849
 _Yyear_2006 |   .9845424    .695816     1.41   0.157    -.3795811    2.348666
 _Yyear_2007 |   1.796159   .7237202     2.48   0.013     .3773304    3.214988
 _Yyear_2008 |    1.36203   .7548639     1.80   0.071    -.1178549    2.841915
 _Yyear_2009 |   .5718283   .7908997     0.72   0.470    -.9787034     2.12236
 _Yyear_2010 |   1.876804   .8276466     2.27   0.023     .2542317    3.499377
 _Yyear_2011 |   .4835451    .852363     0.57   0.571    -1.187483    2.154574
 _Yyear_2013 |   .6642828   .9846746     0.67   0.500    -1.266138    2.594704
       _cons |   8.978387   .6495103    13.82   0.000     7.705045    10.25173
------------------------------------------------------------------------------

. reg rpce_hrp1_ black hisp _E* _A* _Y* [w=custwt] if tenureyr1_ < 0.5 & tenureyr1_~=.
(analytic weights assumed)
(sum of wgt is 553,143,591)

      Source |       SS           df       MS      Number of obs   =     2,464
-------------+----------------------------------   F(26, 2437)     =     14.36
       Model |  13979.3042        26  537.665545   Prob > F        =    0.0000
    Residual |  91240.8053     2,437  37.4398052   R-squared       =    0.1329
-------------+----------------------------------   Adj R-squared   =    0.1236
       Total |   105220.11     2,463  42.7203043   Root MSE        =    6.1188

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |   -1.25482   .3660885    -3.43   0.001    -1.972697   -.5369436
        hisp |  -.1091048   .3912488    -0.28   0.780    -.8763194    .6581098
 _Eedgrp4__2 |   .7852209   .3746039     2.10   0.036      .050646    1.519796
 _Eedgrp4__3 |    1.86194   .3916099     4.75   0.000     1.094017    2.629862
 _Eedgrp4__4 |   4.824073    .381348    12.65   0.000     4.076273    5.571873
    _Aage_23 |    .031294   .4435727     0.07   0.944    -.8385244    .9011125
    _Aage_24 |    .183556   .4922605     0.37   0.709    -.7817363    1.148848
    _Aage_25 |   1.101849    .548547     2.01   0.045     .0261828    2.177516
    _Aage_26 |   1.115579    .618487     1.80   0.071     -.097236    2.328393
    _Aage_27 |   2.057044   .6786514     3.03   0.002     .7262509    3.387837
    _Aage_28 |   2.420202    .785683     3.08   0.002     .8795268    3.960878
    _Aage_29 |   3.517825   .8879241     3.96   0.000     1.776661    5.258989
    _Aage_30 |   3.961293   1.056832     3.75   0.000     1.888912    6.033675
    _Aage_31 |   4.694761   1.202126     3.91   0.000     2.337467    7.052055
    _Aage_32 |   3.399058   1.658633     2.05   0.041      .146582    6.651534
    _Aage_33 |   4.007489   1.606314     2.49   0.013     .8576063    7.157371
 _Yyear_2003 |   .5957804   1.002096     0.59   0.552    -1.369267    2.560828
 _Yyear_2004 |   1.460186   .9540457     1.53   0.126    -.4106381    3.331011
 _Yyear_2005 |   1.759051   .9525281     1.85   0.065     -.108797      3.6269
 _Yyear_2006 |   1.162179   .9369701     1.24   0.215    -.6751608    2.999519
 _Yyear_2007 |   1.511945   .9734762     1.55   0.121    -.3969815    3.420871
 _Yyear_2008 |   1.100727   1.018578     1.08   0.280    -.8966421    3.098096
 _Yyear_2009 |   .3185142   1.075759     0.30   0.767    -1.790983    2.428011
 _Yyear_2010 |   1.708652    1.11364     1.53   0.125    -.4751275    3.892431
 _Yyear_2011 |   -.053201   1.171882    -0.05   0.964    -2.351189    2.244787
 _Yyear_2013 |   .8395305   1.343585     0.62   0.532    -1.795156    3.474217
       _cons |   9.115469   .8696898    10.48   0.000     7.410061    10.82088
------------------------------------------------------------------------------

. 
. reg rpce_hrp1_ black hisp _A* _Y* [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=. & (edgrp4_==1 | edgrp4_==2)
(analytic weights assumed)
(sum of wgt is 492,868,824)

      Source |       SS           df       MS      Number of obs   =     2,360
-------------+----------------------------------   F(23, 2336)     =      4.68
       Model |  2948.31293        23  128.187519   Prob > F        =    0.0000
    Residual |  64026.9894     2,336   27.408814   R-squared       =    0.0440
-------------+----------------------------------   Adj R-squared   =    0.0346
       Total |  66975.3023     2,359  28.3913956   Root MSE        =    5.2353

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.257497    .294778    -4.27   0.000     -1.83555   -.6794428
        hisp |  -.6149862   .3103216    -1.98   0.048    -1.223521   -.0064517
    _Aage_23 |   .6326585   .3895209     1.62   0.104    -.1311842    1.396501
    _Aage_24 |    .814733   .4229269     1.93   0.054    -.0146183    1.644084
    _Aage_25 |   1.349024   .4711633     2.86   0.004     .4250819    2.272966
    _Aage_26 |   .9840212   .5489039     1.79   0.073    -.0923684    2.060411
    _Aage_27 |   1.071906   .5952762     1.80   0.072     -.095419     2.23923
    _Aage_28 |   .2909552   .7018878     0.41   0.679    -1.085433    1.667343
    _Aage_29 |   .6535164   .7773575     0.84   0.401    -.8708661    2.177899
    _Aage_30 |    2.56814   .9242096     2.78   0.006     .7557834    4.380497
    _Aage_31 |  -.1310697   1.031806    -0.13   0.899     -2.15442     1.89228
    _Aage_32 |   1.453189   1.436768     1.01   0.312    -1.364284    4.270662
    _Aage_33 |   5.802387    1.66089     3.49   0.000     2.545416    9.059358
 _Yyear_2003 |   .5799443   .8131677     0.71   0.476    -1.014661     2.17455
 _Yyear_2004 |   .7832195   .7797403     1.00   0.315    -.7458358    2.312275
 _Yyear_2005 |   1.382785   .7652192     1.81   0.071    -.1177949    2.883364
 _Yyear_2006 |   .8700564   .7608256     1.14   0.253    -.6219074     2.36202
 _Yyear_2007 |   1.249435   .8007462     1.56   0.119    -.3208122    2.819682
 _Yyear_2008 |   1.375388   .8351895     1.65   0.100    -.2624023    3.013178
 _Yyear_2009 |   .9000481   .8822758     1.02   0.308    -.8300771    2.630173
 _Yyear_2010 |   2.731896   .9400633     2.91   0.004     .8884503    4.575341
 _Yyear_2011 |   2.521292   .9744767     2.59   0.010      .610363    4.432222
 _Yyear_2013 |   .3403873   1.187523     0.29   0.774    -1.988322    2.669097
       _cons |   10.12218   .6602604    15.33   0.000     8.827418    11.41693
------------------------------------------------------------------------------

. reg rpce_hrp1_ black hisp _A* _Y* [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=. & (edgrp4_==3 | edgrp4_==4)
(analytic weights assumed)
(sum of wgt is 559,233,453)

      Source |       SS           df       MS      Number of obs   =     2,396
-------------+----------------------------------   F(23, 2372)     =      8.98
       Model |   10353.624        23  450.157564   Prob > F        =    0.0000
    Residual |  118963.308     2,372  50.1531651   R-squared       =    0.0801
-------------+----------------------------------   Adj R-squared   =    0.0711
       Total |  129316.931     2,395  53.9945434   Root MSE        =    7.0819

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.948443   .4656104    -4.18   0.000    -2.861489   -1.035398
        hisp |  -.6575443   .4674821    -1.41   0.160     -1.57426    .2591714
    _Aage_23 |    .765157   .5363991     1.43   0.154    -.2867026    1.817017
    _Aage_24 |   1.183656   .5815187     2.04   0.042      .043318    2.323993
    _Aage_25 |   2.382312   .6546727     3.64   0.000     1.098521    3.666102
    _Aage_26 |   2.386185    .721966     3.31   0.001     .9704354    3.801935
    _Aage_27 |   3.653824    .788685     4.63   0.000     2.107241    5.200407
    _Aage_28 |   4.334459    .938883     4.62   0.000     2.493342    6.175575
    _Aage_29 |   6.290046   1.018432     6.18   0.000     4.292937    8.287154
    _Aage_30 |   8.257492   1.126931     7.33   0.000      6.04762    10.46736
    _Aage_31 |    8.41548     1.3936     6.04   0.000     5.682679    11.14828
    _Aage_32 |   9.385214   1.732318     5.42   0.000       5.9882    12.78223
    _Aage_33 |   4.765707   1.804428     2.64   0.008     1.227287    8.304128
 _Yyear_2003 |   1.524307   1.330312     1.15   0.252    -1.084388    4.133002
 _Yyear_2004 |   1.989682   1.267461     1.57   0.117     -.495764    4.475129
 _Yyear_2005 |   2.044768   1.252976     1.63   0.103    -.4122741     4.50181
 _Yyear_2006 |    1.41273   1.239783     1.14   0.255     -1.01844    3.843901
 _Yyear_2007 |   2.649825   1.276625     2.08   0.038     .1464082    5.153242
 _Yyear_2008 |   1.422227   1.327991     1.07   0.284    -1.181916    4.026369
 _Yyear_2009 |   .4070303   1.380457     0.29   0.768    -2.299997    3.114058
 _Yyear_2010 |   1.395795   1.424323     0.98   0.327    -1.397253    4.188842
 _Yyear_2011 |  -1.096188   1.458509    -0.75   0.452    -3.956272    1.763897
 _Yyear_2013 |   .3631919   1.626037     0.22   0.823    -2.825409    3.551792
       _cons |   11.31977   1.130553    10.01   0.000     9.102796    13.53674
------------------------------------------------------------------------------

. 
. * Redo controlling for UR and dropping year effects
. sort year

. merge m:1 year using `tempuryear', keepusing(year usurate16up)
(note: variable year was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                            17
        from master                         0  (_merge==1)
        from using                         17  (_merge==2)

    matched                            15,842  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(17 observations deleted)

. drop _merge

. reg rpce_hrp1_ black hisp _E* _A* usurate16up [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=.
(analytic weights assumed)
(sum of wgt is 1,052,102,277)

      Source |       SS           df       MS      Number of obs   =     4,756
-------------+----------------------------------   F(17, 4738)     =     40.83
       Model |  26900.7309        17  1582.39594   Prob > F        =    0.0000
    Residual |  183625.993     4,738  38.7560138   R-squared       =    0.1278
-------------+----------------------------------   Adj R-squared   =    0.1246
       Total |  210526.724     4,755  44.2748105   Root MSE        =    6.2254

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.229324   .2678629    -4.59   0.000     -1.75446   -.7041883
        hisp |  -.1912077   .2768351    -0.69   0.490    -.7339331    .3515178
 _Eedgrp4__2 |   .9535513   .2759416     3.46   0.001     .4125776    1.494525
 _Eedgrp4__3 |   1.748124   .2864838     6.10   0.000     1.186482    2.309765
 _Eedgrp4__4 |   4.954616   .2823623    17.55   0.000     4.401055    5.508178
    _Aage_23 |   .7257097   .3116954     2.33   0.020     .1146418    1.336778
    _Aage_24 |   1.020147   .3182556     3.21   0.001     .3962183    1.644076
    _Aage_25 |   1.794682   .3396798     5.28   0.000     1.128752    2.460612
    _Aage_26 |    1.79403   .3792167     4.73   0.000     1.050589    2.537471
    _Aage_27 |   2.417439    .399611     6.05   0.000     1.634016    3.200863
    _Aage_28 |   2.471805    .501834     4.93   0.000     1.487977    3.455632
    _Aage_29 |   3.384315   .5115944     6.62   0.000     2.381352    4.387277
    _Aage_30 |   5.215914   .5604144     9.31   0.000     4.117241    6.314586
    _Aage_31 |   3.720252   .6757329     5.51   0.000     2.395502    5.045003
    _Aage_32 |   4.762234   .8723813     5.46   0.000     3.051961    6.472507
    _Aage_33 |   3.695251   .9911789     3.73   0.000      1.75208    5.638422
 usurate16up |  -.1016261    .070489    -1.44   0.149    -.2398173    .0365652
       _cons |   10.56175   .4814851    21.94   0.000     9.617817    11.50569
------------------------------------------------------------------------------

. reg rpce_hrp1_ black hisp _E* _A* usurate16up [w=custwt] if tenureyr1_ < 0.5 & tenureyr1_~=.
(analytic weights assumed)
(sum of wgt is 553,143,591)

      Source |       SS           df       MS      Number of obs   =     2,464
-------------+----------------------------------   F(17, 2446)     =     21.05
       Model |   13428.009        17  789.882881   Prob > F        =    0.0000
    Residual |  91792.1005     2,446  37.5274328   R-squared       =    0.1276
-------------+----------------------------------   Adj R-squared   =    0.1216
       Total |   105220.11     2,463  42.7203043   Root MSE        =     6.126

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.272751   .3660592    -3.48   0.001    -1.990569   -.5549325
        hisp |  -.1150223    .391466    -0.29   0.769    -.8826615    .6526168
 _Eedgrp4__2 |   .7890892   .3744097     2.11   0.035     .0548963    1.523282
 _Eedgrp4__3 |   1.883136   .3914478     4.81   0.000     1.115533     2.65074
 _Eedgrp4__4 |   4.844035   .3809832    12.71   0.000     4.096952    5.591118
    _Aage_23 |   .2521488   .4186869     0.60   0.547    -.5688688    1.073166
    _Aage_24 |   .4081567   .4397184     0.93   0.353    -.4541021    1.270415
    _Aage_25 |   1.262816   .4626043     2.73   0.006     .3556796    2.169953
    _Aage_26 |    1.40208   .5123547     2.74   0.006     .3973861    2.406774
    _Aage_27 |   2.145371   .5483408     3.91   0.000     1.070111    3.220631
    _Aage_28 |   2.641578    .671215     3.94   0.000     1.325369    3.957786
    _Aage_29 |   3.609604   .6895642     5.23   0.000     2.257414    4.961794
    _Aage_30 |   4.037323   .8098189     4.99   0.000     2.449322    5.625325
    _Aage_31 |   4.450701   .9031073     4.93   0.000     2.679766    6.221635
    _Aage_32 |   3.420946   1.332252     2.57   0.010     .8084878    6.033404
    _Aage_33 |   4.024986   1.269234     3.17   0.002     1.536101    6.513871
 usurate16up |  -.1353388   .0959478    -1.41   0.159    -.3234861    .0528084
       _cons |   10.92522   .6526303    16.74   0.000     9.645458    12.20499
------------------------------------------------------------------------------

. reg rpce_hrp1_ black hisp _A* usurate16up [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=. & (edgrp4_==1 | edgrp4_==2)
(analytic weights assumed)
(sum of wgt is 492,868,824)

      Source |       SS           df       MS      Number of obs   =     2,360
-------------+----------------------------------   F(14, 2345)     =      5.91
       Model |  2282.57104        14  163.040788   Prob > F        =    0.0000
    Residual |  64692.7313     2,345  27.5875187   R-squared       =    0.0341
-------------+----------------------------------   Adj R-squared   =    0.0283
       Total |  66975.3023     2,359  28.3913956   Root MSE        =    5.2524

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.275096   .2948709    -4.32   0.000    -1.853331   -.6968613
        hisp |  -.6250735   .3110002    -2.01   0.045    -1.234937   -.0152095
    _Aage_23 |   .8959387   .3663838     2.45   0.015     .1774688    1.614408
    _Aage_24 |   1.183988   .3734112     3.17   0.002     .4517375    1.916239
    _Aage_25 |   1.694939   .3946677     4.29   0.000     .9210053    2.468873
    _Aage_26 |   1.442718    .458727     3.15   0.002     .5431654    2.342271
    _Aage_27 |   1.772783   .4803039     3.69   0.000      .830919    2.714648
    _Aage_28 |   1.063173   .6000931     1.77   0.077    -.1135952    2.239941
    _Aage_29 |   1.302935   .6252801     2.08   0.037     .0767752    2.529094
    _Aage_30 |   3.195525   .7177304     4.45   0.000     1.788073    4.602978
    _Aage_31 |    .320655    .793841     0.40   0.686    -1.236048    1.877358
    _Aage_32 |   .7618341   1.091999     0.70   0.485    -1.379551    2.903219
    _Aage_33 |   5.109932    1.37467     3.72   0.000     2.414237    7.805627
 usurate16up |    .118903   .0860385     1.38   0.167    -.0498166    .2876225
       _cons |   10.27828   .5304013    19.38   0.000     9.238173    11.31838
------------------------------------------------------------------------------

. reg rpce_hrp1_ black hisp _A* usurate16up [w=custwt] if tenureyr1_ < 1 & tenureyr1_~=. & (edgrp4_==3 | edgrp4_==4)
(analytic weights assumed)
(sum of wgt is 559,233,453)

      Source |       SS           df       MS      Number of obs   =     2,396
-------------+----------------------------------   F(14, 2381)     =     13.13
       Model |  9269.79842        14  662.128458   Prob > F        =    0.0000
    Residual |  120047.133     2,381  50.4187875   R-squared       =    0.0717
-------------+----------------------------------   Adj R-squared   =    0.0662
       Total |  129316.931     2,395  53.9945434   Root MSE        =    7.1006

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.980028   .4665991    -4.24   0.000     -2.89501   -1.065045
        hisp |  -.6254355   .4683938    -1.34   0.182    -1.543937    .2930664
    _Aage_23 |   1.067208   .5079063     2.10   0.036     .0712234    2.063192
    _Aage_24 |   1.448184   .5190411     2.79   0.005     .4303651    2.466004
    _Aage_25 |   2.614222   .5584528     4.68   0.000     1.519118    3.709326
    _Aage_26 |   2.688632   .6032805     4.46   0.000     1.505622    3.871641
    _Aage_27 |    3.64437   .6385558     5.71   0.000     2.392187    4.896553
    _Aage_28 |   4.271089   .8065036     5.30   0.000     2.689567    5.852611
    _Aage_29 |   6.030739   .8045868     7.50   0.000     4.452976    7.608503
    _Aage_30 |   7.681671   .8541406     8.99   0.000     6.006735    9.356608
    _Aage_31 |    7.43519   1.105727     6.72   0.000     5.266903    9.603477
    _Aage_32 |   8.828831   1.349743     6.54   0.000     6.182038    11.47562
    _Aage_33 |   4.210535    1.44153     2.92   0.004     1.383751    7.037319
 usurate16up |  -.3199734   .1114742    -2.87   0.004      -.53857   -.1013768
       _cons |   14.60556   .6930265    21.08   0.000     13.24657    15.96456
------------------------------------------------------------------------------

. 
. * use average residual by survey year, after controlling for national UR
. 
. reg rpce_hrp1_ black _E* _A* usurate16up [w=custwt] if jobten < 1 & jobten~=.
(analytic weights assumed)
(sum of wgt is 1,052,102,277)

      Source |       SS           df       MS      Number of obs   =     4,756
-------------+----------------------------------   F(16, 4739)     =     43.36
       Model |  26882.2422        16  1680.14014   Prob > F        =    0.0000
    Residual |  183644.482     4,739  38.7517371   R-squared       =    0.1277
-------------+----------------------------------   Adj R-squared   =    0.1247
       Total |  210526.724     4,755  44.2748105   Root MSE        =    6.2251

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.198451   .2640926    -4.54   0.000    -1.716196   -.6807072
 _Eedgrp4__2 |   .9557763   .2759075     3.46   0.001     .4148694    1.496683
 _Eedgrp4__3 |   1.747824   .2864676     6.10   0.000     1.186214    2.309434
 _Eedgrp4__4 |   4.974604     .28086    17.71   0.000     4.423987     5.52522
    _Aage_23 |   .7249953   .3116765     2.33   0.020     .1139645    1.336026
    _Aage_24 |   1.017978   .3182226     3.20   0.001     .3941135    1.641842
    _Aage_25 |    1.79054   .3396081     5.27   0.000     1.124751     2.45633
    _Aage_26 |   1.790327   .3791579     4.72   0.000     1.047002    2.533653
    _Aage_27 |   2.412041   .3995125     6.04   0.000     1.628811    3.195271
    _Aage_28 |   2.464331   .5016897     4.91   0.000     1.480786    3.447876
    _Aage_29 |    3.38437   .5115662     6.62   0.000     2.381463    4.387278
    _Aage_30 |   5.206547   .5602194     9.29   0.000     4.108257    6.304838
    _Aage_31 |   3.721384   .6756936     5.51   0.000      2.39671    5.046057
    _Aage_32 |   4.756134   .8722884     5.45   0.000     3.046043    6.466224
    _Aage_33 |   3.694377   .9911234     3.73   0.000     1.751315     5.63744
 usurate16up |   -.101329   .0704838    -1.44   0.151      -.23951    .0368521
       _cons |   10.52772   .4789303    21.98   0.000     9.588789    11.46664
------------------------------------------------------------------------------

. predict resid12, residuals

. reg rpce_hrp1_ black _E* _A* usurate16up [w=custwt] if jobten < 0.5 & jobten~=.
(analytic weights assumed)
(sum of wgt is 553,143,591)

      Source |       SS           df       MS      Number of obs   =     2,464
-------------+----------------------------------   F(16, 2447)     =     22.37
       Model |  13424.7691        16   839.04807   Prob > F        =    0.0000
    Residual |  91795.3404     2,447  37.5134207   R-squared       =    0.1276
-------------+----------------------------------   Adj R-squared   =    0.1219
       Total |   105220.11     2,463  42.7203043   Root MSE        =    6.1248

------------------------------------------------------------------------------
  rpce_hrp1_ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       black |  -1.255327    .361157    -3.48   0.001    -1.963532   -.5471223
 _Eedgrp4__2 |   .7903553    .374315     2.11   0.035     .0563483    1.524362
 _Eedgrp4__3 |   1.881939   .3913535     4.81   0.000      1.11452    2.649357
 _Eedgrp4__4 |   4.855673   .3788479    12.82   0.000     4.112778    5.598569
    _Aage_23 |   .2519834   .4186084     0.60   0.547      -.56888    1.072847
    _Aage_24 |   .4073545   .4396278     0.93   0.354    -.4547265    1.269436
    _Aage_25 |   1.264427   .4624854     2.73   0.006      .357524    2.171331
    _Aage_26 |     1.4024   .5122578     2.74   0.006     .3978967    2.406904
    _Aage_27 |   2.144683   .5482334     3.91   0.000     1.069633    3.219732
    _Aage_28 |   2.640731   .6710835     3.94   0.000      1.32478    3.956681
    _Aage_29 |   3.615852   .6891076     5.25   0.000     2.264558    4.967147
    _Aage_30 |   4.028395   .8090975     4.98   0.000     2.441808    5.614982
    _Aage_31 |   4.454734   .9028344     4.93   0.000     2.684335    6.225132
    _Aage_32 |   3.418583   1.331979     2.57   0.010     .8066612    6.030506
    _Aage_33 |    4.02348   1.268987     3.17   0.002     1.535081    6.511879
 usurate16up |  -.1361497   .0958901    -1.42   0.156     -.324184    .0518845
       _cons |   10.91075   .6506469    16.77   0.000     9.634873    12.18662
------------------------------------------------------------------------------

. predict resid6, residuals

. 
. preserve

. collapse resid12 resid6, by(year)

. list

     +----------------------------+
     | year    resid12     resid6 |
     |----------------------------|
  1. | 2002   .2989222   .1557481 |
  2. | 2003   .4128482   .4705555 |
  3. | 2004   .8170838   .9815909 |
  4. | 2005   .8562655   1.088867 |
  5. | 2006   .7081643   .9328063 |
     |----------------------------|
  6. | 2007   1.290616     1.5817 |
  7. | 2008   1.634841    1.88629 |
  8. | 2009   1.874263   2.089479 |
  9. | 2010   1.961247   2.206549 |
 10. | 2011   2.058159   2.156312 |
     |----------------------------|
 11. | 2013   2.068964   2.283426 |
     +----------------------------+

. 
. restore

. 
. 
. ** Do medians for tenure variables
. 
. centile tenureyr1_ jobten indten occten 

                                                       -- Binom. Interp. --
    Variable |       Obs  Percentile    Centile        [95% Conf. Interval]
-------------+-------------------------------------------------------------
  tenureyr1_ |    15,842         50    1.942457         1.88476    1.980922
      jobten |    15,842         50    2.000077        1.961612    2.038618
      indten |    15,842         50     2.42311        2.365413    2.461574
      occten |    15,842         50    2.307716        2.269251    2.365413

. 
. ** Get number of respondents in analysis from cluster numbers in regs - N from tenure_returns is 2917
. 
. ** Mean and median number of job changes per person observed in data, mean and median years in data
. 
. drop if jc==.
(0 observations deleted)

. collapse (count) nyears=jc (sum) num_jc=jc, by(pubid)

. summ nyears num_jc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      nyears |      2,805    5.647772    2.854158          1         11
      num_jc |      2,805    2.122995    1.674318          0          8

. centile nyears num_jc

                                                       -- Binom. Interp. --
    Variable |       Obs  Percentile    Centile        [95% Conf. Interval]
-------------+-------------------------------------------------------------
      nyears |     2,805         50           6               6           6
      num_jc |     2,805         50           2               2           2

. tab1 nyears num_jc

-> tabulation of nyears  

 (count) jc |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        314       11.19       11.19
          2 |        251        8.95       20.14
          3 |        200        7.13       27.27
          4 |        229        8.16       35.44
          5 |        233        8.31       43.74
          6 |        323       11.52       55.26
          7 |        419       14.94       70.20
          8 |        339       12.09       82.28
          9 |        260        9.27       91.55
         10 |        185        6.60       98.15
         11 |         52        1.85      100.00
------------+-----------------------------------
      Total |      2,805      100.00

-> tabulation of num_jc  

   (sum) jc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        434       15.47       15.47
          1 |        782       27.88       43.35
          2 |        603       21.50       64.85
          3 |        428       15.26       80.11
          4 |        279        9.95       90.05
          5 |        160        5.70       95.76
          6 |         76        2.71       98.47
          7 |         33        1.18       99.64
          8 |         10        0.36      100.00
------------+-----------------------------------
      Total |      2,805      100.00

. 
. log close
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\BPEA\NLS_Materials\Table_5\table5_97.log
  log type:  text
 closed on:   3 Mar 2020, 16:20:29
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
