----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\BPEA\PSID_CPS_Materials\Table_4_A6_Fig_6_10_12\stateregs.log
  log type:  text
 opened on:   3 Mar 2020, 18:10:32

. 
. use "Input\WHARTON LAND REGULATION DATA_1_24_2008.dta", clear

. drop state

. gen state = 2 if statename=="AK"
(2,722 missing values generated)

. replace state = 1 if statename=="AL"
(37 real changes made)

. replace state = 05 if statename=="AR"
(23 real changes made)

. replace state = 60 if statename=="AS"
(0 real changes made)

. replace state = 04 if statename=="AZ"
(40 real changes made)

. replace state = 06 if statename=="CA"
(185 real changes made)

. replace state = 08 if statename=="CO"
(48 real changes made)

. replace state = 09 if statename=="CT"
(66 real changes made)

. replace state = 11 if statename=="DC"
(1 real change made)

. replace state = 10 if statename=="DE"
(5 real changes made)

. replace state = 12 if statename=="FL"
(101 real changes made)

. replace state = 13 if statename=="GA"
(58 real changes made)

. replace state = 66 if statename=="GU"
(0 real changes made)

. replace state = 15 if statename=="HI"
(1 real change made)

. replace state = 19 if statename=="IA"
(61 real changes made)

. replace state = 16 if statename=="ID"
(20 real changes made)

. replace state = 17 if statename=="IL"
(146 real changes made)

. replace state = 18 if statename=="IN"
(48 real changes made)

. replace state = 20 if statename=="KS"
(46 real changes made)

. replace state = 21 if statename=="KY"
(30 real changes made)

. replace state = 22 if statename=="LA"
(21 real changes made)

. replace state = 25 if statename=="MA"
(81 real changes made)

. replace state = 24 if statename=="MD"
(20 real changes made)

. replace state = 23 if statename=="ME"
(46 real changes made)

. replace state = 26 if statename=="MI"
(112 real changes made)

. replace state = 27 if statename=="MN"
(126 real changes made)

. replace state = 29 if statename=="MO"
(71 real changes made)

. replace state = 28 if statename=="MS"
(21 real changes made)

. replace state = 30 if statename=="MT"
(6 real changes made)

. replace state = 37 if statename=="NC"
(65 real changes made)

. replace state = 38 if statename=="ND"
(8 real changes made)

. replace state = 31 if statename=="NE"
(22 real changes made)

. replace state = 33 if statename=="NH"
(33 real changes made)

. replace state = 34 if statename=="NJ"
(106 real changes made)

. replace state = 35 if statename=="NM"
(16 real changes made)

. replace state = 32 if statename=="NV"
(8 real changes made)

. replace state = 36 if statename=="NY"
(97 real changes made)

. replace state = 39 if statename=="OH"
(137 real changes made)

. replace state = 40 if statename=="OK"
(38 real changes made)

. replace state = 41 if statename=="OR"
(42 real changes made)

. replace state = 42 if statename=="PA"
(187 real changes made)

. replace state = 72 if statename=="PR"
(0 real changes made)

. replace state = 44 if statename=="RI"
(17 real changes made)

. replace state = 45 if statename=="SC"
(30 real changes made)

. replace state = 46 if statename=="SD"
(12 real changes made)

. replace state = 47 if statename=="TN"
(43 real changes made)

. replace state = 48 if statename=="TX"
(169 real changes made)

. replace state = 49 if statename=="UT"
(41 real changes made)

. replace state = 51 if statename=="VA"
(35 real changes made)

. replace state = 78 if statename=="VI"
(0 real changes made)

. replace state = 50 if statename=="VT"
(24 real changes made)

. replace state = 53 if statename=="WA"
(50 real changes made)

. replace state = 55 if statename=="WI"
(99 real changes made)

. replace state = 54 if statename=="WV"
(15 real changes made)

. replace state = 56 if statename=="WY"
(8 real changes made)

. tab statename if state==.
no observations

. collapse (mean) wharton=WRLURI [pw=weight], by(state)

. save Output\wharton, replace
file Output\wharton.dta saved

. * http://unionstats.gsu.edu/MonthlyLaborReviewArticle.htm
. insheet using Input\State_Union_Membership_Density_1964-2015.csv, clear
(54 vars, 60 obs)

. gen state = 2 if statename=="Alaska"
(59 missing values generated)

. replace state = 1 if statename=="Alabama"
(1 real change made)

. replace state = 05 if statename=="Arkansas"
(1 real change made)

. replace state = 04 if statename=="Arizona"
(1 real change made)

. replace state = 06 if statename=="California"
(1 real change made)

. replace state = 08 if statename=="Colorado"
(1 real change made)

. replace state = 09 if statename=="Connecticut"
(1 real change made)

. replace state = 11 if statename=="District of Columbia"
(1 real change made)

. replace state = 10 if statename=="Delaware"
(1 real change made)

. replace state = 12 if statename=="Florida"
(1 real change made)

. replace state = 13 if statename=="Georgia"
(1 real change made)

. replace state = 15 if statename=="Hawaii"
(1 real change made)

. replace state = 19 if statename=="Iowa"
(1 real change made)

. replace state = 16 if statename=="Idaho"
(1 real change made)

. replace state = 17 if statename=="Illinois"
(1 real change made)

. replace state = 18 if statename=="Indiana"
(1 real change made)

. replace state = 20 if statename=="Kansas"
(1 real change made)

. replace state = 21 if statename=="Kentucky"
(1 real change made)

. replace state = 22 if statename=="Louisiana"
(1 real change made)

. replace state = 25 if statename=="Massachusetts"
(1 real change made)

. replace state = 24 if statename=="Maryland"
(1 real change made)

. replace state = 23 if statename=="Maine"
(1 real change made)

. replace state = 26 if statename=="Michigan"
(1 real change made)

. replace state = 27 if statename=="Minnesota"
(1 real change made)

. replace state = 29 if statename=="Missouri"
(1 real change made)

. replace state = 28 if statename=="Mississippi"
(1 real change made)

. replace state = 30 if statename=="Montana"
(1 real change made)

. replace state = 37 if statename=="North Carolina"
(1 real change made)

. replace state = 38 if statename=="North Dakota"
(1 real change made)

. replace state = 31 if statename=="Nebraska"
(1 real change made)

. replace state = 33 if statename=="New Hampshire"
(1 real change made)

. replace state = 34 if statename=="New Jersey"
(1 real change made)

. replace state = 35 if statename=="New Mexico"
(1 real change made)

. replace state = 32 if statename=="Nevada"
(1 real change made)

. replace state = 36 if statename=="New York"
(1 real change made)

. replace state = 39 if statename=="Ohio"
(1 real change made)

. replace state = 40 if statename=="Oklahoma"
(1 real change made)

. replace state = 41 if statename=="Oregon"
(1 real change made)

. replace state = 42 if statename=="Pennsylvania"
(1 real change made)

. replace state = 44 if statename=="Rhode Island"
(1 real change made)

. replace state = 45 if statename=="South Carolina"
(1 real change made)

. replace state = 46 if statename=="South Dakota"
(1 real change made)

. replace state = 47 if statename=="Tennessee"
(1 real change made)

. replace state = 48 if statename=="Texas"
(1 real change made)

. replace state = 49 if statename=="Utah"
(1 real change made)

. replace state = 51 if statename=="Virginia"
(1 real change made)

. replace state = 50 if statename=="Vermont"
(1 real change made)

. replace state = 53 if statename=="Washington"
(1 real change made)

. replace state = 55 if statename=="Wisconsin"
(1 real change made)

. replace state = 54 if statename=="West Virginia"
(1 real change made)

. replace state = 56 if statename=="Wyoming"
(1 real change made)

. drop if state==.
(9 observations deleted)

. quietly for num 0/9: rename mem0X memX

. reshape long mem, i(state) j(year)
(note: j = 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       51   ->    2652
Number of variables                  55   ->       5
j variable (52 values)                    ->   year
xij variables:
                    mem0 mem1 ... mem99   ->   mem
-----------------------------------------------------------------------------

. replace year = year+1900
variable year was byte now int
(2,652 real changes made)

. replace year = year+100 if year<=1920
(816 real changes made)

. gen union = mem/100

. keep state year union

. save Output\union, replace
file Output\union.dta saved

. 
. insheet using Input\statepop6010.csv, clear
(18 vars, 51 obs)

. drop if stateab==""
(0 observations deleted)

. gen state = 2 if stateab=="AK"
(50 missing values generated)

. replace state = 1 if stateab=="AL"
(1 real change made)

. replace state = 05 if stateab=="AR"
(1 real change made)

. replace state = 60 if stateab=="AS"
(0 real changes made)

. replace state = 04 if stateab=="AZ"
(1 real change made)

. replace state = 06 if stateab=="CA"
(1 real change made)

. replace state = 08 if stateab=="CO"
(1 real change made)

. replace state = 09 if stateab=="CT"
(1 real change made)

. replace state = 11 if stateab=="DC"
(1 real change made)

. replace state = 10 if stateab=="DE"
(1 real change made)

. replace state = 12 if stateab=="FL"
(1 real change made)

. replace state = 13 if stateab=="GA"
(1 real change made)

. replace state = 66 if stateab=="GU"
(0 real changes made)

. replace state = 15 if stateab=="HI"
(1 real change made)

. replace state = 19 if stateab=="IA"
(1 real change made)

. replace state = 16 if stateab=="ID"
(1 real change made)

. replace state = 17 if stateab=="IL"
(1 real change made)

. replace state = 18 if stateab=="IN"
(1 real change made)

. replace state = 20 if stateab=="KS"
(1 real change made)

. replace state = 21 if stateab=="KY"
(1 real change made)

. replace state = 22 if stateab=="LA"
(1 real change made)

. replace state = 25 if stateab=="MA"
(1 real change made)

. replace state = 24 if stateab=="MD"
(1 real change made)

. replace state = 23 if stateab=="ME"
(1 real change made)

. replace state = 26 if stateab=="MI"
(1 real change made)

. replace state = 27 if stateab=="MN"
(1 real change made)

. replace state = 29 if stateab=="MO"
(1 real change made)

. replace state = 28 if stateab=="MS"
(1 real change made)

. replace state = 30 if stateab=="MT"
(1 real change made)

. replace state = 37 if stateab=="NC"
(1 real change made)

. replace state = 38 if stateab=="ND"
(1 real change made)

. replace state = 31 if stateab=="NE"
(1 real change made)

. replace state = 33 if stateab=="NH"
(1 real change made)

. replace state = 34 if stateab=="NJ"
(1 real change made)

. replace state = 35 if stateab=="NM"
(1 real change made)

. replace state = 32 if stateab=="NV"
(1 real change made)

. replace state = 36 if stateab=="NY"
(1 real change made)

. replace state = 39 if stateab=="OH"
(1 real change made)

. replace state = 40 if stateab=="OK"
(1 real change made)

. replace state = 41 if stateab=="OR"
(1 real change made)

. replace state = 42 if stateab=="PA"
(1 real change made)

. replace state = 72 if stateab=="PR"
(0 real changes made)

. replace state = 44 if stateab=="RI"
(1 real change made)

. replace state = 45 if stateab=="SC"
(1 real change made)

. replace state = 46 if stateab=="SD"
(1 real change made)

. replace state = 47 if stateab=="TN"
(1 real change made)

. replace state = 48 if stateab=="TX"
(1 real change made)

. replace state = 49 if stateab=="UT"
(1 real change made)

. replace state = 51 if stateab=="VA"
(1 real change made)

. replace state = 78 if stateab=="VI"
(0 real changes made)

. replace state = 50 if stateab=="VT"
(1 real change made)

. replace state = 53 if stateab=="WA"
(1 real change made)

. replace state = 55 if stateab=="WI"
(1 real change made)

. replace state = 54 if stateab=="WV"
(1 real change made)

. replace state = 56 if stateab=="WY"
(1 real change made)

. l stateab if state==.

. replace pop60 = pop60*1000
variable pop60 was int now long
(51 real changes made)

. replace pop70 = pop70*1000
variable pop70 was int now long
(51 real changes made)

. save Output\statepop6010, replace
file Output\statepop6010.dta saved

. 
. * labor market flows from Unicon
. use Input\state-level-data.dta if year>=1977, clear

. keep migstate empchange state year en eu ue ne 

. 
. cd ..\CPS_Data_Setup\.
H:\Other\Paper Codes for Uploading\BPEA\PSID_CPS_Materials\CPS_Data_Setup

. 
. *merge 1:1 state year using cpscovariates
. merge 1:1 state year using Output\cpscovariates

    Result                           # of obs.
    -----------------------------------------
    not matched                           544
        from master                         0  (_merge==1)
        from using                        544  (_merge==2)

    matched                             1,989  (_merge==3)
    -----------------------------------------

. drop _merge

. drop if state>56
(102 observations deleted)

. 
. cd ..\Table_4_A6_Fig_6_10_12\.
H:\Other\Paper Codes for Uploading\BPEA\PSID_CPS_Materials\Table_4_A6_Fig_6_10_12

. 
. merge m:1 state using output\wharton
(note: variable state was byte, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,431  (_merge==3)
    -----------------------------------------

. tab state if _merge==1
no observations

. drop _merge

. sort state year

. quietly for var empchangeipums smigrant: quietly by state: gen X1 = X[_n+1]

. replace migstate = . if year==1984 | year<=1979
(204 real changes made, 204 to missing)

. sort state year

. quietly by state: replace migstate = migstate[_n-1]*smigrant1/smigrant1[_n-1] if year>=2013

. quietly by state: replace empchange = empchange[_n-1]*empchangeipums1/empchangeipums1[_n-1] if year>=2013

. 
. merge m:1 state using Output\statepop6010

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,431  (_merge==3)
    -----------------------------------------

. drop _merge

. * percentiles of the wage distribution from the CPS
. merge 1:1 state year using Input\cps-pctiles-all, keepusing(p10 p90)

    Result                           # of obs.
    -----------------------------------------
    not matched                           697
        from master                       697  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,734  (_merge==3)
    -----------------------------------------

. drop _merge

. gen p9010 = log(p90/p10)
(697 missing values generated)

. 
. gen cendiv = 1 if state==9 | state==23 | state==25 | state==33 | state==44 | state==50
(2,151 missing values generated)

. replace cendiv = 2 if state==34 | state==36 | state==42
(162 real changes made)

. replace cendiv = 3 if state==17 | state==18 | state==26 | state==39 | state==55 
(252 real changes made)

. replace cendiv = 4 if state==19 | state==20 | state==27 | state==29 | state==31 | state==38 | state==46
(317 real changes made)

. replace cendiv = 5 if state==10 | state==11 | state==12 | state==13 | state==24 | state==37 | state==45 | state==51 | state==54
(442 real changes made)

. replace cendiv = 6 if state==1  | state==21 | state==28 | state==47
(190 real changes made)

. replace cendiv = 7 if state==5  | state==22 | state==40 | state==48
(194 real changes made)

. replace cendiv = 8 if state==4  | state==8  | state==16 | state==30  | state==32 | state==35  | state==49 | state==56
(357 real changes made)

. replace cendiv = 9 if state==2  | state==6  | state==15 | state==41 | state==53
(237 real changes made)

. lab def cendiv 1 "New England" 2 "Mid Atlantic" 3 "East North Central" 4 "West North Centeral" 5 "South Atlantic" 6 "East South Central" 7 "West Sounth Central" 8 "Mountain" 9 "Pacific"

. lab val cendiv cendiv

. quietly tab cendiv, gen(cendiv)

. 
. factor en eu ue ne empchange migstate jcr jdr
(obs=1,632)

Factor analysis/correlation                      Number of obs    =      1,632
    Method: principal factors                    Retained factors =          4
    Rotation: (unrotated)                        Number of params =         26

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      2.99980      1.77757            0.7229       0.7229
        Factor2  |      1.22223      0.77872            0.2945       1.0174
        Factor3  |      0.44351      0.38800            0.1069       1.1243
        Factor4  |      0.05551      0.07192            0.0134       1.1377
        Factor5  |     -0.01642      0.08809           -0.0040       1.1337
        Factor6  |     -0.10451      0.09622           -0.0252       1.1085
        Factor7  |     -0.20073      0.04897           -0.0484       1.0602
        Factor8  |     -0.24970            .           -0.0602       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(28) = 5689.93 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4 |   Uniqueness 
    -------------+----------------------------------------+--------------
              en |   0.4816    0.2711    0.4396    0.0020 |      0.5013  
              eu |   0.1766    0.6874   -0.0952    0.0668 |      0.4827  
              ue |   0.5923   -0.5661   -0.0717   -0.0664 |      0.3191  
              ne |   0.6636   -0.2132    0.3822    0.0397 |      0.3665  
       empchange |   0.7784   -0.2002   -0.2064    0.1031 |      0.3008  
        migstate |   0.7155    0.0790   -0.1654    0.0921 |      0.4460  
             jcr |   0.7660    0.1004   -0.1302   -0.1276 |      0.3699  
             jdr |   0.4907    0.5038   -0.0556   -0.0982 |      0.4927  
    ---------------------------------------------------------------------

. predict f1 if e(sample)
(regression scoring assumed)

Scoring coefficients (method = regression)

    ------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4 
    -------------+----------------------------------------
              en |  0.11682   0.13484   0.37808   0.00838 
              eu |  0.05819   0.35349  -0.06483   0.07709 
              ue |  0.15717  -0.41975  -0.07659  -0.17883 
              ne |  0.20041  -0.09872   0.49782   0.06888 
       empchange |  0.26699  -0.10754  -0.29659   0.27683 
        migstate |  0.17514   0.05434  -0.16159   0.15352 
             jcr |  0.24272   0.10994  -0.12208  -0.27753 
             jdr |  0.12020   0.27033  -0.05481  -0.13790 
    ------------------------------------------------------


. mat f1mat = r(scoef)

. scalar f1sum = f1mat[1,1]+f1mat[2,1]+f1mat[3,1]+f1mat[4,1]+f1mat[5,1]+f1mat[6,1]+f1mat[7,1]+f1mat[8,1]

. gen f1mean = (f1mat[1,1]*en+f1mat[2,1]*eu+f1mat[3,1]*ue+f1mat[4,1]*ne+f1mat[5,1]*empchange+f1mat[6,1]*migstate+f1mat[7,1]*jcr+f1mat[8,1]*jdr)/f1sum
(799 missing values generated)

. sum f1mean if year==1980, det

                           f1mean
-------------------------------------------------------------
      Percentiles      Smallest
 1%     3.631457       3.631457
 5%      3.88119        3.87206
10%      3.97972        3.88119       Obs                  51
25%     4.234126       3.913465       Sum of Wgt.          51

50%     4.516445                      Mean            4.73601
                        Largest       Std. Dev.      .6878545
75%     5.394144       6.007512
90%     5.667519       6.047559       Variance       .4731438
95%     6.047559       6.069428       Skewness       .4997366
99%     6.178404       6.178404       Kurtosis        2.10853

. 
. * state unemployment from the BLS
. merge 1:1 state year using Input\stateur

    Result                           # of obs.
    -----------------------------------------
    not matched                           518
        from master                       480  (_merge==1)
        from using                         38  (_merge==2)

    matched                             1,951  (_merge==3)
    -----------------------------------------

. drop _merge

. merge 1:1 state year using Output\union

    Result                           # of obs.
    -----------------------------------------
    not matched                           365
        from master                        91  (_merge==1)
        from using                        274  (_merge==2)

    matched                             2,378  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(274 observations deleted)

. drop _merge

. 
. gen timet = 1 if year==1977
(2,418 missing values generated)

. sort state year

. quietly by state: replace timet = timet[_n-1]+1 if year>=1978

. gen timet2 = timet^2
(480 missing values generated)

. quietly for num 1/3: quietly by state: gen stateurX = stateur[_n-X]

. quietly for num 1/56: gen stateX = state==X 

. quietly for num 1/56: gen stateXt = stateX*timet

. quietly for num 1/56: gen stateXt2 = stateX*timet2

. quietly for num 1/56: gen stateXur = stateX*stateur

. quietly for num 1/56: gen stateXur1 = stateX*stateur1

. quietly for var f1 owner p9010 age64p age1822 age2334 age3544 age4564 primemale primefemale en eu ue ne empchange migstate jcr jdr mfg ag serv retail fire gov selfemp manprof techocc servocc prodocc opocc adminocc salesocc military lths hsdeg somec
> ol collplus married single union: gen Xtrend = .

. quietly for var f1 owner p9010 age64p age2334 en eu ue ne empchange migstate jcr jdr : gen Xtrend98 = .

. gen y9713 = year>=1997

. gen timet97 = timet*y9713
(480 missing values generated)

. 
. egen mpop = mean(pop), by(state)

. sum f1 if year==1980 [w=mpop]
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
          f1 |      51  161743.005    .5404476   1.068867  -1.105902   4.247917

. gen f180 = r(mean)

. reg f1  timet state1-state2 state4-state6 state8-state13 state15-state42 state44-state51 state53-state56 state1ur-state2ur state4ur-state6ur state8ur-state13ur state15ur-state42ur state44ur-state51ur state53ur-state56ur state1ur1-state2ur1 state4ur
> 1-state6ur1 state8ur1-state13ur1 state15ur1-state42ur1 state44ur1-state51ur1 state53ur1-state56ur1 [w=mpop], noc
(analytic weights assumed)
(sum of wgt is 5,175,776.171875)

      Source |       SS           df       MS      Number of obs   =     1,632
-------------+----------------------------------   F(154, 1478)    =     71.25
       Model |  1119.49121       154  7.26942346   Prob > F        =    0.0000
    Residual |  150.801529     1,478  .102030804   R-squared       =    0.8813
-------------+----------------------------------   Adj R-squared   =    0.8689
       Total |  1270.29274     1,632  .778365651   Root MSE        =    .31942

------------------------------------------------------------------------------
          f1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       timet |  -.0532415   .0008409   -63.31   0.000    -.0548911   -.0515919
      state1 |   1.116767   .2203641     5.07   0.000      .684507    1.549026
      state2 |  -.3594744   .4461336    -0.81   0.421    -1.234597    .5156479
      state4 |   2.987082   .2641314    11.31   0.000     2.468969    3.505194
      state5 |   1.413519   .3379161     4.18   0.000     .7506723    2.076365
      state6 |   2.035756   .1024214    19.88   0.000     1.834849    2.236663
      state8 |    3.31586   .2408966    13.76   0.000     2.843325    3.788396
      state9 |   1.532198   .2259053     6.78   0.000     1.089069    1.975328
     state10 |   2.407391    .246981     9.75   0.000      1.92292    2.891861
     state11 |   1.872291   .4673556     4.01   0.000       .95554    2.789042
     state12 |   2.463636   .1379705    17.86   0.000     2.192997    2.734275
     state13 |   2.118775   .2134486     9.93   0.000     1.700081     2.53747
     state15 |   1.721545   .2651835     6.49   0.000     1.201369    2.241721
     state16 |   3.086202   .2925071    10.55   0.000     2.512429    3.659975
     state17 |   1.692726   .1533595    11.04   0.000     1.391901    1.993551
     state18 |   1.728285   .1782517     9.70   0.000     1.378632    2.077939
     state19 |   1.463207   .2246433     6.51   0.000     1.022554    1.903861
     state20 |   3.010711   .3877923     7.76   0.000     2.250029    3.771393
     state21 |   1.762323   .2739468     6.43   0.000     1.224957    2.299689
     state22 |   1.449664   .2585886     5.61   0.000     .9424246    1.956904
     state23 |   2.532861   .2865276     8.84   0.000     1.970817    3.094905
     state24 |   2.407325   .2527947     9.52   0.000      1.91145    2.903199
     state25 |   1.753077   .1836697     9.54   0.000     1.392796    2.113358
     state26 |   1.605732   .1358686    11.82   0.000     1.339216    1.872248
     state27 |   2.061445   .2450253     8.41   0.000     1.580811    2.542079
     state28 |   1.475114   .3164053     4.66   0.000      .854463    2.095765
     state29 |   1.739827    .258202     6.74   0.000     1.233346    2.246309
     state30 |   2.474806   .3734891     6.63   0.000     1.742181    3.207431
     state31 |   2.334203   .2945051     7.93   0.000      1.75651    2.911895
     state32 |   2.616863   .1919156    13.64   0.000     2.240407    2.993319
     state33 |   2.794019   .2446502    11.42   0.000     2.314121    3.273918
     state34 |   1.758492   .1717731    10.24   0.000     1.421547    2.095437
     state35 |   2.244802   .3493211     6.43   0.000     1.559584     2.93002
     state36 |    1.63859   .1595254    10.27   0.000     1.325669     1.95151
     state37 |   1.621681   .1561049    10.39   0.000     1.315471    1.927892
     state38 |   1.689142   .3296467     5.12   0.000     1.042517    2.335767
     state39 |   1.770576   .1449975    12.21   0.000     1.486153    2.054999
     state40 |   2.152777   .3064514     7.02   0.000     1.551651    2.753903
     state41 |   2.794442   .2967891     9.42   0.000     2.212269    3.376615
     state42 |   1.635344   .1582707    10.33   0.000     1.324885    1.945803
     state44 |   1.297154   .2194077     5.91   0.000     .8667705    1.727538
     state45 |   1.397398   .2526007     5.53   0.000     .9019044    1.892892
     state46 |   2.088951   .3372916     6.19   0.000      1.42733    2.750572
     state47 |   1.948684   .2415775     8.07   0.000     1.474812    2.422555
     state48 |   2.165362   .1897519    11.41   0.000      1.79315    2.537574
     state49 |   3.064156   .2493921    12.29   0.000     2.574955    3.553356
     state50 |   2.736926   .3330654     8.22   0.000     2.083594    3.390257
     state51 |   1.879942   .2280242     8.24   0.000     1.432656    2.327227
     state53 |   2.622955   .2761665     9.50   0.000     2.081235    3.164675
     state54 |   .8816466   .2394306     3.68   0.000     .4119866    1.351307
     state55 |   1.499995   .2055343     7.30   0.000     1.096825    1.903165
     state56 |   3.443286   .2926187    11.77   0.000     2.869294    4.017278
    state1ur |  -.1074746   .0494372    -2.17   0.030    -.2044492      -.0105
    state2ur |   .2668362    .104446     2.55   0.011      .061958    .4717144
    state4ur |   -.105011   .0564101    -1.86   0.063    -.2156633    .0056414
    state5ur |  -.2545415   .1090365    -2.33   0.020    -.4684244   -.0406587
    state6ur |  -.1029993   .0228266    -4.51   0.000    -.1477753   -.0582232
    state8ur |    -.15873   .0717728    -2.21   0.027    -.2995175   -.0179426
    state9ur |   -.135768   .0791655    -1.71   0.087    -.2910566    .0195207
   state10ur |  -.2399841   .0845314    -2.84   0.005    -.4057984   -.0741698
   state11ur |  -.1685111   .0845785    -1.99   0.047    -.3344178   -.0026044
   state12ur |  -.1707652   .0367711    -4.64   0.000    -.2428944   -.0986361
   state13ur |   -.175699   .0649366    -2.71   0.007    -.3030766   -.0483214
   state15ur |  -.2217381    .088696    -2.50   0.013    -.3957217   -.0477546
   state16ur |  -.1080192   .0694228    -1.56   0.120    -.2441969    .0281584
   state17ur |  -.1615957   .0354858    -4.55   0.000    -.2312037   -.0919878
   state18ur |  -.1577397   .0507181    -3.11   0.002    -.2572268   -.0582526
   state19ur |  -.0897748   .0857085    -1.05   0.295    -.2578982    .0783485
   state20ur |   -.405414   .1083209    -3.74   0.000    -.6178931   -.1929349
   state21ur |  -.1114493   .0650133    -1.71   0.087    -.2389775    .0160788
   state22ur |  -.0897258    .061308    -1.46   0.144    -.2099858    .0305342
   state23ur |  -.3202877   .0860197    -3.72   0.000    -.4890214    -.151554
   state24ur |  -.2337626   .0806008    -2.90   0.004    -.3918668   -.0756583
   state25ur |  -.1896352    .053837    -3.52   0.000    -.2952403   -.0840301
   state26ur |  -.1171692   .0276954    -4.23   0.000    -.1714958   -.0628426
   state27ur |  -.1912938   .0787564    -2.43   0.015      -.34578   -.0368076
   state28ur |  -.2173355   .0708241    -3.07   0.002     -.356262   -.0784091
   state29ur |  -.1737234   .0679355    -2.56   0.011    -.3069835   -.0404632
   state30ur |  -.0931597   .1094042    -0.85   0.395    -.3077637    .1214444
   state31ur |  -.2010959    .136083    -1.48   0.140    -.4680323    .0658405
   state32ur |  -.1391148   .0540571    -2.57   0.010    -.2451516   -.0330781
   state33ur |  -.2715382   .0812978    -3.34   0.001    -.4310095   -.1120668
   state34ur |  -.1458687   .0463228    -3.15   0.002    -.2367342   -.0550032
   state35ur |  -.0975567   .0822521    -1.19   0.236       -.2589    .0637865
   state36ur |  -.1582125   .0375146    -4.22   0.000       -.2318   -.0846249
   state37ur |  -.1549105   .0431471    -3.59   0.000    -.2395465   -.0702745
   state38ur |   .0194868   .1698181     0.11   0.909    -.3136234     .352597
   state39ur |  -.2023671   .0343253    -5.90   0.000    -.2696987   -.1350356
   state40ur |  -.1002071    .076916    -1.30   0.193    -.2510832     .050669
   state41ur |  -.1969687   .0606146    -3.25   0.001    -.3158686   -.0780689
   state42ur |  -.1779456   .0421078    -4.23   0.000    -.2605431   -.0953481
   state44ur |  -.0808589    .066087    -1.22   0.221    -.2104932    .0487755
   state45ur |  -.1138811   .0585941    -1.94   0.052    -.2288176    .0010554
   state46ur |  -.2113119   .1389034    -1.52   0.128    -.4837806    .0611568
   state47ur |  -.2107493   .0599923    -3.51   0.000    -.3284285   -.0930702
   state48ur |  -.0521513   .0412526    -1.26   0.206    -.1330711    .0287686
   state49ur |  -.1363688   .0682618    -2.00   0.046    -.2702692   -.0024684
   state50ur |  -.2024901   .1077711    -1.88   0.060    -.4138906    .0089105
   state51ur |  -.2520362    .074972    -3.36   0.001    -.3990991   -.1049733
   state53ur |  -.1132006   .0595926    -1.90   0.058    -.2300957    .0036944
   state54ur |  -.0482122   .0526829    -0.92   0.360    -.1515533    .0551289
   state55ur |   -.118392   .0583053    -2.03   0.042    -.2327619    -.004022
   state56ur |  -.0014639   .0814932    -0.02   0.986    -.1613186    .1583908
   state1ur1 |   .0167994   .0528521     0.32   0.751    -.0868737    .1204725
   state2ur1 |   .1917123   .1038561     1.85   0.065    -.0120087    .3954334
   state4ur1 |  -.0764047   .0582624    -1.31   0.190    -.1906905    .0378811
   state5ur1 |     .19063   .1128559     1.69   0.091    -.0307447    .4120047
   state6ur1 |  -.0217023   .0237647    -0.91   0.361    -.0683184    .0249139
   state8ur1 |  -.0671546   .0725164    -0.93   0.355    -.2094005    .0750914
   state9ur1 |  -.0537713   .0821418    -0.65   0.513    -.2148981    .1073555
  state10ur1 |  -.0307586   .0859563    -0.36   0.721    -.1993681    .1378508
  state11ur1 |   .0775515   .0917443     0.85   0.398    -.1024113    .2575143
  state12ur1 |  -.0120204    .037943    -0.32   0.751    -.0864482    .0624074
  state13ur1 |   .0106832   .0669781     0.16   0.873    -.1206991    .1420655
  state15ur1 |  -.0075054   .0879313    -0.09   0.932    -.1799887     .164978
  state16ur1 |  -.0399543   .0715197    -0.56   0.576    -.1802453    .1003367
  state17ur1 |  -.0164201   .0382096    -0.43   0.667    -.0913708    .0585307
  state18ur1 |  -.0106565   .0534094    -0.20   0.842    -.1154228    .0941098
  state19ur1 |  -.0543508   .0886447    -0.61   0.540    -.2282336    .1195321
  state20ur1 |   .0541976   .1060253     0.51   0.609    -.1537785    .2621737
  state21ur1 |  -.0314376   .0679791    -0.46   0.644    -.1647834    .1019082
  state22ur1 |   .0238164   .0631387     0.38   0.706    -.1000347    .1476675
  state23ur1 |   .0611045   .0899137     0.68   0.497    -.1152676    .2374766
  state24ur1 |  -.0398524   .0843917    -0.47   0.637    -.2053927    .1256879
  state25ur1 |  -.0359016   .0554928    -0.65   0.518    -.1447547    .0729515
  state26ur1 |  -.0047107   .0289728    -0.16   0.871    -.0615429    .0521215
  state27ur1 |  -.0162023   .0830647    -0.20   0.845    -.1791395     .146735
  state28ur1 |   .0970488   .0730368     1.33   0.184     -.046218    .2403156
  state29ur1 |   .0296064   .0725831     0.41   0.683    -.1127705    .1719832
  state30ur1 |  -.0012118   .1131971    -0.01   0.991    -.2232557    .2208322
  state31ur1 |  -.1363292   .1428796    -0.95   0.340    -.4165976    .1439393
  state32ur1 |   .0243291   .0557638     0.44   0.663    -.0850555    .1337137
  state33ur1 |  -.0677128   .0837709    -0.81   0.419    -.2320353    .0966097
  state34ur1 |  -.0314962   .0484266    -0.65   0.516    -.1264883     .063496
  state35ur1 |    .036125   .0873915     0.41   0.679    -.1352995    .2075495
  state36ur1 |  -.0163782   .0398818    -0.41   0.681    -.0946092    .0618527
  state37ur1 |   .0241831   .0447772     0.54   0.589    -.0636504    .1120167
  state38ur1 |  -.0879153   .1773977    -0.50   0.620    -.4358933    .2600627
  state39ur1 |   .0121597   .0368885     0.33   0.742    -.0601997    .0845192
  state40ur1 |  -.0477252   .0792274    -0.60   0.547    -.2031354    .1076849
  state41ur1 |   .0267335   .0618368     0.43   0.666    -.0945638    .1480308
  state42ur1 |  -.0420681   .0465315    -0.90   0.366     -.133343    .0492068
  state44ur1 |  -.0544033   .0683508    -0.80   0.426    -.1884781    .0796716
  state45ur1 |   .0005002   .0605236     0.01   0.993    -.1182211    .1192216
  state46ur1 |   .0969908   .1433035     0.68   0.499    -.1841091    .3780907
  state47ur1 |   .0398557   .0646079     0.62   0.537    -.0868773    .1665887
  state48ur1 |  -.0547843   .0410906    -1.33   0.183    -.1353864    .0258178
  state49ur1 |  -.0833293   .0731977    -1.14   0.255    -.2269117    .0602531
  state50ur1 |  -.0992478   .1116963    -0.89   0.374    -.3183479    .1198524
  state51ur1 |   .0433542   .0776515     0.56   0.577    -.1089647     .195673
  state53ur1 |  -.0276457   .0628071    -0.44   0.660    -.1508462    .0955548
  state54ur1 |  -.0350516   .0582122    -0.60   0.547    -.1492389    .0791356
  state55ur1 |  -.0584762   .0629018    -0.93   0.353    -.1818625    .0649101
  state56ur1 |  -.2060982   .0830688    -2.48   0.013    -.3690434   -.0431529
------------------------------------------------------------------------------

. sum f1mean [w=mpop] if year==1980
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
      f1mean |      51  161743.005    4.715492   .6870516   3.631457   6.178404

. gen relf1trendnat = _b[timet]/r(mean)

. gen f1trendnat = _b[timet]*(timet-4)+f180 if e(sample)
(837 missing values generated)

. sum relf1trendnat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
relf1trend~t |      2,469   -.0112908           0  -.0112908  -.0112908

. 
.    lab def fips 2 "AK"

.    lab def fips 1 "AL", add

.    lab def fips 05 "AR", add                       

.    lab def fips 60 "AS", add             

.    lab def fips 04 "AZ", add             

.    lab def fips 06 "CA", add             

.    lab def fips 08 "CO", add             

.    lab def fips 09 "CT", add             

.    lab def fips 11 "DC", add             

.    lab def fips 10 "DE", add             

.    lab def fips 12 "FL", add             

.    lab def fips 13 "GA", add             

.    lab def fips 66 "GU", add             

.    lab def fips 15 "HI", add             

.    lab def fips 19 "IA", add             

.    lab def fips 16 "ID", add             

.    lab def fips 17 "IL", add             

.    lab def fips 18 "IN", add             

.    lab def fips 20 "KS", add             

.    lab def fips 21 "KY", add             

.    lab def fips 22 "LA", add             

.    lab def fips 25 "MA", add             

.    lab def fips 24 "MD", add             

.    lab def fips 23 "ME", add             

.    lab def fips 26 "MI", add             

.    lab def fips 27 "MN", add             

.    lab def fips 29 "MO", add             

.    lab def fips 28 "MS", add             

.    lab def fips 30 "MT", add             

.    lab def fips 37 "NC", add             

.    lab def fips 38 "ND", add             

.    lab def fips 31 "NE", add             

.    lab def fips 33 "NH", add             

.    lab def fips 34 "NJ", add             

.    lab def fips 35 "NM", add             

.    lab def fips 32 "NV", add             

.    lab def fips 36 "NY", add             

.    lab def fips 39 "OH", add             

.    lab def fips 40 "OK", add             

.    lab def fips 41 "OR", add             

.    lab def fips 42 "PA", add             

.    lab def fips 72 "PR", add             

.    lab def fips 44 "RI", add             

.    lab def fips 45 "SC", add             

.    lab def fips 46 "SD", add             

.    lab def fips 47 "TN", add             

.    lab def fips 48 "TX", add             

.    lab def fips 49 "UT", add             

.    lab def fips 51 "VA", add             

.    lab def fips 78 "VI", add             

.    lab def fips 50 "VT", add             

.    lab def fips 53 "WA", add             

.    lab def fips 55 "WI", add             

.    lab def fips 54 "WV", add             

.    lab def fips 56 "WY", add          

.    lab def fips 0  "US", add

. lab val state fips

. 
. save Output\stateregs, replace
file Output\stateregs.dta saved

. * this loop estimates the trend for each measure of fluidity and covariate
. foreach V of var f1 owner p9010 age64p age1822 age2334  age3544 age4564  primemale primefemale en eu ue ne empchange migstate jcr jdr mfg ag retail fire serv gov selfemp manprof techocc servocc prodocc opocc adminocc salesocc military lths hsdeg so
> mecol collplus married single union {
  2.    quietly for num 1/2 4/6 8/13 15/42 44/51 53/56: reg `V' stateur stateur1 timet if state==X \ replace `V'trend = _b[timet] if state==X
  3. }

. foreach V of var f1  en eu ue ne empchange migstate jcr jdr {
  2.    quietly for num 1/2 4/6 8/13 15/42 44/51 53/56: reg `V' stateur stateur1 timet if state==X & year>=1998 \ replace `V'trend98 = _b[timet] if state==X
  3. }

. 
. * this section examines whether the trends in each variable are different in the first half and second half of the sample
. quietly for any f1 en eu ue ne empchange migstate jcr jdr union age3544: gen Xtrendfh = . \ gen Xtrendsh = .\ gen Xtrendse = .

. foreach V of var f1 en eu ue ne empchange migstate jcr jdr union age3544 {
  2.    quietly for num 1/2 4/6 8/13 15/42 44/51 53/56: reg `V' stateur stateur1 timet timet97 y9713 if state==X \ replace `V'trendfh = _b[timet] if state==X\ replace `V'trendsh = _b[timet]+_b[timet97] if state==X \ replace `V'trendse = _se[timet97] 
> if state==X
  3. }

. quietly for any en eu ue ne empchange migstate jcr jdr: gen Xtemp = 1 if abs((Xtrendsh-Xtrendfh)/Xtrendse)>=1.97 & Xtrendsh~=. & abs(Xtrendsh/Xtrendfh)>=.5

. quietly for any en eu ue ne empchange migstate jcr jdr: replace Xtemp = 0 if (abs((Xtrendsh-Xtrendfh)/Xtrendse)<1.97 & Xtrendsh~=.) |  abs(Xtrendsh/Xtrendfh)<.5

. sum entemp eutemp uetemp netemp empchangetemp migstatetemp jcrtemp jdrtemp if year==2000

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      entemp |         51    .2941176     .460179          0          1
      eutemp |         51    .1176471    .3253957          0          1
      uetemp |         51    .1960784    .4009792          0          1
      netemp |         51    .0392157    .1960392          0          1
empchanget~p |         51    .4313725     .500196          0          1
-------------+---------------------------------------------------------
migstatetemp |         51    .0784314    .2715244          0          1
     jcrtemp |         51           0           0          0          0
     jdrtemp |         51     .372549    .4882944          0          1

. drop *temp

. 
. 
. * SHRM membership
. merge 1:1 state year using Input\state_hr_rate_Stata13

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,602
        from master                     1,602  (_merge==1)
        from using                          0  (_merge==2)

    matched                               867  (_merge==3)
    -----------------------------------------

. gen hrtrend = .
(2,469 missing values generated)

. quietly for num 1/2 4/6 8/13 15/42 44/51 53/56: reg hr_rate stateur stateur1 timet if state==X \ replace hrtrend = _b[timet] if state==X

. 
. 
. gen avgtrend = 1/8*(netrend+entrend+uetrend+eutrend+empchangetrend+migstatetrend+jcrtrend+jdrtrend)

. gen avgtrend98 = 1/8*(netrend98+entrend98+uetrend98+eutrend98+empchangetrend98+migstatetrend98+jcrtrend98+jdrtrend98)

. 
. * combine trends in each measure of fluidity
. factor entrend eutrend uetrend netrend empchangetrend migstatetrend jcrtrend jdrtrend if year==2000
(obs=51)

Factor analysis/correlation                      Number of obs    =         51
    Method: principal factors                    Retained factors =          4
    Rotation: (unrotated)                        Number of params =         26

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      3.82910      2.43425            0.6976       0.6976
        Factor2  |      1.39485      0.92583            0.2541       0.9518
        Factor3  |      0.46902      0.24795            0.0855       1.0372
        Factor4  |      0.22107      0.27442            0.0403       1.0775
        Factor5  |     -0.05335      0.02636           -0.0097       1.0678
        Factor6  |     -0.07971      0.04508           -0.0145       1.0532
        Factor7  |     -0.12480      0.04265           -0.0227       1.0305
        Factor8  |     -0.16745            .           -0.0305       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(28) =  289.27 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4 |   Uniqueness 
    -------------+----------------------------------------+--------------
         entrend |   0.4598   -0.6831    0.2774    0.0019 |      0.2451  
         eutrend |   0.1463    0.5056    0.2120    0.2598 |      0.6105  
         uetrend |   0.7143    0.2418    0.3023    0.1531 |      0.3165  
         netrend |   0.7744   -0.4203    0.1746   -0.1148 |      0.1799  
    empchanget~d |   0.6806    0.4405    0.1121   -0.1835 |      0.2965  
    migstatetr~d |   0.7315    0.4455   -0.1354   -0.2056 |      0.2059  
        jcrtrend |   0.9441   -0.0891   -0.1904    0.0747 |      0.0590  
        jdrtrend |   0.7725   -0.1925   -0.3977    0.1882 |      0.1726  
    ---------------------------------------------------------------------

. predict f1ptrend if e(sample)
(regression scoring assumed)

Scoring coefficients (method = regression)

    ------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4 
    -------------+----------------------------------------
         entrend |  0.05988  -0.37347   0.32475  -0.05395 
         eutrend |  0.04704   0.14371   0.15289   0.23623 
         uetrend |  0.08944   0.21450   0.41688   0.37639 
         netrend |  0.17740  -0.33671   0.32842  -0.34525 
    empchanget~d |  0.10374   0.25160   0.18447  -0.21123 
    migstatetr~d |  0.13988   0.33488  -0.12924  -0.52887 
        jcrtrend |  0.56679  -0.08520  -0.40507   0.20850 
        jdrtrend |  0.01250  -0.11974  -0.52824   0.42084 
    ------------------------------------------------------


. mat f1pmat = r(scoef)

. scalar f1psum = f1pmat[1,1]+f1pmat[2,1]+f1pmat[3,1]+f1pmat[4,1]+f1pmat[5,1]+f1pmat[6,1]+f1pmat[7,1]+f1pmat[8,1]

. gen f1pmean = (f1pmat[1,1]*en+f1pmat[2,1]*eu+f1pmat[3,1]*ue+f1pmat[4,1]*ne+f1pmat[5,1]*empchange+f1pmat[6,1]*migstate+f1pmat[7,1]*jcr+f1pmat[8,1]*jdr)/f1psum
(837 missing values generated)

. gen f1ptrendmean = (f1pmat[1,1]*entrend+f1pmat[2,1]*eutrend+f1pmat[3,1]*uetrend+f1pmat[4,1]*netrend+f1pmat[5,1]*empchangetrend+f1pmat[6,1]*migstatetrend+f1pmat[7,1]*jcrtrend+f1pmat[8,1]*jdrtrend)/f1psum

. gen temp =  f1pmean if year==1980
(2,418 missing values generated)

. egen f1pmean80 = mean(temp), by(state)

. drop temp

. factor entrend98 eutrend98 uetrend98 netrend98 empchangetrend98 migstatetrend98 jcrtrend98 jdrtrend98 if year==2000
(obs=51)

Factor analysis/correlation                      Number of obs    =         51
    Method: principal factors                    Retained factors =          5
    Rotation: (unrotated)                        Number of params =         28

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      2.31293      1.51289            0.6229       0.6229
        Factor2  |      0.80004      0.19008            0.2154       0.8383
        Factor3  |      0.60996      0.27865            0.1643       1.0026
        Factor4  |      0.33131      0.04681            0.0892       1.0918
        Factor5  |      0.28450      0.35191            0.0766       1.1684
        Factor6  |     -0.06741      0.16363           -0.0182       1.1502
        Factor7  |     -0.23104      0.09582           -0.0622       1.0880
        Factor8  |     -0.32686            .           -0.0880       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(28) =  117.32 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    -------------------------------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4   Factor5 |   Uniqueness 
    -------------+--------------------------------------------------+--------------
       entrend98 |   0.5403    0.0437   -0.4584   -0.2011    0.1871 |      0.4206  
       eutrend98 |   0.4971    0.1804    0.3664    0.2511    0.0345 |      0.5219  
       uetrend98 |   0.3498    0.6491    0.0200    0.0686   -0.0234 |      0.4506  
       netrend98 |   0.6790   -0.0475   -0.3576    0.3114    0.0298 |      0.3109  
    empchange~98 |   0.5233    0.2444    0.2265   -0.2931    0.0583 |      0.5259  
    migstatet~98 |   0.5799   -0.2602   -0.0144   -0.0046   -0.3840 |      0.4483  
      jcrtrend98 |   0.6973   -0.2324    0.1689   -0.1779   -0.0462 |      0.3974  
      jdrtrend98 |   0.3070   -0.4006    0.2393    0.0927    0.3064 |      0.5856  
    -------------------------------------------------------------------------------

. predict f1ptrend98 if e(sample)
(regression scoring assumed)

Scoring coefficients (method = regression)

    ----------------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4   Factor5 
    -------------+--------------------------------------------------
       entrend98 |  0.14655   0.05857  -0.39870  -0.34240   0.22087 
       eutrend98 |  0.14108   0.12619   0.29704   0.22843   0.05129 
       uetrend98 |  0.10479   0.50783   0.04764   0.02822  -0.06391 
       netrend98 |  0.32164  -0.06937  -0.37406   0.53117   0.07715 
    empchange~98 |  0.19002   0.16046   0.16953  -0.24869   0.08606 
    migstatet~98 |  0.16202  -0.17253   0.00754  -0.07832  -0.50934 
      jcrtrend98 |  0.29422  -0.20439   0.18547  -0.18429  -0.03123 
      jdrtrend98 |  0.06903  -0.23934   0.19922   0.05163   0.30326 
    ----------------------------------------------------------------


. mat f1pmat98 = r(scoef)

. scalar f1p98sum = f1pmat98[1,1]+f1pmat98[2,1]+f1pmat98[3,1]+f1pmat98[4,1]+f1pmat98[5,1]+f1pmat98[6,1]+f1pmat98[7,1]+f1pmat98[8,1]

. gen f1p98mean = (f1pmat98[1,1]*en+f1pmat98[2,1]*eu+f1pmat98[3,1]*ue+f1pmat98[4,1]*ne+f1pmat98[5,1]*empchange+f1pmat98[6,1]*migstate+f1pmat98[7,1]*jcr+f1pmat98[8,1]*jdr)/f1p98sum
(837 missing values generated)

. gen f1ptrend98mean = (f1pmat98[1,1]*entrend98+f1pmat98[2,1]*eutrend98+f1pmat98[3,1]*uetrend98+f1pmat98[4,1]*netrend98+f1pmat98[5,1]*empchangetrend98+f1pmat98[6,1]*migstatetrend98+f1pmat98[7,1]*jcrtrend98+f1pmat98[8,1]*jdrtrend98)/f1p98sum

. gen temp =  f1p98mean if year==1998
(2,418 missing values generated)

. egen f1p98mean98 = mean(temp), by(state)

. drop temp

. 
. * correlation of combined trends in first half vs second half
. factor entrendfh eutrendfh uetrendfh netrendfh empchangetrendfh migstatetrendfh jcrtrendfh jdrtrendfh if year==2000
(obs=51)

Factor analysis/correlation                      Number of obs    =         51
    Method: principal factors                    Retained factors =          4
    Rotation: (unrotated)                        Number of params =         26

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      3.55940      2.42551            0.7050       0.7050
        Factor2  |      1.13389      0.56540            0.2246       0.9296
        Factor3  |      0.56850      0.30258            0.1126       1.0422
        Factor4  |      0.26592      0.27699            0.0527       1.0948
        Factor5  |     -0.01108      0.09255           -0.0022       1.0926
        Factor6  |     -0.10363      0.05036           -0.0205       1.0721
        Factor7  |     -0.15400      0.05612           -0.0305       1.0416
        Factor8  |     -0.21012            .           -0.0416       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(28) =  240.22 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4 |   Uniqueness 
    -------------+----------------------------------------+--------------
       entrendfh |   0.6445   -0.5995    0.0770    0.1873 |      0.1842  
       eutrendfh |  -0.2574    0.2700    0.5494   -0.0466 |      0.5568  
       uetrendfh |   0.5564    0.3205    0.3935    0.1393 |      0.4134  
       netrendfh |   0.7685   -0.4386    0.1382    0.0706 |      0.1929  
    empchange~fh |   0.5583    0.4926   -0.1418    0.1409 |      0.4057  
    migstatet~fh |   0.6099    0.3953   -0.2519    0.1679 |      0.3801  
      jcrtrendfh |   0.9225    0.0812    0.0371   -0.1749 |      0.1104  
      jdrtrendfh |   0.8018    0.0293   -0.0434   -0.3544 |      0.2287  
    ---------------------------------------------------------------------

. predict f1ptrendfh if e(sample)
(regression scoring assumed)

Scoring coefficients (method = regression)

    ------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4 
    -------------+----------------------------------------
       entrendfh |  0.15646  -0.53998  -0.05137   0.39857 
       eutrendfh | -0.01751   0.08455   0.40234  -0.02732 
       uetrendfh |  0.05386   0.22723   0.42291   0.19470 
       netrendfh |  0.19115  -0.29504   0.26192   0.13535 
    empchange~fh |  0.11402   0.25234  -0.15399   0.25711 
    migstatet~fh |  0.12702   0.20688  -0.28194   0.28851 
      jcrtrendfh |  0.45624   0.23397   0.08895  -0.38535 
      jdrtrendfh |  0.11196  -0.03892  -0.13733  -0.58768 
    ------------------------------------------------------


. factor entrendsh eutrendsh uetrendsh netrendsh empchangetrendsh migstatetrendsh jcrtrendsh jdrtrendsh if year==2000
(obs=51)

Factor analysis/correlation                      Number of obs    =         51
    Method: principal factors                    Retained factors =          6
    Rotation: (unrotated)                        Number of params =         28

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      2.47270      1.53138            0.6258       0.6258
        Factor2  |      0.94132      0.52106            0.2382       0.8640
        Factor3  |      0.42026      0.06845            0.1064       0.9704
        Factor4  |      0.35181      0.18625            0.0890       1.0594
        Factor5  |      0.16556      0.06947            0.0419       1.1013
        Factor6  |      0.09609      0.30691            0.0243       1.1256
        Factor7  |     -0.21083      0.07466           -0.0534       1.0722
        Factor8  |     -0.28549            .           -0.0722       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(28) =  132.78 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    -----------------------------------------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4   Factor5   Factor6 |   Uniqueness 
    -------------+------------------------------------------------------------+--------------
       entrendsh |   0.4543   -0.2544    0.3532   -0.0949    0.0601    0.1753 |      0.5608  
       eutrendsh |   0.5037   -0.0810   -0.4236   -0.0456   -0.1798    0.1138 |      0.5129  
       uetrendsh |   0.6845   -0.2585    0.0357    0.0623   -0.1040   -0.1939 |      0.4111  
       netrendsh |   0.8500   -0.3017   -0.0876   -0.1757    0.1178    0.0045 |      0.1341  
    empchange~sh |   0.4778   -0.0689    0.1966    0.4026   -0.0708    0.0031 |      0.5611  
    migstatet~sh |   0.4137    0.2532   -0.1969    0.1615    0.3027   -0.0252 |      0.6076  
      jcrtrendsh |   0.4783    0.6472    0.0334    0.1161   -0.0806    0.0815 |      0.3246  
      jdrtrendsh |   0.4396    0.4738    0.1692   -0.3230   -0.0422   -0.0867 |      0.4400  
    -----------------------------------------------------------------------------------------

. predict f1ptrendsh if e(sample)
(regression scoring assumed)

Scoring coefficients (method = regression)

    --------------------------------------------------------------------------
        Variable |  Factor1   Factor2   Factor3   Factor4   Factor5   Factor6 
    -------------+------------------------------------------------------------
       entrendsh |  0.00651  -0.09360   0.38688  -0.01501  -0.01727   0.23285 
       eutrendsh |  0.00235   0.00059  -0.39840   0.00528  -0.33723   0.14669 
       uetrendsh |  0.14048  -0.11392   0.09362   0.19453  -0.26251  -0.35648 
       netrendsh |  0.67415  -0.38333  -0.20806  -0.39952   0.43474   0.09627 
    empchange~sh |  0.09715  -0.05786   0.18497   0.37003  -0.07873   0.00563 
    migstatet~sh | -0.00439   0.17818  -0.14933   0.20789   0.30702  -0.06575 
      jcrtrendsh |  0.33670   0.48387   0.00203   0.16010  -0.05332   0.18071 
      jdrtrendsh |  0.01617   0.32924   0.20782  -0.37985  -0.10756  -0.17237 
    --------------------------------------------------------------------------


. corr f1ptrend f1ptrendfh f1ptrendsh if year==2000
(obs=51)

             | f1ptrend f1ptr~fh f1ptr~sh
-------------+---------------------------
    f1ptrend |   1.0000
  f1ptrendfh |   0.8573   1.0000
  f1ptrendsh |   0.5897   0.3693   1.0000


. corr f1ptrend f1ptrendfh f1ptrendsh if year==2000 & state~=2
(obs=50)

             | f1ptrend f1ptr~fh f1ptr~sh
-------------+---------------------------
    f1ptrend |   1.0000
  f1ptrendfh |   0.7836   1.0000
  f1ptrendsh |   0.4947   0.1992   1.0000


. lab var f1ptrendfh "Trend in Fluidity 1980-1996"

. gr7 f1ptrendsh f1ptrendfh f1ptrendfh if year==2000, s([state].) c(.l) key1("") key2("") saving(Output\temp, replace) l1("Trend in Fluidity 1997-2013")

. 
. 
. 
. * bar chart of state trends 
. gen relf1ptrend = f1ptrendmean/f1pmean80 if year==2000
(2,418 missing values generated)

. gen relf1ptrend98 = f1ptrend98mean/f1p98mean98 if year==2000
(2,418 missing values generated)

. sum relf1ptrend [w=mpop]
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
 relf1ptrend |      51  161743.005   -.0105701   .0029898  -.0232783  -.0042954

. graph bar (mean) relf1ptrend if year==2000, over(state, sort(relf1ptrend) label(labsize(vsmall) alt)) l1("") ytitle("Trend in Labor Market Fluidity") graphregion(color(white)) ylab(, nogrid) yline(0, lc(black) lp(solid)) yline(-0.0106, lc(black) lp
> (dash)) saving(Output\Figure_6\statefig, replace) text(-.0112 75 "National Average", size(small))
(file Output\Figure_6\statefig.gph saved)

. 
. gen dlpop = log(pop10/pop60)
(38 missing values generated)

. gen ddlpop = log(pop10/pop00) - log(pop70/pop60)
(38 missing values generated)

. 
. gen decade = 1 if year>=1977 & year<=1979
(2,316 missing values generated)

. replace decade = 2 if year>=1980 & year<=1989
(510 real changes made)

. replace decade = 3 if year>=1990 & year<=1999
(510 real changes made)

. replace decade = 4 if year>=2000 & year<=2014
(765 real changes made)

. quietly for var f1 age* lths hsdeg somecol collplus married single female mfg retail fire serv ag gov selfemp manprof techocc servocc prodocc opocc adminocc salesocc military inschool owner p9010 union primemale primefemale: egen mX = mean(X), by(s
> tate decade)

. quietly for var age* lths hsdeg somecol collplus married single female mfg retail fire serv ag gov selfemp  manprof techocc servocc prodocc opocc adminocc salesocc military inschool owner p9010 union: gen temp = mX if year==1989 \ egen mX80s = mean
> (temp), by(state) \ drop temp

. quietly for var age* lths hsdeg somecol collplus married single female mfg retail fire serv ag gov selfemp manprof techocc servocc prodocc opocc adminocc salesocc military owner p9010 union primemale primefemale: gen temp = mX if year>=1977 & year<
> =1979 \ egen mX70s = mean(temp), by(state) \ drop temp

. quietly for var f1trend  f1ptrend f1trend98 f1ptrend98 f1ptrendfh f1ptrendsh mmfg70s mretail70s mfire70s mserv70s mag70s mage182270s mage233470s mage354470s mage456470s mage64p70s mmanprof70s mtechocc70s mservocc70s mprodocc70s mopocc70s madminocc7
> 0s msalesocc70s manproftrend techocctrend servocctrend prodocctrend opocctrend adminocctrend salesocctrend mlths70s mhsdeg70s msomecol70s mcollplus70s mowner70s mp901070s age1822trend age2334trend age3544trend age4564trend age64ptrend ownertrend p9
> 010trend mfgtrend agtrend retailtrend firetrend servtrend lthstrend hsdegtrend somecoltrend collplustrend mmarried70s msingle70s marriedtrend singletrend munion70s uniontrend mgov70s govtrend mselfemp70s selfemptrend mprimemale70s mprimefemale70s p
> rimemaletrend primefemaletrend mmilitary70s militarytrend uniontrendfh uniontrendsh age3544trendfh age3544trendsh dlpop ddlpop:  sum X if year==2000 \ gen Xd = (X-r(mean))/r(sd)

. 
. lab var mage182270sd "% Age 18-22, 1977-79"

. lab var age1822trendd "% Age 18-22, trend"

. lab var mage233470sd "% Age 23-34, 1977-79"

. lab var age2334trendd "% Age 23-34, trend"

. lab var mage354470sd "% Age 35-44, 1977-79"

. lab var age3544trendd "% Age 35-44, trend"

. lab var mage456470sd "% Age 45-64, 1977-79"

. lab var age4564trendd "% Age 45-64, trend"

. lab var mage64p70sd "% Age 64+, 1977-79"

. lab var age64ptrendd "% Age 64+, trend"

. lab var mmfg70sd "% Manufacturing, 1977-79"

. lab var mfgtrendd "% Manufacturing, trend"

. lab var mretail70sd "% Retail, 1977-79"

. lab var retailtrendd "% Retail, trend"

. lab var mfire70sd "% FIRE, 1977-79"

. lab var firetrendd "% FIRE, trend"

. lab var mserv70sd "% Service, 1977-79"

. lab var servtrendd "% Service, trend"

. lab var mag70sd "% Agriculture, 1977-79"

. lab var agtrendd "% Agriculture, trend"

. lab var mlths70sd "% Less than High School, 1977-79"

. lab var lthstrendd "% Less than High School, trend"

. lab var msomecol70sd "% Some College, 1977-79"

. lab var somecoltrendd "% Some College, trend"

. lab var mcollplus70sd "% College Plus, 1977-79"

. lab var collplustrendd "% College Plus, trend"

. lab var mmarried70sd "% Married, 1977-79"

. lab var marriedtrendd "% Married, trend"

. lab var msingle70sd "% Single (never married), 1977-79"

. lab var singletrendd "% Single (never married), trend"

. lab var mowner70sd "% Homeowner, 1977-79"

. lab var ownertrendd "% Homeowner, trend"

. lab var munion70sd "% Union member, 1977-79"

. lab var uniontrendd "% Union member, trend"

. lab var mselfemp70sd "% Self Employed, 1977-79"

. lab var selfemptrendd "% Self Employed, trend"

. lab var mgov70sd "% Government worker, 1977-79"

. lab var govtrendd "% Government worker, trend"

. lab var mmanprof70sd "% Manag./prof. occ., 1977-79"

. lab var manproftrendd "% Manag./prof. occ., trend"

. lab var mtechocc70sd "% Technicians, 1977-79"

. lab var techocctrendd "% Technicians, trend"

. lab var mprodocc70sd "% Production/craft occupation, 1977-79"

. lab var prodocctrendd "% Production/craft occupation, trend"

. lab var mopocc70sd "% Operator occupation, 1977-79"

. lab var opocctrendd "% Operator occupation, trend"

. lab var madminocc70sd "% Admin. support occ., 1977-79"

. lab var adminocctrendd "% Admin. support occ., trend"

. lab var mservocc70sd "% Service occupation, 1977-79"

. lab var servocctrendd "% Service occupation, trend"

. lab var msalesocc70sd "% Sales occupation, 1977-79"

. lab var salesocctrendd "% Sales occupation, trend"

. 
. 
. lab var cendiv1 "New England division"

. lab var cendiv2 "Middle Atlantic division"

. lab var cendiv3 "East North Central division"

. lab var cendiv4 "West North Central division"

. lab var cendiv5 "South Atlantic division"

. lab var cendiv6 "East South Central division"

. lab var cendiv7 "West South Central division"

. lab var cendiv8 "Mountain division"

. lab var cendiv9 "Pacific division"

. 
. 
. * correlation of trend with various state characteristics
. reg f1ptrendd mmfg70sd mretail70sd mfire70sd mserv70sd mag70sd  mfgtrendd retailtrendd firetrendd servtrendd agtrendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(10, 40)       =      4.83
       Model |  27.3426724        10  2.73426724   Prob > F        =    0.0001
    Residual |  22.6573283        40  .566433209   R-squared       =    0.5469
-------------+----------------------------------   Adj R-squared   =    0.4336
       Total |  50.0000007        50  1.00000001   Root MSE        =    .75262

------------------------------------------------------------------------------
   f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    mmfg70sd |    .749169   .2681539     2.79   0.008     .2072097    1.291128
 mretail70sd |  -.0173851   .1769143    -0.10   0.922    -.3749422     .340172
   mfire70sd |   .1057639   .1422918     0.74   0.462    -.1818186    .3933463
   mserv70sd |   .1135226   .1500674     0.76   0.454     -.189775    .4168201
     mag70sd |   -.512514    .379739    -1.35   0.185    -1.279995    .2549672
   mfgtrendd |   .3072545   .3211258     0.96   0.344     -.341765     .956274
retailtrendd |   .0435595   .1632492     0.27   0.791    -.2863794    .3734984
  firetrendd |     .19452    .146865     1.32   0.193    -.1023052    .4913453
  servtrendd |   .1854494   .1315616     1.41   0.166    -.0804465    .4513454
    agtrendd |  -.2824579   .4154589    -0.68   0.501    -1.122132    .5572159
       _cons |  -3.58e-09   .1053875    -0.00   1.000    -.2129962    .2129962
------------------------------------------------------------------------------

. estimates store indmod

. reg f1ptrendd mage182270sd mage233470sd mage354470sd mage456470sd mage64p70sd age1822trendd age2334trendd age3544trendd age4564trendd age64ptrendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(10, 40)       =      6.99
       Model |  31.7946241        10  3.17946241   Prob > F        =    0.0000
    Residual |  18.2053767        40  .455134417   R-squared       =    0.6359
-------------+----------------------------------   Adj R-squared   =    0.5449
       Total |  50.0000007        50  1.00000001   Root MSE        =    .67464

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 mage182270sd |   .2757814   .1797051     1.53   0.133    -.0874162     .638979
 mage233470sd |   .0098681   .1644053     0.06   0.952    -.3224074    .3421436
 mage354470sd |   .3107874    .183273     1.70   0.098    -.0596212     .681196
 mage456470sd |   .6403594   .1459956     4.39   0.000     .3452914    .9354274
  mage64p70sd |  -.0744858   .2212449    -0.34   0.738    -.5216385    .3726668
age1822trendd |   .2669428     .16197     1.65   0.107    -.0604107    .5942963
age2334trendd |   .2240158   .2001087     1.12   0.270    -.1804189    .6284506
age3544trendd |   .6253133   .2483893     2.52   0.016     .1232998    1.127327
age4564trendd |   .0971358   .1878967     0.52   0.608    -.2826176    .4768891
 age64ptrendd |  -.0116406   .1875897    -0.06   0.951    -.3907734    .3674923
        _cons |  -1.11e-08    .094468    -0.00   1.000     -.190927     .190927
-------------------------------------------------------------------------------

. estimates store agemod

. reg f1ptrendd mlths70sd msomecol70sd mcollplus70sd lthstrendd somecoltrendd collplustrendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(6, 44)        =      8.41
       Model |  26.7158159         6  4.45263598   Prob > F        =    0.0000
    Residual |  23.2841848        44  .529186019   R-squared       =    0.5343
-------------+----------------------------------   Adj R-squared   =    0.4708
       Total |  50.0000007        50  1.00000001   Root MSE        =    .72745

--------------------------------------------------------------------------------
     f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     mlths70sd |   .3059777   .3252721     0.94   0.352    -.3495652    .9615206
  msomecol70sd |  -.4273644   .2152877    -1.99   0.053    -.8612483    .0065195
 mcollplus70sd |  -.1633617   .1733557    -0.94   0.351    -.5127372    .1860138
    lthstrendd |   .1520656   .3151805     0.48   0.632     -.483139    .7872702
 somecoltrendd |   .0677103   .2804583     0.24   0.810    -.4975164    .6329369
collplustrendd |   .7497708   .2337234     3.21   0.002     .2787323    1.220809
         _cons |  -8.32e-09   .1018636    -0.00   1.000    -.2052926    .2052926
--------------------------------------------------------------------------------

. estimates store edmod

. reg f1ptrendd mmanprof70sd mtechocc70sd mservocc70sd mprodocc70sd mopocc70sd msalesocc70sd madminocc70sd manproftrendd techocctrendd servocctrendd prodocctrendd opocctrendd salesocctrendd adminocctrendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(14, 36)       =      5.62
       Model |  34.3127049        14  2.45090749   Prob > F        =    0.0000
    Residual |  15.6872959        36  .435758219   R-squared       =    0.6863
-------------+----------------------------------   Adj R-squared   =    0.5642
       Total |  50.0000007        50  1.00000001   Root MSE        =    .66012

--------------------------------------------------------------------------------
     f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  mmanprof70sd |  -.0524286   .1949339    -0.27   0.789    -.4477728    .3429156
  mtechocc70sd |  -.3551919   .1413167    -2.51   0.017    -.6417954   -.0685885
  mservocc70sd |   -.078735   .1983937    -0.40   0.694    -.4810961    .3236261
  mprodocc70sd |  -.1401607   .1540687    -0.91   0.369    -.4526264     .172305
    mopocc70sd |   .7573508   .4177844     1.81   0.078    -.0899553    1.604657
 msalesocc70sd |   .2191204   .1227366     1.79   0.083     -.029801    .4680418
 madminocc70sd |   .4243697   .3143835     1.35   0.185    -.2132295    1.061969
 manproftrendd |   .3754025    .168547     2.23   0.032     .0335735    .7172316
 techocctrendd |  -.2231067   .1643084    -1.36   0.183    -.5563397    .1101263
 servocctrendd |   .0760442   .1864559     0.41   0.686     -.302106    .4541943
 prodocctrendd |  -.1965803   .1458566    -1.35   0.186    -.4923911    .0992306
   opocctrendd |   .2790968   .4360269     0.64   0.526    -.6052067      1.1634
salesocctrendd |    .116837   .1324003     0.88   0.383    -.1516832    .3853571
adminocctrendd |   .2258713   .3876371     0.58   0.564    -.5602932    1.012036
         _cons |  -4.30e-09   .0924353    -0.00   1.000    -.1874674    .1874674
--------------------------------------------------------------------------------

. estimates store occmod

. reg f1ptrendd mowner70sd ownertrendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(2, 48)        =      0.20
       Model |  .403688434         2  .201844217   Prob > F        =    0.8232
    Residual |  49.5963123        48  1.03325651   R-squared       =    0.0081
-------------+----------------------------------   Adj R-squared   =   -0.0333
       Total |  50.0000007        50  1.00000001   Root MSE        =    1.0165

------------------------------------------------------------------------------
   f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  mowner70sd |  -.0553996   .1479755    -0.37   0.710    -.3529243    .2421251
 ownertrendd |  -.0850921   .1479755    -0.58   0.568    -.3826169    .2124326
       _cons |  -7.59e-09   .1423374    -0.00   1.000    -.2861885    .2861885
------------------------------------------------------------------------------

. estimates store ownermod

. reg f1ptrendd munion70sd uniontrendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(2, 48)        =      2.09
       Model |  4.00707774         2  2.00353887   Prob > F        =    0.1347
    Residual |   45.992923        48  .958185896   R-squared       =    0.0801
-------------+----------------------------------   Adj R-squared   =    0.0418
       Total |  50.0000007        50  1.00000001   Root MSE        =    .97887

------------------------------------------------------------------------------
   f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  munion70sd |  -.1727045    .185386    -0.93   0.356    -.5454481    .2000391
 uniontrendd |  -.3668826    .185386    -1.98   0.054    -.7396262     .005861
       _cons |  -8.40e-09   .1370692    -0.00   1.000    -.2755961     .275596
------------------------------------------------------------------------------

. estimates store unionmod

. reg f1ptrendd mselfemp70sd selfemptrendd mgov70sd govtrendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(4, 46)        =      6.54
       Model |  18.1278094         4  4.53195236   Prob > F        =    0.0003
    Residual |  31.8721913        46  .692873724   R-squared       =    0.3626
-------------+----------------------------------   Adj R-squared   =    0.3071
       Total |  50.0000007        50  1.00000001   Root MSE        =    .83239

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 mselfemp70sd |  -.3862122   .1847858    -2.09   0.042    -.7581667   -.0142577
selfemptrendd |   .0114662    .183315     0.06   0.950    -.3575278    .3804601
     mgov70sd |  -.4857083   .1692165    -2.87   0.006    -.8263234   -.1450932
    govtrendd |  -.1492317   .1685493    -0.89   0.381    -.4885038    .1900404
        _cons |  -1.19e-08    .116558    -0.00   1.000     -.234619     .234619
-------------------------------------------------------------------------------

. estimates store selfempmod 

. reg f1ptrendd mp901070s p9010trendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(2, 48)        =      8.25
       Model |  12.7864477         2  6.39322386   Prob > F        =    0.0008
    Residual |   37.213553        48  .775282355   R-squared       =    0.2557
-------------+----------------------------------   Adj R-squared   =    0.2247
       Total |  50.0000007        50  1.00000001   Root MSE        =     .8805

------------------------------------------------------------------------------
   f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   mp901070s |  -.7336199   1.398666    -0.52   0.602    -3.545827    2.078587
 p9010trendd |   .4975996   .1247391     3.99   0.000     .2467948    .7484043
       _cons |   .8786281    1.67966     0.52   0.603    -2.498554     4.25581
------------------------------------------------------------------------------

. reg f1ptrendd mmarried70sd marriedtrendd msingle70sd singletrendd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(4, 46)        =      2.26
       Model |  8.22138471         4  2.05534618   Prob > F        =    0.0768
    Residual |   41.778616        46  .908230783   R-squared       =    0.1644
-------------+----------------------------------   Adj R-squared   =    0.0918
       Total |  50.0000007        50  1.00000001   Root MSE        =    .95301

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 mmarried70sd |  -.7174768   .4173354    -1.72   0.092    -1.557529    .1225758
marriedtrendd |   .0685936    .224303     0.31   0.761    -.3829049    .5200922
  msingle70sd |  -.3475647   .3024714    -1.15   0.256     -.956408    .2612786
 singletrendd |  -.2052755   .2713453    -0.76   0.453    -.7514652    .3409143
        _cons |  -2.64e-09   .1334483    -0.00   1.000    -.2686175    .2686175
-------------------------------------------------------------------------------

. estimates store maritalmod

. reg f1ptrendd cendiv1-cendiv9 if year==2000, noc

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(9, 42)        =      7.73
       Model |  31.1712705         9   3.4634745   Prob > F        =    0.0000
    Residual |  18.8287302        42    .4483031   R-squared       =    0.6234
-------------+----------------------------------   Adj R-squared   =    0.5427
       Total |  50.0000007        51  .980392171   Root MSE        =    .66955

------------------------------------------------------------------------------
   f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     cendiv1 |   .3675333   .2733444     1.34   0.186    -.1840981    .9191648
     cendiv2 |   1.176549   .3865674     3.04   0.004     .3964243    1.956674
     cendiv3 |   .9113164   .2994338     3.04   0.004     .3070344    1.515598
     cendiv4 |    .020891   .2530678     0.08   0.935    -.4898205    .5316024
     cendiv5 |    .490669   .2231848     2.20   0.033     .0402638    .9410742
     cendiv6 |   .4047703   .3347772     1.21   0.233    -.2708374    1.080378
     cendiv7 |  -.1956985   .3347772    -0.58   0.562    -.8713063    .4799092
     cendiv8 |  -1.124725   .2367232    -4.75   0.000    -1.602452   -.6469981
     cendiv9 |  -1.338435   .2994338    -4.47   0.000    -1.942717   -.7341529
------------------------------------------------------------------------------

. estimates store divmod

. 
. 
. reg f1ptrendd mmfg70sd mserv70sd mage456470sd age1822trendd age3544trendd p9010trendd mmarried70sd msomecol70sd collplustrendd mselfemp70sd  mgov70sd uniontrendd mtechocc70sd madminocc70sd mopocc70sd msalesocc70sd manproftrendd salesocctrendd if ye
> ar==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(18, 32)       =      7.61
       Model |   40.533794        18  2.25187744   Prob > F        =    0.0000
    Residual |  9.46620674        32  .295818961   R-squared       =    0.8107
-------------+----------------------------------   Adj R-squared   =    0.7042
       Total |  50.0000007        50  1.00000001   Root MSE        =    .54389

--------------------------------------------------------------------------------
     f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      mmfg70sd |   .1700928   .4300602     0.40   0.695    -.7059112    1.046097
     mserv70sd |  -.0381758   .1567367    -0.24   0.809    -.3574381    .2810864
  mage456470sd |    .218009   .1373477     1.59   0.122    -.0617591     .497777
 age1822trendd |   .0195972   .0951244     0.21   0.838     -.174165    .2133593
 age3544trendd |   .2164211   .1397305     1.55   0.131    -.0682006    .5010427
   p9010trendd |  -.1221271   .1553957    -0.79   0.438    -.4386578    .1944036
  mmarried70sd |  -.0282652   .2027193    -0.14   0.890    -.4411909    .3846605
  msomecol70sd |  -.3021425   .1900283    -1.59   0.122    -.6892175    .0849324
collplustrendd |     .17021   .2976638     0.57   0.571    -.4361114    .7765313
  mselfemp70sd |   .0331545   .1641501     0.20   0.841    -.3012083    .3675174
      mgov70sd |  -.1633676   .2184966    -0.75   0.460    -.6084305    .2816954
   uniontrendd |   .0238316   .1378551     0.17   0.864      -.25697    .3046332
  mtechocc70sd |  -.1094199   .1431555    -0.76   0.450     -.401018    .1821783
 madminocc70sd |   .4354458   .1705214     2.55   0.016     .0881052    .7827865
    mopocc70sd |   .1863818   .3896049     0.48   0.636    -.6072174     .979981
 msalesocc70sd |   .0520451   .1315477     0.40   0.695    -.2159087    .3199989
 manproftrendd |  -.0388034   .2562661    -0.15   0.881    -.5608004    .4831937
salesocctrendd |   .0794909   .1030795     0.77   0.446    -.1304751    .2894569
         _cons |  -1.05e-08   .0761602    -0.00   1.000    -.1551332    .1551332
--------------------------------------------------------------------------------

. reg f1ptrendd mmfg70sd age3544trendd mmarried70sd uniontrendd  cendiv1-cendiv9 if year==2000, noc

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(13, 38)       =     12.97
       Model |  40.8014618        13  3.13857399   Prob > F        =    0.0000
    Residual |   9.1985389        38  .242066813   R-squared       =    0.8160
-------------+----------------------------------   Adj R-squared   =    0.7531
       Total |  50.0000007        51  .980392171   Root MSE        =      .492

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     mmfg70sd |   .3356718    .132964     2.52   0.016     .0665002    .6048433
age3544trendd |   .3207176   .0913262     3.51   0.001     .1358375    .5055977
 mmarried70sd |  -.2085171   .0945143    -2.21   0.033    -.3998514   -.0171828
  uniontrendd |  -.0686179   .0917472    -0.75   0.459    -.2543504    .1171147
      cendiv1 |  -.1438776    .261271    -0.55   0.585    -.6727932    .3850379
      cendiv2 |    .802366   .3168573     2.53   0.016      .160922     1.44381
      cendiv3 |   .3320177   .3017472     1.10   0.278    -.2788376    .9428729
      cendiv4 |   .2725931   .2071751     1.32   0.196     -.146811    .6919972
      cendiv5 |   .2762043   .1759869     1.57   0.125    -.0800625    .6324711
      cendiv6 |   .2364007   .2526212     0.94   0.355    -.2750042    .7478055
      cendiv7 |   -.067032   .2679111    -0.25   0.804    -.6093896    .4753256
      cendiv8 |  -.5782105    .258225    -2.24   0.031     -1.10096   -.0554612
      cendiv9 |  -.7299404   .2497363    -2.92   0.006    -1.235505   -.2243757
-------------------------------------------------------------------------------

. reg f1ptrendd madminocc70sd mopocc70sd uniontrendd age3544trendd  cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(7, 43)        =     29.43
       Model |  41.3663007         7  5.90947152   Prob > F        =    0.0000
    Residual |  8.63370009        43  .200783723   R-squared       =    0.8273
-------------+----------------------------------   Adj R-squared   =    0.7992
       Total |  50.0000007        50  1.00000001   Root MSE        =    .44809

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
madminocc70sd |   .2869716   .0718127     4.00   0.000     .1421474    .4317958
   mopocc70sd |   .3347123    .083189     4.02   0.000     .1669457    .5024788
  uniontrendd |  -.1823724   .0650251    -2.80   0.008     -.313508   -.0512368
age3544trendd |   .3422578   .0758253     4.51   0.000     .1893415    .4951741
      cendiv2 |    .565467   .2806881     2.01   0.050    -.0005944    1.131528
      cendiv8 |  -.9171468   .2064989    -4.44   0.000    -1.333591   -.5007021
      cendiv9 |  -.9868577   .2484002    -3.97   0.000    -1.487805   -.4859109
        _cons |   .2073541   .0793069     2.61   0.012     .0474165    .3672917
-------------------------------------------------------------------------------

. estimates store finalmod

. reg f1ptrendd madminocc70sd mopocc70sd uniontrendd age3544trendd  cendiv2 cendiv8 cendiv9 if year==2000 & state~=2

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(7, 42)        =     27.74
       Model |  27.4714162         7  3.92448803   Prob > F        =    0.0000
    Residual |  5.94276007        42  .141494287   R-squared       =    0.8221
-------------+----------------------------------   Adj R-squared   =    0.7925
       Total |  33.4141763        49  .681921964   Root MSE        =    .37616

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
madminocc70sd |   .3283123   .0610254     5.38   0.000     .2051579    .4514666
   mopocc70sd |   .3846454   .0707671     5.44   0.000     .2418317    .5274592
  uniontrendd |  -.1253717   .0561297    -2.23   0.031     -.238646   -.0120975
age3544trendd |   .0556734   .0914892     0.61   0.546    -.1289594    .2403062
      cendiv2 |   .4936858   .2362034     2.09   0.043      .017008    .9703637
      cendiv8 |  -.9190447   .1733502    -5.30   0.000     -1.26888   -.5692099
      cendiv9 |  -.9054455   .2093585    -4.32   0.000    -1.327948   -.4829429
        _cons |   .2571884   .0675494     3.81   0.000     .1208683    .3935086
-------------------------------------------------------------------------------

. estimates store finalmodx2

. reg f1ptrendd madminocc70sd mopocc70sd uniontrendd age3544trendd  cendiv2 cendiv8 cendiv9 dlpopd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(8, 42)        =     25.16
       Model |  41.3688496         8  5.17110621   Prob > F        =    0.0000
    Residual |   8.6311511        42  .205503598   R-squared       =    0.8274
-------------+----------------------------------   Adj R-squared   =    0.7945
       Total |  50.0000007        50  1.00000001   Root MSE        =    .45333

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
madminocc70sd |    .287332   .0727239     3.95   0.000     .1405692    .4340948
   mopocc70sd |   .3338684   .0845015     3.95   0.000     .1633375    .5043993
  uniontrendd |  -.1853778   .0711045    -2.61   0.013    -.3288725   -.0418831
age3544trendd |   .3421247   .0767206     4.46   0.000     .1872962    .4969532
      cendiv2 |   .5680905   .2849434     1.99   0.053    -.0069485    1.143129
      cendiv8 |  -.9333328   .2544917    -3.67   0.001    -1.446918   -.4197477
      cendiv9 |  -.9976535   .2693501    -3.70   0.001    -1.541224    -.454083
       dlpopd |   .0099052   .0889382     0.11   0.912    -.1695793    .1893897
        _cons |   .2107972   .0859836     2.45   0.018     .0372752    .3843192
-------------------------------------------------------------------------------

. reg f1ptrendd madminocc70sd mopocc70sd uniontrendd age3544trendd  cendiv2 cendiv8 cendiv9 ddlpopd if year==2000

      Source |       SS           df       MS      Number of obs   =        51
-------------+----------------------------------   F(8, 42)        =     25.26
       Model |  41.3975081         8  5.17468852   Prob > F        =    0.0000
    Residual |  8.60249262        42  .204821253   R-squared       =    0.8280
-------------+----------------------------------   Adj R-squared   =    0.7952
       Total |  50.0000007        50  1.00000001   Root MSE        =    .45257

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
madminocc70sd |   .2803707   .0744765     3.76   0.001      .130071    .4306703
   mopocc70sd |   .3323237   .0842438     3.94   0.000     .1623129    .5023345
  uniontrendd |  -.1839853   .0658055    -2.80   0.008    -.3167861   -.0511845
age3544trendd |   .3427094   .0765926     4.47   0.000     .1881392    .4972795
      cendiv2 |   .5565372   .2844177     1.96   0.057     -.017441    1.130515
      cendiv8 |  -.9127682   .2088662    -4.37   0.000    -1.334277   -.4912592
      cendiv9 |  -1.008027     .25668    -3.93   0.000    -1.526028   -.4900256
      ddlpopd |  -.0272448   .0697979    -0.39   0.698    -.1681026     .113613
        _cons |    .209268   .0802502     2.61   0.013     .0473165    .3712195
-------------------------------------------------------------------------------

. 
. * Table A.6
. estout agemod edmod maritalmod ownermod indmod occmod unionmod selfempmod divmod, label collab(none) mlab("(1)" "(2)" "(3)" "(4)" "(5)" "(6)" "(7)" "(8)" "(9)")drop(_cons) modelwidth(5) varwidth(35) cells(b(star fmt(2))) starlevels(+ 0.10 * 0.05) s
> tats(N r2_a, fmt(%15.0f %15.2f) labels("# Obs." "Adj. R-squared"))  legend

--------------------------------------------------------------------------------------------------
                                      (1)    (2)    (3)    (4)    (5)    (6)    (7)    (8)    (9) 
--------------------------------------------------------------------------------------------------
% Age 18-22, 1977-79                 0.28                                                         
% Age 23-34, 1977-79                 0.01                                                         
% Age 35-44, 1977-79                 0.31+                                                        
% Age 45-64, 1977-79                 0.64*                                                        
% Age 64+, 1977-79                  -0.07                                                         
% Age 18-22, trend                   0.27                                                         
% Age 23-34, trend                   0.22                                                         
% Age 35-44, trend                   0.63*                                                        
% Age 45-64, trend                   0.10                                                         
% Age 64+, trend                    -0.01                                                         
% Less than High School, 1977-79            0.31                                                  
% Some College, 1977-79                    -0.43+                                                 
% College Plus, 1977-79                    -0.16                                                  
% Less than High School, trend              0.15                                                  
% Some College, trend                       0.07                                                  
% College Plus, trend                       0.75*                                                 
% Married, 1977-79                                -0.72+                                          
% Married, trend                                   0.07                                           
% Single (never married), 1977-79                 -0.35                                           
% Single (never married), trend                   -0.21                                           
% Homeowner, 1977-79                                     -0.06                                    
% Homeowner, trend                                       -0.09                                    
% Manufacturing, 1977-79                                         0.75*                            
% Retail, 1977-79                                               -0.02                             
% FIRE, 1977-79                                                  0.11                             
% Service, 1977-79                                               0.11                             
% Agriculture, 1977-79                                          -0.51                             
% Manufacturing, trend                                           0.31                             
% Retail, trend                                                  0.04                             
% FIRE, trend                                                    0.19                             
% Service, trend                                                 0.19                             
% Agriculture, trend                                            -0.28                             
% Manag./prof. occ., 1977-79                                           -0.05                      
% Technicians, 1977-79                                                 -0.36*                     
% Service occupation, 1977-79                                          -0.08                      
% Production/craft occupation, 1977                                    -0.14                      
% Operator occupation, 1977-79                                          0.76+                     
% Sales occupation, 1977-79                                             0.22+                     
% Admin. support occ., 1977-79                                          0.42                      
% Manag./prof. occ., trend                                              0.38*                     
% Technicians, trend                                                   -0.22                      
% Service occupation, trend                                             0.08                      
% Production/craft occupation, tren                                    -0.20                      
% Operator occupation, trend                                            0.28                      
% Sales occupation, trend                                               0.12                      
% Admin. support occ., trend                                            0.23                      
% Union member, 1977-79                                                       -0.17               
% Union member, trend                                                         -0.37+              
% Self Employed, 1977-79                                                             -0.39*       
% Self Employed, trend                                                                0.01        
% Government worker, 1977-79                                                         -0.49*       
% Government worker, trend                                                           -0.15        
New England division                                                                         0.37 
Middle Atlantic division                                                                     1.18*
East North Central division                                                                  0.91*
West North Central division                                                                  0.02 
South Atlantic division                                                                      0.49*
East South Central division                                                                  0.40 
West South Central division                                                                 -0.20 
Mountain division                                                                           -1.12*
Pacific division                                                                            -1.34*
--------------------------------------------------------------------------------------------------
# Obs.                                 51     51     51     51     51     51     51     51     51 
Adj. R-squared                       0.54   0.47   0.09  -0.03   0.43   0.56   0.04   0.31   0.54 
--------------------------------------------------------------------------------------------------
+ p<0.10, * p<0.05

. * Table 4
. estout finalmod finalmodx2, label collab(none) mlab("All States" "Excl. AK") varlab(_cons "Constant") modelwidth(15) varwidth(30) cells(b(star fmt(2)) se(par fmt(2))) starlevels(+ 0.10 * 0.05 ** 0.01) stats(N r2_a, fmt(%15.0f %15.2f)labels("# Obs."
>  "Adj. R-squared"))    legend

------------------------------------------------------------------
                                    All States          Excl. AK  
------------------------------------------------------------------
% Admin. support occ., 1977-79            0.29**            0.33**
                                        (0.07)            (0.06)  
% Operator occupation, 1977-79            0.33**            0.38**
                                        (0.08)            (0.07)  
% Union member, trend                    -0.18**           -0.13* 
                                        (0.07)            (0.06)  
% Age 35-44, trend                        0.34**            0.06  
                                        (0.08)            (0.09)  
Middle Atlantic division                  0.57+             0.49* 
                                        (0.28)            (0.24)  
Mountain division                        -0.92**           -0.92**
                                        (0.21)            (0.17)  
Pacific division                         -0.99**           -0.91**
                                        (0.25)            (0.21)  
Constant                                  0.21*             0.26**
                                        (0.08)            (0.07)  
------------------------------------------------------------------
# Obs.                                      51                50  
Adj. R-squared                            0.80              0.79  
------------------------------------------------------------------
+ p<0.10, * p<0.05, ** p<0.01

. 
. 
. * correlation of trend with SHRM membership
. quietly for var avgtrend98 netrend98 entrend98 uetrend98 eutrend98 empchangetrend98 migstatetrend98 jcrtrend98 jdrtrend98 avgtrend netrend entrend uetrend eutrend empchangetrend migstatetrend jcrtrend jdrtrend wharton : sum X if year==2000 \ gen Xd
>  = (X-r(mean))/r(sd)

. quietly for var hrtrend : sum X if year==2000 & state~=11 \ gen Xd = (X-r(mean))/r(sd)

. for any f1p avg ne en ue eu empchange migstate jcr jdr : reg Xtrend98d hrtrendd if year==2000 & state~=11 \ estimates store Xmodhr \ reg Xtrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & s
> tate~=11 \ estimates store Xmodhrb

->  reg f1ptrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.91
       Model |  .924052395         1  .924052395   Prob > F        =    0.3442
    Residual |  48.5922628        48  1.01233881   R-squared       =    0.0187
-------------+----------------------------------   Adj R-squared   =   -0.0018
       Total |  49.5163151        49  1.01053704   Root MSE        =    1.0062

------------------------------------------------------------------------------
 f1ptrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   .1373252   .1437358     0.96   0.344     -.151675    .4263254
       _cons |  -.0137724   .1422912    -0.10   0.923     -.299868    .2723231
------------------------------------------------------------------------------

->  estimates store f1pmodhr

->  reg f1ptrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      3.69
       Model |  20.7162701         8  2.58953377   Prob > F        =    0.0025
    Residual |   28.800045        41  .702440122   R-squared       =    0.4184
-------------+----------------------------------   Adj R-squared   =    0.3049
       Total |  49.5163151        49  1.01053704   Root MSE        =    .83812

-------------------------------------------------------------------------------
  f1ptrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .1798796   .1788144     1.01   0.320    -.1812433    .5410025
madminocc70sd |     -.0853   .1821214    -0.47   0.642    -.4531016    .2825016
   mopocc70sd |  -.0451293   .1568474    -0.29   0.775    -.3618891    .2716304
  uniontrendd |   -.117448    .122464    -0.96   0.343    -.3647691    .1298731
age3544trendd |   .2146165   .1908494     1.12   0.267    -.1708117    .6000447
      cendiv2 |  -.1412879   .5524689    -0.26   0.799    -1.257021    .9744456
      cendiv8 |   -1.35714    .419201    -3.24   0.002    -2.203733   -.5105463
      cendiv9 |   -.956205    .548387    -1.74   0.089    -2.063695     .151285
        _cons |   .3028727   .1683391     1.80   0.079    -.0370949    .6428404
-------------------------------------------------------------------------------

->  estimates store f1pmodhrb

->  reg avgtrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      3.01
       Model |  2.90163831         1  2.90163831   Prob > F        =    0.0890
    Residual |  46.2249062        48  .963018879   R-squared       =    0.0591
-------------+----------------------------------   Adj R-squared   =    0.0395
       Total |  49.1265445        49  1.00258254   Root MSE        =    .98134

------------------------------------------------------------------------------
 avgtrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   .2433457   .1401907     1.74   0.089    -.0385267     .525218
       _cons |  -.0185076   .1387818    -0.13   0.894     -.297547    .2605318
------------------------------------------------------------------------------

->  estimates store avgmodhr

->  reg avgtrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      3.26
       Model |  19.1118894         8  2.38898618   Prob > F        =    0.0057
    Residual |  30.0146551        41  .732064758   R-squared       =    0.3890
-------------+----------------------------------   Adj R-squared   =    0.2698
       Total |  49.1265445        49  1.00258254   Root MSE        =    .85561

-------------------------------------------------------------------------------
  avgtrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .2400516   .1825461     1.32   0.196    -.1286077    .6087108
madminocc70sd |  -.3445538   .1859221    -1.85   0.071    -.7200311    .0309235
   mopocc70sd |   .0059408   .1601207     0.04   0.971    -.3174294    .3293111
  uniontrendd |  -.1519916   .1250197    -1.22   0.231     -.404474    .1004909
age3544trendd |  -.0649675   .1948323    -0.33   0.740    -.4584393    .3285043
      cendiv2 |  -.6071021   .5639984    -1.08   0.288     -1.74612    .5319159
      cendiv8 |  -.7603836   .4279494    -1.78   0.083    -1.624645    .1038777
      cendiv9 |  -1.158639   .5598314    -2.07   0.045    -2.289241   -.0280364
        _cons |   .2256748   .1718522     1.31   0.196    -.1213877    .5727373
-------------------------------------------------------------------------------

->  estimates store avgmodhrb

->  reg netrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.11
       Model |  .113477968         1  .113477968   Prob > F        =    0.7377
    Residual |  48.0191828        48  1.00039964   R-squared       =    0.0024
-------------+----------------------------------   Adj R-squared   =   -0.0184
       Total |  48.1326608        49    .9822992   Root MSE        =    1.0002

------------------------------------------------------------------------------
  netrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   .0481236   .1428857     0.34   0.738    -.2391674    .3354145
       _cons |  -.0270609   .1414496    -0.19   0.849    -.3114644    .2573427
------------------------------------------------------------------------------

->  estimates store nemodhr

->  reg netrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      1.91
       Model |  13.0506838         8  1.63133548   Prob > F        =    0.0851
    Residual |  35.0819769        41  .855657974   R-squared       =    0.2711
-------------+----------------------------------   Adj R-squared   =    0.1289
       Total |  48.1326608        49    .9822992   Root MSE        =    .92502

-------------------------------------------------------------------------------
   netrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .0367196   .1973549     0.19   0.853    -.3618466    .4352859
madminocc70sd |   -.001058   .2010048    -0.01   0.996    -.4069954    .4048794
   mopocc70sd |  -.1181468   .1731102    -0.68   0.499      -.46775    .2314564
  uniontrendd |   .0392506   .1351618     0.29   0.773    -.2337142    .3122153
age3544trendd |   .1842221   .2106378     0.87   0.387    -.2411695    .6096137
      cendiv2 |    .293742    .609752     0.48   0.633    -.9376772    1.525161
      cendiv8 |  -1.280824   .4626662    -2.77   0.008    -2.215198   -.3464511
      cendiv9 |  -.6981929   .6052469    -1.15   0.255    -1.920514     .524128
        _cons |   .2345383   .1857934     1.26   0.214    -.1406792    .6097557
-------------------------------------------------------------------------------

->  estimates store nemodhrb

->  reg entrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.99
       Model |  .976627007         1  .976627007   Prob > F        =    0.3244
    Residual |  47.2872568        48  .985151184   R-squared       =    0.0202
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  48.2638838        49  .984977221   Root MSE        =    .99255

------------------------------------------------------------------------------
  entrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   .1411778   .1417925     1.00   0.324    -.1439152    .4262708
       _cons |   .0260927   .1403675     0.19   0.853     -.256135    .3083204
------------------------------------------------------------------------------

->  estimates store enmodhr

->  reg entrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      1.77
       Model |  12.3860086         8  1.54825107   Prob > F        =    0.1115
    Residual |  35.8778753        41  .875070128   R-squared       =    0.2566
-------------+----------------------------------   Adj R-squared   =    0.1116
       Total |  48.2638838        49  .984977221   Root MSE        =    .93545

-------------------------------------------------------------------------------
   entrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .0152798    .199581     0.08   0.939    -.3877822    .4183418
madminocc70sd |   .1555406   .2032721     0.77   0.449    -.2549757    .5660569
   mopocc70sd |   .2213189   .1750629     1.26   0.213    -.1322277    .5748656
  uniontrendd |   .2231521   .1366864     1.63   0.110    -.0528916    .4991959
age3544trendd |  -.1143666   .2130137    -0.54   0.594    -.5445565    .3158234
      cendiv2 |  -.7257066   .6166299    -1.18   0.246    -1.971016    .5196028
      cendiv8 |  -.6489889    .467885    -1.39   0.173    -1.593902    .2959239
      cendiv9 |  -.9268402    .612074    -1.51   0.138    -2.162949    .3092683
        _cons |   .2719639   .1878891     1.45   0.155    -.1074859    .6514138
-------------------------------------------------------------------------------

->  estimates store enmodhrb

->  reg uetrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.56
       Model |  .565813725         1  .565813725   Prob > F        =    0.4565
    Residual |  48.1909475        48  1.00397807   R-squared       =    0.0116
-------------+----------------------------------   Adj R-squared   =   -0.0090
       Total |  48.7567612        49  .995035943   Root MSE        =     1.002

------------------------------------------------------------------------------
  uetrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   -.107458    .143141    -0.75   0.456    -.3952623    .1803463
       _cons |  -.0220804   .1417024    -0.16   0.877    -.3069921    .2628313
------------------------------------------------------------------------------

->  estimates store uemodhr

->  reg uetrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      0.66
       Model |  5.58373648         8   .69796706   Prob > F        =    0.7206
    Residual |  43.1730247        41   1.0530006   R-squared       =    0.1145
-------------+----------------------------------   Adj R-squared   =   -0.0583
       Total |  48.7567612        49  .995035943   Root MSE        =    1.0262

-------------------------------------------------------------------------------
   uetrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .0081596   .2189334     0.04   0.970    -.4339854    .4503047
madminocc70sd |   .0315951   .2229824     0.14   0.888     -.418727    .4819172
   mopocc70sd |  -.2167325   .1920379    -1.13   0.266    -.6045609    .1710959
  uniontrendd |   .0147043   .1499402     0.10   0.922    -.2881061    .3175147
age3544trendd |   .3346782   .2336687     1.43   0.160    -.1372252    .8065816
      cendiv2 |   .5966897   .6764216     0.88   0.383    -.7693715    1.962751
      cendiv8 |  -.3883031   .5132535    -0.76   0.454     -1.42484    .6482334
      cendiv9 |    .283173   .6714239     0.42   0.675    -1.072795    1.639141
        _cons |    -.01299   .2061079    -0.06   0.950    -.4292332    .4032533
-------------------------------------------------------------------------------

->  estimates store uemodhrb

->  reg eutrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.22
       Model |   .22289388         1   .22289388   Prob > F        =    0.6426
    Residual |   49.061949        48  1.02212394   R-squared       =    0.0045
-------------+----------------------------------   Adj R-squared   =   -0.0162
       Total |  49.2848428        49  1.00581312   Root MSE        =     1.011

------------------------------------------------------------------------------
  eutrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   .0674452   .1444288     0.47   0.643    -.2229483    .3578387
       _cons |  -.0167468   .1429772    -0.12   0.907    -.3042217    .2707282
------------------------------------------------------------------------------

->  estimates store eumodhr

->  reg eutrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      1.84
       Model |  13.0398094         8  1.62997618   Prob > F        =    0.0963
    Residual |  36.2450334        41  .884025206   R-squared       =    0.2646
-------------+----------------------------------   Adj R-squared   =    0.1211
       Total |  49.2848428        49  1.00581312   Root MSE        =    .94023

-------------------------------------------------------------------------------
   eutrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .0748889   .2005996     0.37   0.711    -.3302302    .4800081
madminocc70sd |   .0546552   .2043095     0.27   0.790    -.3579563    .4672666
   mopocc70sd |   -.183779   .1759563    -1.04   0.302    -.5391301     .171572
  uniontrendd |  -.2273614    .137384    -1.65   0.106     -.504814    .0500912
age3544trendd |   .1829232   .2141009     0.85   0.398    -.2494623    .6153087
      cendiv2 |   .1122336    .619777     0.18   0.857    -1.139432    1.363899
      cendiv8 |  -1.046659   .4702729    -2.23   0.032    -1.996394   -.0969235
      cendiv9 |  -.8691903   .6151978    -1.41   0.165    -2.111607     .373227
        _cons |   .2422618   .1888481     1.28   0.207    -.1391246    .6236483
-------------------------------------------------------------------------------

->  estimates store eumodhrb

->  reg empchangetrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.08
       Model |  .083647075         1  .083647075   Prob > F        =    0.7778
    Residual |  49.8692448        48   1.0389426   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0191
       Total |  49.9528919        49  1.01944677   Root MSE        =    1.0193

------------------------------------------------------------------------------
empchang~98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   .0413169   .1456122     0.28   0.778    -.2514561    .3340898
       _cons |   .0042981   .1441487     0.03   0.976    -.2855323    .2941285
------------------------------------------------------------------------------

->  estimates store empchangemodhr

->  reg empchangetrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      0.52
       Model |  4.60951672         8   .57618959   Prob > F        =    0.8337
    Residual |  45.3433751        41  1.10593598   R-squared       =    0.0923
-------------+----------------------------------   Adj R-squared   =   -0.0848
       Total |  49.9528919        49  1.01944677   Root MSE        =    1.0516

-------------------------------------------------------------------------------
empchange~98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .0188602   .2243689     0.08   0.933    -.4342621    .4719825
madminocc70sd |  -.0194683   .2285185    -0.09   0.933    -.4809707     .442034
   mopocc70sd |   .0118239   .1968057     0.06   0.952    -.3856332     .409281
  uniontrendd |  -.0250952   .1536628    -0.16   0.871    -.3354236    .2852332
age3544trendd |   .0291607     .23947     0.12   0.904    -.4544589    .5127802
      cendiv2 |    .180079   .6932153     0.26   0.796    -1.219898    1.580056
      cendiv8 |  -.6671149   .5259962    -1.27   0.212    -1.729386    .3951561
      cendiv9 |  -.5304196   .6880935    -0.77   0.445    -1.920053    .8592135
        _cons |   .1514485    .211225     0.72   0.477     -.275129    .5780259
-------------------------------------------------------------------------------

->  estimates store empchangemodhrb

->  reg migstatetrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.03
       Model |  .033223679         1  .033223679   Prob > F        =    0.8589
    Residual |  49.9455652        48  1.04053261   R-squared       =    0.0007
-------------+----------------------------------   Adj R-squared   =   -0.0202
       Total |  49.9787888        49  1.01997528   Root MSE        =    1.0201

------------------------------------------------------------------------------
migstate~98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   .0260391   .1457236     0.18   0.859    -.2669578     .319036
       _cons |   .0028841    .144259     0.02   0.984     -.287168    .2929362
------------------------------------------------------------------------------

->  estimates store migstatemodhr

->  reg migstatetrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      2.59
       Model |  16.7938665         8  2.09923331   Prob > F        =    0.0216
    Residual |  33.1849224        41  .809388351   R-squared       =    0.3360
-------------+----------------------------------   Adj R-squared   =    0.2065
       Total |  49.9787888        49  1.01997528   Root MSE        =    .89966

-------------------------------------------------------------------------------
migstatet~98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .2088698   .1919447     1.09   0.283    -.1787705      .59651
madminocc70sd |  -.1929067   .1954946    -0.99   0.330    -.5877161    .2019026
   mopocc70sd |  -.0723323   .1683647    -0.43   0.670    -.4123517    .2676872
  uniontrendd |  -.3126298   .1314566    -2.38   0.022    -.5781117   -.0471479
age3544trendd |   .3562696   .2048635     1.74   0.090    -.0574606    .7699999
      cendiv2 |   .3715493   .5930368     0.63   0.534    -.8261128    1.569211
      cendiv8 |  -.9352659    .449983    -2.08   0.044    -1.844025   -.0265068
      cendiv9 |   .0718258   .5886552     0.12   0.903    -1.116987    1.260639
        _cons |   .1110626   .1807002     0.61   0.542    -.2538689    .4759942
-------------------------------------------------------------------------------

->  estimates store migstatemodhrb

->  reg jcrtrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      2.52
       Model |  2.48080457         1  2.48080457   Prob > F        =    0.1191
    Residual |  47.2956171        48  .985325357   R-squared       =    0.0498
-------------+----------------------------------   Adj R-squared   =    0.0300
       Total |  49.7764217        49  1.01584534   Root MSE        =    .99264

------------------------------------------------------------------------------
 jcrtrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |   .2250081   .1418051     1.59   0.119    -.0601101    .5101264
       _cons |  -.0093636   .1403799    -0.07   0.947    -.2916163     .272889
------------------------------------------------------------------------------

->  estimates store jcrmodhr

->  reg jcrtrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      3.99
       Model |  21.7943566         8  2.72429458   Prob > F        =    0.0014
    Residual |  27.9820651        41  .682489392   R-squared       =    0.4378
-------------+----------------------------------   Adj R-squared   =    0.3282
       Total |  49.7764217        49  1.01584534   Root MSE        =    .82613

-------------------------------------------------------------------------------
  jcrtrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .3312806   .1762567     1.88   0.067    -.0246771    .6872383
madminocc70sd |  -.1577801   .1795164    -0.88   0.385    -.5203209    .2047607
   mopocc70sd |   .1001471   .1546039     0.65   0.521    -.2120819    .4123761
  uniontrendd |  -.2209867   .1207124    -1.83   0.074    -.4647703    .0227968
age3544trendd |    .171947   .1881196     0.91   0.366    -.2079683    .5518623
      cendiv2 |  -.9930963   .5445667    -1.82   0.076    -2.092871    .1066786
      cendiv8 |  -.7819648    .413205    -1.89   0.066    -1.616449    .0525197
      cendiv9 |  -.8592477   .5405432    -1.59   0.120    -1.950897    .2324015
        _cons |   .2459822   .1659313     1.48   0.146    -.0891227    .5810872
-------------------------------------------------------------------------------

->  estimates store jcrmodhrb

->  reg jdrtrend98d hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      1.49
       Model |  1.47302207         1  1.47302207   Prob > F        =    0.2277
    Residual |  47.3624407        48  .986717514   R-squared       =    0.0302
-------------+----------------------------------   Adj R-squared   =    0.0100
       Total |  48.8354627        49  .996642096   Root MSE        =    .99334

------------------------------------------------------------------------------
 jdrtrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |    .173383   .1419052     1.22   0.228    -.1119365    .4587026
       _cons |  -.0213701    .140479    -0.15   0.880    -.3038221    .2610819
------------------------------------------------------------------------------

->  estimates store jdrmodhr

->  reg jdrtrend98d hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      1.88
       Model |  13.1191076         8  1.63988845   Prob > F        =    0.0893
    Residual |  35.7163551        41  .871130613   R-squared       =    0.2686
-------------+----------------------------------   Adj R-squared   =    0.1259
       Total |  48.8354627        49  .996642096   Root MSE        =    .93334

-------------------------------------------------------------------------------
  jdrtrend98d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |   .0424182   .1991312     0.21   0.832    -.3597355    .4445719
madminocc70sd |  -.4278695    .202814    -2.11   0.041    -.8374607   -.0182783
   mopocc70sd |  -.0978664   .1746684    -0.56   0.578    -.4506163    .2548835
  uniontrendd |   -.014047   .1363784    -0.10   0.918    -.2894687    .2613747
age3544trendd |  -.3244992   .2125337    -1.53   0.134    -.7537197    .1047213
      cendiv2 |   .0438136   .6152403     0.07   0.944    -1.198689    1.286317
      cendiv8 |  -.4085943   .4668306    -0.88   0.387    -1.351378    .5341891
      cendiv9 |  -1.053604   .6106946    -1.73   0.092    -2.286926    .1797194
        _cons |   .1113915   .1874657     0.59   0.556    -.2672032    .4899863
-------------------------------------------------------------------------------

->  estimates store jdrmodhrb

. reg f1ptrendd hrtrendd if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.91
       Model |  .924094093         1  .924094093   Prob > F        =    0.3443
    Residual |  48.6228587        48  1.01297622   R-squared       =    0.0187
-------------+----------------------------------   Adj R-squared   =   -0.0018
       Total |  49.5469528        49   1.0111623   Root MSE        =    1.0065

------------------------------------------------------------------------------
   f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hrtrendd |  -.1373283    .143781    -0.96   0.344    -.4264194    .1517628
       _cons |  -.0133291    .142336    -0.09   0.926    -.2995148    .2728565
------------------------------------------------------------------------------

. reg f1ptrendd hrtrendd madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000 & state~=11

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =     25.18
       Model |  41.1667938         8  5.14584923   Prob > F        =    0.0000
    Residual |  8.38015903        41  .204394123   R-squared       =    0.8309
-------------+----------------------------------   Adj R-squared   =    0.7979
       Total |  49.5469528        49   1.0111623   Root MSE        =     .4521

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     hrtrendd |  -.0221657   .0964566    -0.23   0.819    -.2169638    .1726323
madminocc70sd |   .3556702   .0982405     3.62   0.001     .1572695    .5540709
   mopocc70sd |   .3248167   .0846071     3.84   0.000     .1539492    .4956842
  uniontrendd |  -.1909689   .0660599    -2.89   0.006    -.3243796   -.0575582
age3544trendd |    .327169   .1029486     3.18   0.003     .1192601    .5350779
      cendiv2 |   .4809295   .2980145     1.61   0.114     -.120923    1.082782
      cendiv8 |  -.9587701   .2261267    -4.24   0.000    -1.415442    -.502098
      cendiv9 |  -1.081838   .2958126    -3.66   0.001    -1.679244   -.4844327
        _cons |   .2419775    .090806     2.66   0.011     .0585911    .4253639
-------------------------------------------------------------------------------

. estout f1pmodhr avgmodhr nemodhr enmodhr uemodhr eumodhr empchangemodhr migstatemodhr jcrmodhr jdrmodhr, keep(hrtrendd) cells(b(star fmt(2)) se(par fmt(2))) stats(N r2_a, fmt(%15.0f %15.2f)) 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                 f1pmodhr        avgmodhr         nemodhr         enmodhr         uemodhr         eumodhr    empchangem~r    migstatemo~r        jcrmodhr        jdrmodhr   
                     b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
hrtrendd             0.14            0.24            0.05            0.14           -0.11            0.07            0.04            0.03            0.23            0.17   
                   (0.14)          (0.14)          (0.14)          (0.14)          (0.14)          (0.14)          (0.15)          (0.15)          (0.14)          (0.14)   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                      50              50              50              50              50              50              50              50              50              50   
r2_a                -0.00            0.04           -0.02           -0.00           -0.01           -0.02           -0.02           -0.02            0.03            0.01   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. estout f1pmodhrb avgmodhrb nemodhrb enmodhrb uemodhrb eumodhrb empchangemodhrb migstatemodhrb jcrmodhrb jdrmodhrb, keep(hrtrendd) cells(b(star fmt(2)) se(par fmt(2))) stats(N r2_a, fmt(%15.0f %15.2f)) 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                f1pmodhrb       avgmodhrb        nemodhrb        enmodhrb        uemodhrb        eumodhrb    empchangem~b    migstatemo~b       jcrmodhrb       jdrmodhrb   
                     b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
hrtrendd             0.18            0.24            0.04            0.02            0.01            0.07            0.02            0.21            0.33            0.04   
                   (0.18)          (0.18)          (0.20)          (0.20)          (0.22)          (0.20)          (0.22)          (0.19)          (0.18)          (0.20)   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                      50              50              50              50              50              50              50              50              50              50   
r2_a                 0.30            0.27            0.13            0.11           -0.06            0.12           -0.08            0.21            0.33            0.13   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. * correlation of trend with land use regulation
. for any f1p avg ne en ue eu empchange migstate jcr jdr: reg Xtrendd whartond if year==2000 \ estimates store Xmodreg \ reg Xtrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000  \ estimates store 
> Xmodregb

->  reg f1ptrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      1.44
       Model |  1.44067378         1  1.44067378   Prob > F        =    0.2364
    Residual |  48.1062791        48  1.00221415   R-squared       =    0.0291
-------------+----------------------------------   Adj R-squared   =    0.0088
       Total |  49.5469528        49   1.0111623   Root MSE        =    1.0011

------------------------------------------------------------------------------
   f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |   .1714687   .1430152     1.20   0.236    -.1160827      .45902
       _cons |  -.0133291   .1415778    -0.09   0.925    -.2979905    .2713322
------------------------------------------------------------------------------

->  estimates store f1pmodreg

->  reg f1ptrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =     25.34
       Model |  41.2124941         8  5.15156176   Prob > F        =    0.0000
    Residual |  8.33445872        41  .203279481   R-squared       =    0.8318
-------------+----------------------------------   Adj R-squared   =    0.7990
       Total |  49.5469528        49   1.0111623   Root MSE        =    .45087

-------------------------------------------------------------------------------
    f1ptrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |   .0413229   .0783857     0.53   0.601    -.1169802    .1996261
madminocc70sd |   .3295171   .0969331     3.40   0.002     .1337568    .5252775
   mopocc70sd |   .3163078   .0862571     3.67   0.001     .1421081    .4905076
  uniontrendd |  -.1939719   .0661732    -2.93   0.005    -.3276115   -.0603324
age3544trendd |   .3307199   .0797741     4.15   0.000     .1696129    .4918269
      cendiv2 |   .4746895   .2923374     1.62   0.112    -.1156978    1.065077
      cendiv8 |  -.9579482   .2117844    -4.52   0.000    -1.385655    -.530241
      cendiv9 |  -1.098276   .2732488    -4.02   0.000    -1.650113   -.5464383
        _cons |    .241915   .0847924     2.85   0.007     .0706733    .4131568
-------------------------------------------------------------------------------

->  estimates store f1pmodregb

->  reg avgtrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.69
       Model |  .700710771         1  .700710771   Prob > F        =    0.4117
    Residual |  49.0420539        48  1.02170946   R-squared       =    0.0141
-------------+----------------------------------   Adj R-squared   =   -0.0065
       Total |  49.7427647        49  1.01515846   Root MSE        =    1.0108

------------------------------------------------------------------------------
   avgtrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |   .1195835   .1443995     0.83   0.412    -.1707511    .4099182
       _cons |   .0100437   .1429482     0.07   0.944    -.2773729    .2974603
------------------------------------------------------------------------------

->  estimates store avgmodreg

->  reg avgtrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =     16.34
       Model |  37.8677755         8  4.73347194   Prob > F        =    0.0000
    Residual |  11.8749892        41  .289633882   R-squared       =    0.7613
-------------+----------------------------------   Adj R-squared   =    0.7147
       Total |  49.7427647        49  1.01515846   Root MSE        =    .53818

-------------------------------------------------------------------------------
    avgtrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |     .01515   .0935653     0.16   0.872    -.1738089    .2041089
madminocc70sd |   .2943245   .1157044     2.54   0.015     .0606547    .5279943
   mopocc70sd |   .3899328    .102961     3.79   0.000     .1819988    .5978668
  uniontrendd |  -.1846245   .0789878    -2.34   0.024    -.3441437   -.0251053
age3544trendd |    .333738   .0952225     3.50   0.001     .1414322    .5260438
      cendiv2 |   .0101997   .3489492     0.03   0.977    -.6945176    .7149169
      cendiv8 |  -.6477372   .2527969    -2.56   0.014    -1.158271   -.1372034
      cendiv9 |  -1.117531   .3261641    -3.43   0.001    -1.776233   -.4588289
        _cons |   .2402632   .1012127     2.37   0.022       .03586    .4446664
-------------------------------------------------------------------------------

->  estimates store avgmodregb

->  reg netrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =     11.17
       Model |  9.13672042         1  9.13672042   Prob > F        =    0.0016
    Residual |  39.2738353        48  .818204903   R-squared       =    0.1887
-------------+----------------------------------   Adj R-squared   =    0.1718
       Total |  48.4105558        49  .987970526   Root MSE        =    .90455

------------------------------------------------------------------------------
    netrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |   .4318144    .129221     3.34   0.002     .1719982    .6916306
       _cons |  -.0249662   .1279222    -0.20   0.846    -.2821711    .2322387
------------------------------------------------------------------------------

->  estimates store nemodreg

->  reg netrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =     14.28
       Model |  35.6246683         8  4.45308353   Prob > F        =    0.0000
    Residual |  12.7858875        41  .311850915   R-squared       =    0.7359
-------------+----------------------------------   Adj R-squared   =    0.6844
       Total |  48.4105558        49  .987970526   Root MSE        =    .55844

-------------------------------------------------------------------------------
     netrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |   .3187615   .0970876     3.28   0.002     .1226892    .5148338
madminocc70sd |    .269488   .1200601     2.24   0.030     .0270216    .5119543
   mopocc70sd |    .086353    .106837     0.81   0.424    -.1294086    .3021147
  uniontrendd |  -.1048375   .0819613    -1.28   0.208    -.2703618    .0606868
age3544trendd |   .3871839   .0988072     3.92   0.000     .1876388    .5867291
      cendiv2 |   .6584916   .3620854     1.82   0.076    -.0727548    1.389738
      cendiv8 |  -.7616874   .2623135    -2.90   0.006     -1.29144   -.2319345
      cendiv9 |  -.9932926   .3384426    -2.93   0.005    -1.676791   -.3097939
        _cons |   .1793767   .1050229     1.71   0.095    -.0327212    .3914747
-------------------------------------------------------------------------------

->  estimates store nemodregb

->  reg entrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =     10.19
       Model |  8.75310876         1  8.75310876   Prob > F        =    0.0025
    Residual |  41.2435362        48  .859240338   R-squared       =    0.1751
-------------+----------------------------------   Adj R-squared   =    0.1579
       Total |   49.996645        49  1.02033969   Root MSE        =    .92695

------------------------------------------------------------------------------
    entrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |   .4226522   .1324217     3.19   0.002     .1564004    .6889039
       _cons |    .001147   .1310908     0.01   0.993    -.2624288    .2647228
------------------------------------------------------------------------------

->  estimates store enmodreg

->  reg entrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      3.40
       Model |  19.9575683         8  2.49469604   Prob > F        =    0.0044
    Residual |  30.0390767        41  .732660407   R-squared       =    0.3992
-------------+----------------------------------   Adj R-squared   =    0.2819
       Total |   49.996645        49  1.02033969   Root MSE        =    .85596

-------------------------------------------------------------------------------
     entrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |   .2338604   .1488132     1.57   0.124    -.0666739    .5343947
madminocc70sd |   .4733483   .1840249     2.57   0.014     .1017024    .8449942
   mopocc70sd |   .3709398   .1637568     2.27   0.029     .0402262    .7016535
  uniontrendd |   .0500239   .1256281     0.40   0.693    -.2036873    .3037351
age3544trendd |   .0980134    .151449     0.65   0.521     -.207844    .4038708
      cendiv2 |   .2353059   .5549948     0.42   0.674    -.8855289    1.356141
      cendiv8 |   .1631367   .4020671     0.41   0.687    -.6488542    .9751276
      cendiv9 |  -.4181482   .5187557    -0.81   0.425    -1.465797    .6295002
        _cons |   .0324669   .1609762     0.20   0.841    -.2926311    .3575649
-------------------------------------------------------------------------------

->  estimates store enmodregb

->  reg uetrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.26
       Model |  .261651373         1  .261651373   Prob > F        =    0.6133
    Residual |  48.5332153        48  1.01110865   R-squared       =    0.0054
-------------+----------------------------------   Adj R-squared   =   -0.0154
       Total |  48.7948667        49  .995813606   Root MSE        =    1.0055

------------------------------------------------------------------------------
    uetrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |  -.0730741   .1436484    -0.51   0.613    -.3618986    .2157504
       _cons |  -.0217394   .1422047    -0.15   0.879    -.3076611    .2641823
------------------------------------------------------------------------------

->  estimates store uemodreg

->  reg uetrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      3.97
       Model |  21.2856877         8  2.66071096   Prob > F        =    0.0015
    Residual |   27.509179        41  .670955585   R-squared       =    0.4362
-------------+----------------------------------   Adj R-squared   =    0.3262
       Total |  48.7948667        49  .995813606   Root MSE        =    .81912

-------------------------------------------------------------------------------
     uetrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |  -.2956849   .1424088    -2.08   0.044    -.5832854   -.0080844
madminocc70sd |   .3796217   .1761052     2.16   0.037       .02397    .7352734
   mopocc70sd |   .2467319   .1567094     1.57   0.123    -.0697491    .5632129
  uniontrendd |   .0068854   .1202216     0.06   0.955     -.235907    .2496778
age3544trendd |   .3382966   .1449312     2.33   0.025     .0456021     .630991
      cendiv2 |   .8075293     .53111     1.52   0.136     -.265069    1.880128
      cendiv8 |  -.5353326   .3847636    -1.39   0.172    -1.312378    .2417133
      cendiv9 |  -.3166934   .4964304    -0.64   0.527    -1.319255    .6858682
        _cons |   .0740035   .1540484     0.48   0.634    -.2371035    .3851106
-------------------------------------------------------------------------------

->  estimates store uemodregb

->  reg eutrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      1.54
       Model |  1.55087275         1  1.55087275   Prob > F        =    0.2212
    Residual |  48.4456651        48  1.00928469   R-squared       =    0.0310
-------------+----------------------------------   Adj R-squared   =    0.0108
       Total |  49.9965379        49  1.02033751   Root MSE        =    1.0046

------------------------------------------------------------------------------
    eutrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |  -.1779058   .1435188    -1.24   0.221    -.4664697    .1106581
       _cons |  -.0011653   .1420764    -0.01   0.993     -.286829    .2844984
------------------------------------------------------------------------------

->  estimates store eumodreg

->  reg eutrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      1.80
       Model |  12.9960098         8  1.62450123   Prob > F        =    0.1050
    Residual |   37.000528        41  .902451904   R-squared       =    0.2599
-------------+----------------------------------   Adj R-squared   =    0.1155
       Total |  49.9965379        49  1.02033751   Root MSE        =    .94997

-------------------------------------------------------------------------------
     eutrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |  -.0616923   .1651589    -0.37   0.711    -.3952376     .271853
madminocc70sd |   .1433031   .2042384     0.70   0.487    -.2691647    .5557708
   mopocc70sd |   -.295976    .181744    -1.63   0.111    -.6630155    .0710635
  uniontrendd |   .1429496   .1394272     1.03   0.311    -.1386294    .4245286
age3544trendd |  -.2140876   .1680843    -1.27   0.210    -.5535406    .1253655
      cendiv2 |  -.1504678   .6159559    -0.24   0.808    -1.394416     1.09348
      cendiv8 |  -.9047062   .4462304    -2.03   0.049    -1.805887   -.0035256
      cendiv9 |   -1.50966   .5757362    -2.62   0.012    -2.672383    -.346937
        _cons |   .3232967   .1786579     1.81   0.078    -.0375104    .6841037
-------------------------------------------------------------------------------

->  estimates store eumodregb

->  reg empchangetrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.04
       Model |  .040538338         1  .040538338   Prob > F        =    0.8361
    Residual |  44.9612888        48  .936693517   R-squared       =    0.0009
-------------+----------------------------------   Adj R-squared   =   -0.0199
       Total |  45.0018272        49  .918404636   Root MSE        =    .96783

------------------------------------------------------------------------------
empchange~dd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |    .028763   .1382613     0.21   0.836      -.24923    .3067561
       _cons |  -.0442727   .1368717    -0.32   0.748    -.3194717    .2309264
------------------------------------------------------------------------------

->  estimates store empchangemodreg

->  reg empchangetrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      5.55
       Model |   23.391445         8  2.92393063   Prob > F        =    0.0001
    Residual |  21.6103821        41  .527082491   R-squared       =    0.5198
-------------+----------------------------------   Adj R-squared   =    0.4261
       Total |  45.0018272        49  .918404636   Root MSE        =      .726

-------------------------------------------------------------------------------
empchanget~dd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |   .0662993   .1262203     0.53   0.602    -.1886078    .3212065
madminocc70sd |  -.0133183   .1560862    -0.09   0.932    -.3285408    .3019043
   mopocc70sd |   .2315183   .1388953     1.67   0.103    -.0489864    .5120229
  uniontrendd |  -.2366945   .1065553    -2.22   0.032    -.4518872   -.0215018
age3544trendd |  -.0260699    .128456    -0.20   0.840     -.285492    .2333521
      cendiv2 |   .4982297   .4707354     1.06   0.296    -.4524398    1.448899
      cendiv8 |  -1.055481   .3410252    -3.10   0.004    -1.744195   -.3667663
      cendiv9 |  -.9683006   .4399981    -2.20   0.033    -1.856895   -.0797064
        _cons |   .1835032   .1365368     1.34   0.186    -.0922383    .4592448
-------------------------------------------------------------------------------

->  estimates store empchangemodregb

->  reg migstatetrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.04
       Model |  .042826268         1  .042826268   Prob > F        =    0.8399
    Residual |  49.8205362        48  1.03792784   R-squared       =    0.0009
-------------+----------------------------------   Adj R-squared   =   -0.0200
       Total |  49.8633625        49  1.01761964   Root MSE        =    1.0188

------------------------------------------------------------------------------
migstatet~dd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |  -.0295636   .1455411    -0.20   0.840    -.3221935    .2630663
       _cons |    -.00732   .1440783    -0.05   0.960    -.2970089    .2823688
------------------------------------------------------------------------------

->  estimates store migstatemodreg

->  reg migstatetrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      7.36
       Model |  29.3993264         8  3.67491579   Prob > F        =    0.0000
    Residual |  20.4640361        41  .499122833   R-squared       =    0.5896
-------------+----------------------------------   Adj R-squared   =    0.5095
       Total |  49.8633625        49  1.01761964   Root MSE        =    .70649

-------------------------------------------------------------------------------
migstatetr~dd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |  -.0735793    .122827    -0.60   0.552    -.3216335    .1744748
madminocc70sd |   -.059913   .1518899    -0.39   0.695    -.3666609     .246835
   mopocc70sd |    .085855   .1351611     0.64   0.529    -.1871085    .3588184
  uniontrendd |  -.2654491   .1036906    -2.56   0.014    -.4748565   -.0560417
age3544trendd |   .3005384   .1250025     2.40   0.021     .0480907     .552986
      cendiv2 |   .6983679   .4580799     1.52   0.135    -.2267434    1.623479
      cendiv8 |  -1.358413   .3318569    -4.09   0.000    -2.028611    -.688214
      cendiv9 |  -.3085993    .428169    -0.72   0.475    -1.173304    .5561055
        _cons |   .1932319    .132866     1.45   0.153    -.0750965    .4615603
-------------------------------------------------------------------------------

->  estimates store migstatemodregb

->  reg jcrtrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.97
       Model |  .990759126         1  .990759126   Prob > F        =    0.3295
    Residual |  48.9937193        48  1.02070248   R-squared       =    0.0198
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  49.9844784        49   1.0200914   Root MSE        =    1.0103

------------------------------------------------------------------------------
   jcrtrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |   .1421956   .1443283     0.99   0.329     -.147996    .4323871
       _cons |   -.002467   .1428777    -0.02   0.986    -.2897419     .284808
------------------------------------------------------------------------------

->  estimates store jcrmodreg

->  reg jcrtrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =     21.02
       Model |  40.1869671         8  5.02337089   Prob > F        =    0.0000
    Residual |  9.79751127        41  .238963689   R-squared       =    0.8040
-------------+----------------------------------   Adj R-squared   =    0.7657
       Total |  49.9844784        49   1.0200914   Root MSE        =    .48884

-------------------------------------------------------------------------------
    jcrtrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |   .0038131   .0849877     0.04   0.964     -.167823    .1754492
madminocc70sd |   .3753337   .1050972     3.57   0.001     .1630855    .5875819
   mopocc70sd |   .3929094   .0935221     4.20   0.000     .2040377     .581781
  uniontrendd |  -.2077652   .0717466    -2.90   0.006    -.3526604   -.0628699
age3544trendd |    .326163    .086493     3.77   0.001     .1514868    .5008392
      cendiv2 |   .2152577   .3169593     0.68   0.501    -.4248546      .85537
      cendiv8 |  -.7311225   .2296218    -3.18   0.003    -1.194853   -.2673919
      cendiv9 |  -1.084587    .296263    -3.66   0.001    -1.682903    -.486272
        _cons |   .2322752    .091934     2.53   0.015     .0466107    .4179397
-------------------------------------------------------------------------------

->  estimates store jcrmodregb

->  reg jdrtrendd whartond if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(1, 48)        =      0.30
       Model |  .294205484         1  .294205484   Prob > F        =    0.5885
    Residual |  47.5926174        48  .991512863   R-squared       =    0.0061
-------------+----------------------------------   Adj R-squared   =   -0.0146
       Total |  47.8868229        49    .9772821   Root MSE        =    .99575

------------------------------------------------------------------------------
   jdrtrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    whartond |   .0774867   .1422496     0.54   0.588    -.2085253    .3634988
       _cons |   .0287871   .1408199     0.20   0.839    -.2543504    .3119246
------------------------------------------------------------------------------

->  estimates store jdrmodreg

->  reg jdrtrendd whartond madminocc70sd mopocc70sd uniontrendd age3544trendd cendiv2 cendiv8 cendiv9 if year==2000

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(8, 41)        =      8.88
       Model |  30.3605344         8   3.7950668   Prob > F        =    0.0000
    Residual |  17.5262885        41   .42747045   R-squared       =    0.6340
-------------+----------------------------------   Adj R-squared   =    0.5626
       Total |  47.8868229        49    .9772821   Root MSE        =    .65381

-------------------------------------------------------------------------------
    jdrtrendd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     whartond |   .0316789   .1136693     0.28   0.782    -.1978809    .2612387
madminocc70sd |    .153603   .1405654     1.09   0.281    -.1302745    .4374806
   mopocc70sd |   .3552318   .1250838     2.84   0.007     .1026199    .6078437
  uniontrendd |  -.1349229   .0959596    -1.41   0.167    -.3287174    .0588715
age3544trendd |   .3176573   .1156826     2.75   0.009     .0840316    .5512831
      cendiv2 |   -.315586   .4239265    -0.74   0.461    -1.171723     .540551
      cendiv8 |  -.4520347   .3071144    -1.47   0.149    -1.072265    .1681954
      cendiv9 |  -1.073343   .3962457    -2.71   0.010    -1.873578    -.273109
        _cons |   .2317553   .1229599     1.88   0.067    -.0165672    .4800778
-------------------------------------------------------------------------------

->  estimates store jdrmodregb

. estout f1pmodreg avgmodreg nemodreg enmodreg uemodreg eumodreg empchangemodreg migstatemodreg jcrmodreg jdrmodreg, keep(whartond) cells(b(star fmt(2)) se(par fmt(2))) stats(N r2_a, fmt(%15.0f %15.2f)) 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                f1pmodreg       avgmodreg        nemodreg        enmodreg        uemodreg        eumodreg    empchangem~g    migstatemo~g       jcrmodreg       jdrmodreg   
                     b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
whartond             0.17            0.12            0.43**          0.42**         -0.07           -0.18            0.03           -0.03            0.14            0.08   
                   (0.14)          (0.14)          (0.13)          (0.13)          (0.14)          (0.14)          (0.14)          (0.15)          (0.14)          (0.14)   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                      50              50              50              50              50              50              50              50              50              50   
r2_a                 0.01           -0.01            0.17            0.16           -0.02            0.01           -0.02           -0.02           -0.00           -0.01   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. estout f1pmodregb avgmodregb nemodregb enmodregb uemodregb eumodregb empchangemodregb migstatemodregb jcrmodregb jdrmodregb, keep(whartond) cells(b(star fmt(2)) se(par fmt(2))) stats(N r2_a, fmt(%15.0f %15.2f)) 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
               f1pmodregb      avgmodregb       nemodregb       enmodregb       uemodregb       eumodregb    empchangem~b    migstatemo~b      jcrmodregb      jdrmodregb   
                     b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se            b/se   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
whartond             0.04            0.02            0.32**          0.23           -0.30*          -0.06            0.07           -0.07            0.00            0.03   
                   (0.08)          (0.09)          (0.10)          (0.15)          (0.14)          (0.17)          (0.13)          (0.12)          (0.08)          (0.11)   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
N                      50              50              50              50              50              50              50              50              50              50   
r2_a                 0.80            0.71            0.68            0.28            0.33            0.12            0.43            0.51            0.77            0.56   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. 
. 
. * graph of trend in HR rate and trend in fluidity
. gr7  f1ptrend98 hrtrend if year==2000 , s([state]) ylab(-.15(.03)0) xlab(0.00004(.00004).00024)

. gr7  relf1ptrend98 hrtrend if year==2000 & state~=11 , s([state]) ylab(-.018(.003)0.006) xlab(0.00004(.00001).0001) l1("Trend in Labor Market Fluidity 1998-2013") b2("Trend in Human Resource Membership 1998-2013") saving(Output\Figure_12\hrfig, rep
> lace)

. 
. * graph of Wharton regulation index and trend in fluidity
. gr7  relf1ptrend wharton if year==2000 & state~=11 , s([state]) ylab(-.024(.003)-.003) xlab(-1.2(.4)2.4)  l1("Trend in Labor Market Fluidity") b2("Land Use Regulation") saving(Output\Figure_10\regfig, replace)

. 
. outfile state relf1ptrend98 hrtrend  if year==2000 & state~=11 using Output\Figure_12\hrfig.csv, comma wide replace nolab

. outfile state relf1ptrend wharton  if year==2000 & state~=11 using Output\Figure_10\regfig.csv, comma wide replace nolab

. 
. quietly log close
