----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\BPEA\PSID_CPS_Materials\CPS_Data_Setup\cpscovariates.log
  log type:  text
 opened on:   3 Mar 2020, 17:46:11

. 
. *use cps_00026.dta, clear
. use Input\cps_00026.dta, clear

. 
. quietly for var age: replace X = . if qX==1 | qX==3

. 
. gen age17m = age<=17 if age~=.
(94,898 missing values generated)

. gen age1822 = age>=18 & age<=22 if age~=.
(94,898 missing values generated)

. gen age2334 = age>=23 & age<=34 if age~=.
(94,898 missing values generated)

. gen age3544 = age>=35 & age<=44 if age~=.
(94,898 missing values generated)

. gen age4564 = age>=45 & age<=64 if age~=.
(94,898 missing values generated)

. gen age64p = age>=65 if age~=.
(94,898 missing values generated)

. 
. 
. * hsdeg includes respondents who report high school but diploma is unclear
. replace educ = . if qeduc==1 
(81,998 real changes made, 81,998 to missing)

. replace educ = . if educ==1 | educ==999
(1,953,002 real changes made, 1,953,002 to missing)

. gen lths = educ>=2 & educ<=71 if educ~=.
(2,090,882 missing values generated)

. gen hsdeg = (educ==72 | educ==73) &  educ~=.

. gen somecol = educ>=80 & educ<=110 if educ~=.
(2,090,882 missing values generated)

. gen collplus = educ>=111 & educ<=125 if educ~=.
(2,090,882 missing values generated)

. 
. replace marst = . if qmarst>=2 & qmarst<=5
(56,288 real changes made, 56,288 to missing)

. gen married = marst==1 if marst~=. & age>=18 & age~=.
(2,557,057 missing values generated)

. gen single = marst==6 if marst~=. & age>=18 & age~=.
(2,557,057 missing values generated)

. 
. replace ownershp=. if ownershp==0
(0 real changes made)

. gen owner = ownershp==10 if ownershp~=. 
(1,550,064 missing values generated)

. 
. replace sex = . if qsex>=1 & qsex<=3
(7,482 real changes made, 7,482 to missing)

. gen female = sex==2 if sex~=.
(7,482 missing values generated)

. 
. gen primemale = age>=25 & age<=54 & female==0 if age~=. & sex~=.
(98,863 missing values generated)

. gen primefemale = age>=25 & age<=54 & female==1 if age~=. & sex~=.
(98,863 missing values generated)

. 
. gen mfg = ind1990>=100 & ind1990<=392 if ind1990~=.
(415,399 missing values generated)

. gen serv = ind1990>=721 & ind1990<=893 if ind1990~=.
(415,399 missing values generated)

. gen retail = ind1990>=580 & ind1990<=691 if ind1990~=.
(415,399 missing values generated)

. gen ag = ind1990>=10 & ind1990<=32 if ind1990~=.
(415,399 missing values generated)

. gen fire = ind1990>=700 & ind1990<=712 if ind1990~=.
(415,399 missing values generated)

. 
. replace classwkr = . if classwkr==0 | classwkr==99 | (qclasswk>=1 & qclasswk<=9)
(4,375,962 real changes made, 4,375,962 to missing)

. gen selfemp =  classwkr>=10 & classwkr<=14 if classwkr<=23
(5,047,973 missing values generated)

. gen gov = classwkr>=24 & classwkr<=28 if classwkr<=28
(4,399,055 missing values generated)

. 
. replace occ1990 = . if qocc>=2 & qocc<=4
(42,054 real changes made, 42,054 to missing)

. replace occ1990 = . if age<=17
(2,378,487 real changes made, 2,378,487 to missing)

. gen manprof = occ1990>=3 & occ1990<=199 if occ1990~=.
(2,835,940 missing values generated)

. gen techocc = occ1990>=203 & occ1990<=235 if occ1990~=.
(2,835,940 missing values generated)

. gen salesocc = occ1990>=243 & occ1990<=290 if occ1990~=.
(2,835,940 missing values generated)

. gen adminocc = occ1990>=303 & occ1990<=391 if occ1990~=.
(2,835,940 missing values generated)

. gen servocc = occ1990>=405 & occ1990<=469 if occ1990~=.
(2,835,940 missing values generated)

. gen prodocc = occ1990>=503 & occ1990<=699 if occ1990~=.
(2,835,940 missing values generated)

. gen opocc = occ1990>=703 & occ1990<=779 if occ1990~=.
(2,835,940 missing values generated)

. gen military = occ1990==905 if occ1990~=.
(2,835,940 missing values generated)

. 
. gen af = popstat==2 if popstat<=2
(1,956,080 missing values generated)

. tab military af

           |          af
  military |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,599,469          0 | 5,599,469 
         1 |       731     31,793 |    32,524 
-----------+----------------------+----------
     Total | 5,600,200     31,793 | 5,631,993 

. 
. gen fborn = citizen==2 | citizen==3 if citizen~=.
(4,408,571 missing values generated)

. 
. gen inschool = schlcoll>=1 & schlcoll<=4 if schlcoll~=0
(4,434,747 missing values generated)

. 
. replace migrate1 = . if (qmigrat1>=1 & qmigrat1<=4) | year==1995 | year==1963
(694,199 real changes made, 694,199 to missing)

. gen smigrant = 1 if migrate1==5
(8,338,795 missing values generated)

. replace smigrant = 0 if migrate1>=1 & migrate1<=4
(6,095,340 real changes made)

. 
. replace numemps = . if qnumemps==1
(52,288 real changes made, 52,288 to missing)

. gen empchangeipums = 1 if numemps==2 | numemps==3
(8,010,314 missing values generated)

. replace empchangeipums = 0 if numemps==1
(3,034,141 real changes made)

. 
. replace incwage = . if qincwage>=1 & qincwage<=3
(227,317 real changes made, 227,317 to missing)

. replace incwage = . if incwage==9999999 | incwage==9999998 | incwage==0
(4,411,363 real changes made, 4,411,363 to missing)

. 
. replace wtsupp = . if wtsupp<0
(497 real changes made, 497 to missing)

. *save temp, replace
. save Output\temp, replace
(note: file Output\temp.dta not found)
file Output\temp.dta saved

. gen ones = 1

. collapse (sum) pop=ones (mean) age17m-age64p lths-collplus married single female mfg serv retail ag fire gov selfemp manprof-military fborn smigrant inschool empchangeipums owner primemale primefemale (p90) p90incwage=incwage (p10) p10incwage=incwa
> ge [w=wtsupp], by(statefip year)
(analytic weights assumed)

. replace inschool = . if year<=1985
(1,003 real changes made, 1,003 to missing)

. sort statefip year

. quietly for var p90incwage p10incwage: quietly by statefip: gen X1 = X[_n+1]

. gen p9010incwage1 = log(p90incwage1/p10incwage1)
(75 missing values generated)

. rename statefip state

. *save cpscovariates, replace
. save Output\cpscovariates, replace
file Output\cpscovariates.dta saved

. 
. *use temp, clear
. use Output\temp, clear

. collapse (mean) smigrant empchangeipums [w=wtsupp] if age>=35 & age<=64, by(statefip year)
(analytic weights assumed)

. rename statefip state

. *save ipums3564, replace
. save Output\ipums3564, replace
file Output\ipums3564.dta saved

. 
. *use temp, clear
. use Output\temp, clear

. replace whymove = . if qwhymove>=1 & qwhymove<=3
(59,235 real changes made, 59,235 to missing)

. gen famreason = smigrant==1 & whymove>=1 & whymove<=3 if whymove~=. & smigrant<=1
(5,614,935 missing values generated)

. gen empreason = smigrant==1 & whymove>=4 & whymove<=8 if whymove~=. & smigrant<=1
(5,614,935 missing values generated)

. gen housreason = smigrant==1 & whymove>=9 & whymove<=13 if whymove~=. & smigrant<=1
(5,614,935 missing values generated)

. gen othreason = smigrant==1 & whymove>=14 & whymove<=19 if whymove~=. & smigrant<=1
(5,614,935 missing values generated)

. gen empreason2 = smigrant==1 & whymove>=4 & whymove<=5 if whymove~=. & smigrant<=1
(5,614,935 missing values generated)

. 
. sum empreason empchangeipums if smigrant==1  [w=wtsupp]
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
   empreason |  49,388  77668922.5    .5032904   .4999942          0          1
empchangei~s |  69,567   110060404    .3777213   .4848209          0          1

. sum empreason empchangeipums if smigrant==1 & empreason~=. [w=wtsupp]
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
   empreason |  49,388  77668922.5    .5032904   .4999942          0          1
empchangei~s |  26,728  43520325.5    .3522133    .477669          0          1

. sum empreason if smigrant==1 & empchangeipums==0 [w=wtsupp]
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
   empreason |  17,028  28191887.3    .5593794   .4964761          0          1

. sum empreason if smigrant==1 & age>=22 [w=wtsupp]
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
   empreason |  32,393  53681573.5    .5186782   .4996587          0          1

. 
. gen smig14c = smigrant if age>=14 & military==0
(4,270,414 missing values generated)

. collapse (mean)  smigrant smig14c famreason empreason* housreason othreason empchangeipums [w=wtsupp], by(year)
(analytic weights assumed)

. 
. *graph twoway line smigrant year if year, saving(temp, replace) xlab(1965(5)2015)
. graph twoway line smigrant year if year, saving(Output\temp, replace) xlab(1965(5)2015)
(file Output\temp.gph saved)

. *graph twoway line famreason empreason empreason2 housreason othreason year if year>=1999, saving(temp2, replace)
. graph twoway line famreason empreason empreason2 housreason othreason year if year>=1999, saving(Output\temp2, replace)
(file Output\temp2.gph saved)

. 
. *save cpsmig, replace
. save Output\cpsmig, replace
file Output\cpsmig.dta saved

. 
. *insheet using bds_e_st_releast.csv, clear
. insheet using Input\bds_e_st_releast.csv, clear
(27 vars, 1,887 obs)

. rename year2 year

. keep year state job_creation_rate job_destruction_rate

. rename job_creation_rate jcr

. rename job_destruction_rate jdr

. 
. *merge 1:1 state year using cpscovariates
. merge 1:1 state year using Output\cpscovariates
(label STATEFIP already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           646
        from master                         0  (_merge==1)
        from using                        646  (_merge==2)

    matched                             1,887  (_merge==3)
    -----------------------------------------

. drop _merge

. *save cpscovariates, replace
. save Output\cpscovariates, replace
file Output\cpscovariates.dta saved

. 
. quietly log close
